{
  "data": {
    "articles": {
      "home" : {
        "visions": [
          {
            "id": 116,
            "title": "The Vision of The Lord Jesus And The Reward Of The Saints!",
            "headerText": "The Vision of The Lord Jesus And The Reward Of The Saints!",
            "content": "On the 23/04/ 2023 which was a Sunday Morning, I was in the place of prayer from 12 am to around 5 am, as My custom is to make intercession for the Church, the saints and Pastors that the Lord will Show Himself Mighty in our services by Many infallible proofs, and while I was praying, I saw 3 Visions, which are for the comfort, strengthening and encouragement of the Saints. <br> <br> This is the First vision I saw,  In this vision, I saw thousands of Saints upon a Great and High Mountain, which in the Spirit is called Mount Zion. This mountain had seven layers and I saw in one of the layers, thousands upon thousands of Saints working on the mountain, some were praying, some were teaching, while others were supplying the needs of those who were praying and teaching, and I saw that there were beings that moved in the midst of the saints with Scrolls and ink horns and were writing down in full details everything that were done by the saints. I saw that for those who prayed, all the hours to the minutes, they prayed were recorded and for those who taught, all what they taught was recorded. <br> <br>I saw these Angels acend to another layer still on Mount Zion and on that Layer I saw the Spirits of Just Men Made Perfect, they were in  councils and their discussions pertaining the Purpose of the Most High God in all the Worlds. <br> <br> An Angel went into another layer and this time, he entered into a place where there were books, millions of books and there he kept the records of what he had written down. <br> <br> While I was watching the vision, I heard a trumpet sound and all the beings both in the layer of the saints who were still on earth and those who are the layer of spirit of just men made perfect, everyone lay flat in worship and adoration to the Great King and Lord of Spirits - Jesus the Christ and I saw the Lord Jesus descended to the Layer of the saints who were still on earth but in service to him, and when He came before anyone of them, a scroll will appear in his hands, and He will read the things which were written in the scroll of the person and pronounce blessings upon the person, he did this for everyone one by one, and only the person who was being blessed could understand the words of his blessings but to others it sounded like tongues. <br> <br> At this point, the vision ended and when I got up, the time was 6:30 am and while I was meditating on the vision to seek understanding, the Holy Spirit said to me... <br>  <br> /The Lord Jesus takes account to the details of all what is done for the glory of His name and the advancement of His Kingdom, the services and sacrifices done for the sake of Christ are not in Vain for He Himself is the Great Reward and Rewarder of the labour of Love of the saints, thus Let he who teaches, Keep teaching, let he who prays keep praying, let he who gives keep giving, let he who serves, keep Serving for the time of Rewards is at hand, but in all you do in words and in works let it be done in the Name of the Lord Jesus and for His Glory / <br> <br>Then also I had an understanding by the inspiration of the Holy Spirit; <br> Only through ministering to the Lord in worship and praise can we receive the reward of our labour of Love in ministering unto the saints. <br> <br> And while I was writing this vision, the Holy Spirit brought this scripture to My Remembrance; <br> <br> Isaiah 62:11 KJV <br> Behold, the Lord hath proclaimed unto the end of the world, Say ye to the daughter of Zion, Behold, thy salvation cometh; behold, his reward is with him, and his work before him. <br>  <br> Dear Saints be not discouraged on because you have not yet see a reward for your service and sacrifice for the Kingdom of Christ, for Many Christians it has gotten to a point where you are doubting if truly You are serving the Most High God, it has come to the Point that your Life has become a mockery to people on account of your service but be encouraged Dear Servants of God, if what you are doing is by the revelation of the Spirit and agrees with the Scripture then you are Serving God. Be encouraged by this Oracle and keep on doing the work God has entrusted in your hands for this is good in the sight of the Lord and in due time, he shall Reward You! <br> <br> I pray for You, May the Grace of God strengthen your feet to walk with Jesus and empower your hands to work for Jesus, and  May the Father and God of Our Lord Jesus, who is the Faithful Covenant Keeping God, Remember your labour of Love and give you a blessing that will make you the praise of your family. <br> <br> Great grace  <br> The Priest of God",
            "picture": "image1.jpg",
            "date": "2024-01-29"
          },
          {
            "id": 13,
            "title": "The Vsion About Pornography",
            "headerText": "The Vsion About Pornography",
            "content": "(The Prophetic Cry Against the spirit of Jezebel)   <br>   <br> While in the place of prayer the Lord spoke to me thus ;   <br>   <br> /My Prophet arise and cry out against the Spirit of Jezebel, behold the Evil one has purposed to seduce my People and turn their hearts away from the Father, the Spirit of Lust has been assigned to carry out this great task against the People of God !   <br>   <br> Then I was caught up in the visions of God and the Angel of the Lord said to me;  /PORNOGRAPHY shall be the major weapon of the Spirit of Jezebel against the People of God, Pornography is the key that has been handed to the Spirit of Jezebel to open their heart to the spirit of Lust and make them slaves of uncontrollable and insatiable sexual desires/ !   <br>   <br> Then the Angel of the Lord Said to Me;    <br>   <br> /So many are already enslaved by this Spirit and are helpless, for they no longer have  control over their sexual desires but are slaves to this Evil spirit which will make them often satisfy the Lust of the flesh in fornication, adultery , And masturbation. Therefore arise and weep for their souls, weep for their Souls for their hearts are full of thoughts of sexual perversion...!   <br>   <br> At this Point, like a veil was shifted and I could see some people in their rooms, and I looked and those who were watching pornography and a great mystery was revealed to me;   <br>   <br> I saw that as they were watching some dark cloud came out of the TV screen and filled their rooms and suddenly naked evil spirits looking like beasts started holding unto the people and kissing them and using their private parts and rubbing it to their faces ( for Women watching  it will be an evil spirit with a very large Manhood with the head of a serpent that will be rubbing on her mouth, if it was a Man then it will be evil spirits with vaginas but with the head of a Dog in it rubbing their private part on the mouth of the person) ....   <br>   <br> At this point I was greatly disturbed by this vision and the angel of the Lord showed me again how a liquid came out from the demons private part and they spilled it on the people watching and this gave the People a very bad spiritual scent and everywhere they went these evil spirits followed them and this odour was upon them and this odour attracted other demonic spirits to follow the people I saw demons on affliction, poverty and disappointment come upon these people and oppressed them and whenever they prayed angels could not help them because of the spiritual odour, which prevented angels from coming close!   <br>   <br> And I began crying oh Lord Have Mercy , And  I said, Oh Lord what can we do ?   <br>   <br> The Angel of the Lord replied , /this kind of evil Spirit goes out only by Prayers, Fasting and meditation on the Word of God,  for the roots of these evil spirits have gone deep into their hearts and they have been enslaved by them to fulfill the evil desires of their flesh/!  <br>   <br> Behold at this point I was disturbed  because I could recognize some Christians and even some pastors and I wept bitterly crying for mercy, more so I noticed the Face of the Angel of the Lord was not looking Happy and he turned and said to me , /This is evil strategy through which the heart of the people of God have been turned against the ways of righteousness and their hearts hardened against the voice of the Holy Spirit, and this is what has caused them to withdraw themselves from the secret place of fellowship wherein the Lord Dwells /  <br>   <br> And the Angel of the Lord told me that by watching pornography people enter unconsciously into covenants with Evil  spirits from the kingdom of the waters !   <br>   <br> And I enquired again what should be done;   <br>   <br> And then the Angel of the Lord Answered me thus;  /all those caught up with this must Repent, seek for Mercy and  confess this sin to a  servant of God for the strength of this evil spirit  is secrecy , those who have been entangled must not forget about shame, and they must quickly save their souls by confession and the servants of God shall Pray for them calling upon the power in the Blood of Lamb  so that they may be redeemed from the hand of the wicked one !   <br>   <br> After this, they must continually meditate upon the scriptures and must give their heart to the Gospel which is the revelation of the righteousness of God  that they may discipline their feet to walk  in the High way of Holiness and the Grace of the Lord Jesus shall strengthen them to overcome the desires of the sinful Nature and they shall reign through Godliness/ !   <br>   <br> May the Lord Jesus in His Love wash us from our sins in his own blood and May He grant us grace to walk in the Spirit so that we will not fulfill the Lusts of the flesh !   <br>   <br> Great Grace   <br> The Priest of God<br>cc: Prophet Kevin OnLine",
            "picture": "image1.jpg",
            "date": "2024-01-29"
          }
        ],
        "questions": [
          {
            "id": 27,
            "title": "Question: Good day Sir, I love football but sometimes I have this fear in me that football can take me away from the Lord Jesus because of the kind of Passion I have for it, please I want to ask sir, is Football godly or worldly?",
            "headerText": "Is Football godly or worldly?",
            "content": "Answer: This question raises an important point regarding the subtle strategies through which the devil appeals to the world and how the Babylonian system has enslaved humanity. Let me begin by addressing the scriptural perspective on sports. <br>  <br> According to 1 Timothy 4:8 (KJV), bodily exercise is beneficial to some extent, but godliness is profitable for all things, in this life and the hereafter. The Holy Spirit approves of bodily exercise as it contributes to physical health and can even be financially rewarding for those pursuing a career in sports.  <br>  <br> Having established that God is not against sports, including football, it is important to recognize that football, like any other natural activity, can be subject to spiritual influences. The main issue with football today lies in the spirit that influences it. The character of an activity reveals the spirit behind it. If an activity does not promote or enhance righteousness, it is not under the influence of the Holy Spirit.  <br>  <br> Jesus spoke about the ministry of the Holy Spirit in John 16:8, 14 (KJV) when He said that the Spirit would convict the world of sin, righteousness, and judgment. We can discern the presence of the Holy Spirit in an activity by assessing whether it promotes the righteousness of God. Furthermore, an activity that glorifies the Lord Jesus is under the influence of the Holy Spirit. Therefore, we must examine whether football activities truly glorify the Lord Jesus or instead exalt and idolize human beings, thus magnifying the flesh.  <br>  <br> Football, which initially started as a neutral activity for exercise and pleasure, has been exploited by Satan, the god of this world, to deceive and corrupt many, leading them away from the Lord Jesus. Satan has established a worldly system that turns people's hearts away from loving the Lord and towards loving the world. Scripture emphasizes that the whole world lies under the power of the Evil One (1 John 5:19, KJV), and Satan blinds the minds of unbelievers so that they do not perceive the light of the glorious gospel of Christ (2 Corinthians 4:4, KJV).  <br>  <br> It is crucial to remember the admonition in 1 John 2:15-16 (KJV) not to love the world or the things in it. Loving the world and its pursuits, characterized by the lust of the flesh, the lust of the eyes, and the pride of life, does not originate from the Father but from the world.  <br>  <br> Now, let's consider what exists in the world and compare it to football:  <br>  <br> 1. The Lust of the Flesh: It is noticeable today that betting companies have increased, and even Christians are engaging in betting on football matches. Even if they lose money, they are tempted to continue betting. Their flesh desires the potential gains.  <br>  <br> 2. The Lust of the Eyes: This is evident, especially when a football match is taking place, particularly if it involves the national team. People become engrossed in watching the match, and some are willing to pay significant sums for tickets to enter stadiums. Football becomes a visual temptation, with people staying up all night to watch matches, traveling from one nation to another to witness games. Some individuals even check scores during church services.  <br>  <br> 3. The Pride of Life: This is the pinnacle of football today. Conversations about football often revolve around who is the greatest or the best. Footballers are being exalted and glorified, even by Christians. It is shameful for a Christian to acknowledge someone other than Jesus Christ as a /god./ While Scripture mentions believers being called /gods,/ it refers to those who are born of Almighty God, not in terms of personal achievements. We are not gods because of what we have done; we are gods because we are born of God through the ministry of Jesus Christ. When a player is called the /god of football,/ it implies that Jesus Christ is not the God of football. Football is saturated with the Pride of Life, to the extent that humans have become idols to other humans. However, God explicitly warned against having idols, as John the Apostle stated: /Little children, keep yourselves from idols/ (1 John 5:21, KJV).  <br>  <br> Scripture instructs us to stay away from idols, and yet football is a system that creates idols. People claim that certain players are their idols, which is a manifestation of the Pride of Life. Additionally, there is a term called /GOAT,/ which stands for /Greatest Of All Time./ This is a great deception. Let's turn to scripture to understand what goats represent. In Scripture, goats represent rebels and the disobedient. In Matthew 25:32-33, it is written: /And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: And he shall set the sheep on his right hand, but the goats on the left./ Furthermore, all the goats were sent to the lake of fire, as stated in Matthew 25:41: /Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels./  <br>  <br> Notice that goats are referred to as the cursed ones and as messengers of the devil. As Christians, we should not use terms as the world does. We must seek the mind of God, which is revealed in Scripture. If Scripture refers to /goats/ as rebels, we should not reinterpret it to mean /Greatest Of All Time./ This is a worldly deception. Moreover, to truly understand the symbolism of goats, we must recognize its occult origin. In occultism, the goat is a symbol of Satan, the great rebel and disobedient one. In many movies and music, you will see the goat head symbol, which represents the devil. So, this labeling of /goat/ is demonic. When you call someone the /god of football/ or the /goat of football,/ you are essentially saying that they are messengers of the devil in football. How many of these individuals whom you call goats or gods of football have openly glorified or recommended the Lord Jesus? Instead, we see them supporting demonic agendas. Today, youths no longer consider Elijah, Moses, Joseph, or Daniel as role models; instead, they choose individuals who are not born again and do not acknowledge Jesus as their models. People now fight, insult, and become enemies because they have differing opinions on who they believe is the best player.  <br>  <br> Now, let's conclude by discussing the Pride of Life in football and the significance of the trophies awarded in competitions such as the World Cup, African Nations Cup, European Nations Cup, and Champions League. Have you ever considered the nature of the reward given to the winners? It is a trophy, often made of gold, and the winners are known to kiss it. But where does this practice of kissing gold objects come from?  <br>  <br> In Hosea 13:1-2 (KJV), it is written: /When Ephraim spake trembling, he exalted himself in Israel; but when he offended in Baal, he died. And now they sin more and more, and have made them molten images of their silver, and idols according to their own understanding, all of it the work of the craftsmen: they say of them, Let the men that sacrifice kiss the calves./  <br>  <br> Do not be deceived, the trophy given to the winners is an idol. How do you know it's an idol? Because it is worshipped. Remember the golden image in the Book of Daniel? In Daniel 3:4-5 (KJV), it is commanded: /That at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, dulcimer, and all kinds of music, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up./  <br>  <br> The golden image in Daniel was meant to be worshipped by all nations. When a nation wins the trophy, public holidays are declared, and the trophy is paraded from town to town, attracting millions of people who come to see, touch, and kiss it. Have you ever wondered why players always kiss their trophies? In the past, kissing an idol was a way of pledging allegiance to it.  <br>  <br> Therefore, football promotes the Pride of Life. Think about it: when you hear that a player has been bought for 100 million euros, is all that money simply for kicking a ball? No, it goes much deeper than that. These men are messengers of the Babylonian system. Some of them have contracts that forbid them from openly praising the Lord Jesus. Moreover, some of the gestures and signs made by footballers when they score are actually demonic symbols. Innocent youths imitate these signs, unknowingly becoming initiated into demonic worship.  <br>  <br> Now, with this understanding, the question arises: Can a Christian be a professional footballer? Yes, it is possible, but such a person must submit themselves to be properly discipled in the doctrine of Christ and the ways of God. Otherwise, they may be led astray by the money and glory that football offers, forgetting that their primary assignment is to be a light in the football system and turn footballers to the Lord Jesus. All Christians have one assignment, regardless of their profession or location, and that is to reveal the Lord Jesus and lead many to Him. The skills and talents given by God are meant to be instruments of His glory.  <br>  <br> For those who love football, I advise you to be cautious. Anything you love can become a snare to your soul if it is not centered on the Lord Jesus. You can watch and discuss football, but make sure you don't give yourself completely to that passion, or it will take control of your time, strength, and money. Remember what Apostle Paul said in 1 Corinthians 6:12: /Everything is permissible for me, but not everything is beneficial. Everything is permissible for me, but I will not be mastered by anything./  <br>  <br> As a Christian, make the Lord Jesus famous. Let your Facebook page and WhatsApp status be dedicated to making Jesus famous. If you do post about footballers, only share the ones who publicly praise the Lord Jesus. Do not boast about those who are ashamed of Him before men.  <br>  <br> Brethren, these are the last days, and the great war between light and darkness has begun. Unless we are spiritually discerning and sensitive, we will be deceived. As Scripture warns, Satan, the prince of darkness, disguises himself as an angel of light. Some may argue that terms like /goat/ mean /Greatest Of All Time/ or that calling someone the /god of football/ is not meant literally but as an honorific. However, we are instructed to abstain from all forms of evil (1 Thessalonians 5:22).  <br>  <br> We should be sensitive and not deceive ourselves by using names or supporting teams that carry demonic connotations. Terms like /Red Devils/ or teams with dragon symbols are associated with darkness and satanic imagery. Let us not call evil good and good evil, darkness light and light darkness, as warned in Isaiah 5:20.  <br>  <br> In these last days, seek the truth by committing yourself to fellowship with the Lord through prayer in the Spirit and meditation on the Scriptures. Remember to prioritize making Jesus famous and sharing the message of salvation with others.",
            "picture": "image4.jpg",
            "date": "2024-01-26"
          },
          {
            "id": 211,
            "title": "Question: Good day, Prophet. My heart is heavy because of the many failures I have experienced in life. My seeking of God seems to be in vain because I'm yet to see the manifestation of God, although I have received many prophecies and even visions. Due to the delay in fulfillment, I am now discouraged to even continue with spiritual activities. Please, how can I handle this? Thank you, Sir.",
            "headerText": "How can I Habdle Discouragement?",
            "content": "Answer: This question is very important because the answer will address one of the most fundamental challenges that all men face. Let me begin by stating that Christianity is not a means to escape the troubles of this world, as the Lord Himself said: <br> <br> John 16:33 (KJV) <br>/These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world./ <br> <br>Many Christians have a misconception on this subject, which is why they are easily deceived by Satan into thinking that their trials mean that God hates them. However, scripture reveals that even the one whom Jesus loved was sick (John 11:3-4). When the devil manipulates you to perceive your trials and temptations as proof of divine hatred, he will turn your heart away from God and fill your heart with ingratitude and your mouth with complaints. Complaints in the mouth are a symptom that the heart is full of discouragement, as it is written: <br> <br> Numbers 21:4-5 (KJV) <br> /And they journeyed from mount Hor by the way of the Red sea, to compass the land of Edom: and the soul of the people was much discouraged because of the way. [5] And the people complained against God, and against Moses, 'Wherefore have ye brought us up out of Egypt to die in the wilderness? for there is no bread, neither is there any water; and our soul loatheth this light bread./ <br> <br> Now it is clear that discouragement is the evil spirit Satan assigns to make men deny God through their words or their works. We must be conscious that every trial and temptation is a strategy by Satan to discourage the faith of men in God and even prompt doubt in the love of God. This is what happened to the Israelites. For instance: <br> <br> Deuteronomy 1:27: /You complained in your tents and said, 'The LORD must hate us. That's why he has brought us here from Egypt—to hand us over to the Amorites to be slaughtered./ <br> <br> You can see that, due to their trials, they were deceived by Satan into thinking that God hated them. This is exactly how Satan operates—through his evil schemes and operations, he causes trials in your life and then fills your heart with thoughts as though God hates you. Always remember that the purpose of Satan in every trial, temptation, trouble, and tribulation is to give men a reason to deny God. You can hear it from his own mouth: <br> <br>Job 1:9-11 (KJV) <br>/Then Satan answered the Lord, and said, 'Doth Job fear God for nought? [11] But put forth thine hand now, and touch all that he hath, and he will deny you to thy face./ <br> <br> Now I want you to understand that discouragement is not just a feeling; it is a spirit. It is one of the high-ranking evil spirits and one of the most deceptive and wicked demons of Hell. Whenever you feel discouraged, be aware that you are in a great spiritual warfare, and the devil is contending for your soul. <br> <br> You must treat discouragement as you treat the devil because it is his servant. Discouragement, together with fear, are the most effective demons that Satan employs in his battle against the saints because they are subtle and operate silently, manipulating your hearts into sorrow and bitterness through evil voices that lodge in your heart as ideas. When you sense discouragement, know that Satan has come for you. Resist and rebuke it in the name of the Lord. <br> <br> You must understand that what threatens Satan when he looks at men is not what they have done, but what they will do. Satan is threatened by the purpose of God attached to men, and the greatest spirit that hinders men from fulfilling the purpose of God is discouragement. See what is written: <br> <br> Isaiah 42:1,4 (KJV) <br> /Behold my servant, whom I uphold; mine elect, in whom my soul delighteth; I have put my spirit upon him: he shall bring forth judgment to the Gentiles. [4] He shall not fail nor be discouraged, till he have set judgment in the earth: and the isles shall wait for his law./ <br> <br> You can see that the Lord, speaking of His servant, said he shall not be discouraged until he has fulfilled his purpose. This is exactly what God instructed Joshua when He called him to lead the people into the Promised Land: <br> <br> Joshua 1:6-7,9 KJV <br> /Be strong and of good courage, for unto this people shalt thou divide for an inheritance the land, which I sware unto their fathers to give them. Only be thou strong and very courageous, that thou mayest observe to do according to all the law, which Moses my servant commanded thee: turn not from it to the right hand or to the left, that thou mayest prosper whithersoever thou goest. Have not I commanded thee? Be strong and of good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest./ <br> <br> Notice that the Lord said thrice, /Be courageous!/ You see how the Lord was preparing Joshua to fulfill his purpose by warning him against giving in to discouragement. Joshua had a great task ahead of him, and the devil would try to hinder him from fulfilling it. The greatest strategy of Satan would be to use the challenges Joshua would go through to try to discourage him. <br> <br> Now, what God told Joshua is what He tells us all today: /Be strong and be courageous!/ How can we be courageous? The answer is in the scriptures. <br> 1 Samuel 30:6 KJV <br> /And David was greatly distressed; for the people spake of stoning him, because the soul of all the people was grieved, every man for his sons and for his daughters: but David encouraged himself in the Lord his God./ <br> <br> When David's wife and daughters were kidnapped, David encouraged himself in the Lord. This was done by meditating on scriptures. Often, when we are discouraged, we begin to seek signs from God through dream or other means. But this is wrong and may lead to more deception. The only encouragement that God gives us is through His Word. <br> <br> For example, when John the Baptist was locked up in prison and became discouraged, he sent his disciples to Jesus. Let's see what happened: <br> <br> Matthew 11:1-6 KJV <br> /And it came to pass, when Jesus had made an end of commanding his twelve disciples, he departed thence to teach and to preach in their cities. Now when John had heard in the prison the works of Christ, he sent two of his disciples and said unto him, Art thou he that should come, or do we look for another? Jesus answered and said unto them, Go and shew John again those things which ye do hear and see: The blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the gospel preached to them. And blessed is he, whosoever shall not be offended in me./ <br> <br> After John's disciples left, Jesus said something significant: <br> <br> Matthew 11:11 KJV <br> /Verily I say unto you, Among them that are born of women there hath not risen a greater than John the Baptist: notwithstanding he that is least in the kingdom of heaven is greater than he./ <br> <br> Jesus did not send a message to John saying, /You are the greatest and most powerful prophet./ Many Christians expect God to encourage them in that way, asking questions like, /Am I still Your child? Do You still love me, Lord? Show me a sign!/ They are expecting a voice to speak from heaven or an angel to appear with a thunderous voice saying, /You are My very own child./ But that may or may not happen. Instead, when God wants to encourage us, He leads us to scriptures. <br> <br> The answer that the Lord sent to John was from the Book of Isaiah, where it is written; <br> <br> Isaiah 35:4-6 KJV <br> Say to them that are of a fearful heart, Be strong, fear not: behold, your God will come with vengeance, even God with a recompence; he will come and save you. [5] Then the eyes of the blind shall be opened, and the ears of the deaf shall be unstopped. [6] Then shall the lame man leap as an hart, and the tongue of the dumb sing: for in the wilderness shall waters break out, and streams in the desert. <br> <br> The Lord referred John to this scripture speaking of what will happen when the Messiah comes, for whom John himself was sent to prepare the way, John was familiar with the writings of Isaiah so much that when the Pharisees asked who he was he answered them by quoting From Isaiah saying ; <br> <br> Isaiah 40:3 KJV <br> The voice of him that crieth in the wilderness, Prepare ye the way of the Lord, make straight in the desert a highway for our God. <br> <br> You see thus the Lord Sent John to scriptures to encourage him so that his faith might stand on the Word and not on signs. The only way to handle discouragement is to go back and meditate on scriptures. Don't ask for a sign or ask God to prove anything to you, for that would be unbelief. If you search the scriptures, you will realize that discouragement is a demon that often comes after great men and women of faith. It came after Moses (Numbers 11:15), Elijah (1 Kings 19:4), and even Jesus (Matthew 26:38-39). <br> <br> However, they did not give in to discouragement. When the demon of discouragement came against Jesus, He prayed even more and encouraged Himself with the Word of God, saying, /Let the will of God be done!/ <br> <br> God does not always give us miracles to encourage us because if He did, we might become more focused on miracles  than the His word and be easily deceived. Instead, God gives us His Word as a source of encouragement. Nehemiah 8:10 says, /Then he said unto them, 'This day is holy unto our Lord: neither be ye sorry; for the joy of the Lord is your strength./ <br> <br> When you become discouraged, search for scriptures and not rely solely on your feelings. Resist the feeling of discouragement with scriptures, because most often the ideas that lead men into discouragement are lies from Satan, he uses our circumstances to project ideas that makes us doubt the Love of God, the willingness of God and even the Faithfulness of God! And as Jesus taught us through his own temptation, the most effective weapon against Satan is what is written! <br> <br> If You are discouraged, and there is an idea in your Mind implying that God does want to forgive your sins, or God does not went to show you mercy remember it is written; Psalm 86:5  <br> For thou, Lord, art good, and ready to forgive; and plenteous in mercy unto all them that call upon thee. <br>  <br> If an idea comes up in your mind implying that God is not hearing you, or he does not want to deliver you, remember it is written; <br> Psalm 34:17 KJV <br> The righteous cry, and the Lord heareth, and delivereth them out of all their troubles! <br> <br> If an idea comes up in your mind implying that God is unwilling to heal you then remember it is written; <br> Acts 10:38 KJV <br> How God anointed Jesus of Nazareth with the Holy Ghost and with power: who went about doing good, and healing all that were oppressed of the devil; for God was with him. <br> <br> We can go on and on, the Scriptures are full of wonderful truths from God that have power to destroy the lies of the devil! <br> So search the scriptures, speak the scriptures, and You will overcome!  Don't surrender to discouragement, encourage yourself in the Lord!",
            "picture": "image3.jpg",
            "date": "2024-01-27"
          }
        ]
      },
      "visions": [
        {
          "id": 11,
          "title": "The Vision of the Saints, The Beasts and the Blood dripping from the Right hand of the Lord Jesus!",
          "headerText": "The Vision of the Saints, The Beasts and the Blood dripping from the Right hand of the Lord Jesus!",
          "content": "Vision: On the dawn of the 27th day of the third month in the year 2023, I was caught up in the Visions of God and I received an Oracle from the Spirit of God for the Comfort and Victory of the Saints.  <br> <br>I saw a vision where, a group of Brethren  were on a journey to a glorious city, the way to the city was full of Light but on both sides of the way there was a great cloud of Darkness, this journey was plagued with all forms of adversities and hardships to try them and prove their Faith in the Lord their God, but no matter the afflictions they strengthened themselves in the knowledge that the Lord God is their Rewarder and they encouraged one another to despise the pain and shame of their journey so they may be found worthy to obtain the crown of glory from the hands of the Great King!  <br> <br>At a certain point of the journey, the Bread and Water we had in our bags got finished and we began to be in want and our strength was diminished on account of thirst and hunger and some of the brethren began complaining bitterly and while we were in argument, we saw a pathway that was a deviation from the Main Way, and this pathway into the darkness led to a small city and some suggested that we go there to see if we May find bread and water there in.  <br> <br> While some refused, some insisted and thus there was a break away, some went into the city and found some women selling cakes, which they freely gave some to the brethren, and the brethren who had received this cake came back and joined the other company and more of the brethren went into the city and also received the cakes from the hands of those women and when they asked for water, the Women Said they have no water but they have wine, of which they gave to the brethren and they received them!  <br> <br>But some of the brethren refused to eat of the cake nor drink the wine that was brought from that City on the pathway of darkness!  <br> <br>Now the brethren came back on the journey and continued the journey then on the way, the eyes of those who received the wine became heavy, and they began sleeping on their way, when they began sleeping, suddenly ravenous beasts and wolves came out of the forests and began to devour some of them, and then a Battle began, and the brethren fought with all their might but those who hath drank the wine could not prevail because their eyes were heavy with sleep and they slept in the midst of the battles and they were overcome, but the other brethren fought and prevailed and the beasts ran back into the darkness that was on the waysides !  <br> <br>They wept for the brethren lost and they continued the journey and then something strange happened;  <br> <br>The brethren who had eaten the bread began to walk off the way, they were walking into different directions, some left and ran into the darkness, others turned back, yet others still began cursing other brethren, they began saying and doing things they did not want to do but it was beyond their power to control themselves, and while the other brethren were wondering what had happened, the Lord opened the eyes of the faithful brethren, and they saw that the cakes that these brethren had eaten had become WORMS in them, these worms were black but had the fangs of a scorpions and they had gripped the people in their heart, and the women who gave those cakes, were the Mistresses of those Worms and when they spoke the worms will make the people obey and do all what those women said even though they did not want so!  <br> <br>At this point, the Faithful brethren began praying for the other brethren and the Lightning of God began striking those worms in them and they died. And when they died, they came out from their mouth as white substance that looked like gum!  <br> <br>Now when those women saw what happened, they transformed into those beasts and this time around some fierce Men also joined them and turned into beasts and they came and surrounded the brethren and this time around the battle was fierce than before, for those beasts came at the saints with their full force, they brought forth Beasts, Serpents and Birds; and the saints prayed!  <br> <br>Oh they prayed and called upon the name of the Lord their God, and He answered them, for Heaven released  Lightning that  struck the beasts, then more and more beasts came forth, and they attacked from all sides, and those women spoke curses on brethren and their words came forth as sharp arrows, but the brethren  also kept praying and their words came forth as Swords flashing left and right with fire!  <br> <br>At this point the battle became more and more intense, the saints were growing weary and they cried and called on the Lord Jesus, then it happened; Oh an Indescribable glory, a bright light appeared and illuminated the whole place, and in the Light there was a Cloud, and in the Cloud, There Was the Lord Jesus, He was standing Upon a Rock in the Cloud, the Rock was transparent and full of Fire, and He was dressed with a white Garment, and a Red Sash around his shoulder to his waist, and when he came, he opened his right hand and in his hand there was a wound hole in the middle of his hand, and out of it a drop of blood fell, when it touched the earth, there was earthquake, thunderings and lightnings, and immediately this happened: all the beast, serpents and birds fled, they fled with all their might yet the fire from the holy presence of the Lord devoured them!  <br> <br>And he strengthened the saints for out of the cloud came forth rain, that fell on the saints and they were revived, renewed and refreshed, And I saw how the brethren mounted up with wings as eagles and they walked and were not weary nor faint but soared high !  <br> <br>Then the Lord disappeared, but the cloud remained upon the saints, and as the saints began to rejoice, there appeared host of angels praising with them and a voice said,  /There shall be Victory and Rest On All Sides through the Blood of the Savior for they believe /! <br> <br>And then the Spirit spoke to Me and said:  <br> /Publish this Word, there shall be Victory and Rest on All sides through the Blood of the Lamb unto those that Believe /! <br> <br>I Kevin, the Priest of God, therefore publish this Vision that the saints may know that which is happening in the Realm of the Spirit! <br> <br>All what I have written, I write before the Lord My God, for I Myself was part of the brethren in that vision, so I am a witness to this and I testify that the Blood of the Lord Jesus is Mighty on the behalf of the saints and I urge all the saints to set aside the Fourth Month of the Year ( April)  which is the Season of Passover in the Calendar of Zion to Place a Demand on the blood of Jesus in prayers and fasting that they May obtain victory and rest on all sides !  <br> <br>Great Grace  <br>The Priest of the Most High God!",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 12,
          "title": "The Vision of Transfiguration",
          "headerText": "The Vision of Transfiguration",
          "content": "Vision: I was carried into the visions of God, and I saw a Man of God ( Cameroonian)  ministering on an exalted altar. Behind him sitted on exalted thrones were the spirits of just men made perfect, these were men and women who had walked with the Lord, finished their courses and had slept in the Lord, I recognized many of them amongst which were; Apostle Zach Tanee Fomum of CMFI and Pa Njemo David of the Full Gospel Church Cameroon. And these Elders in the courts of Zion were watching the young man preach and were giving their approval of the message of the saving grace of our Lord Jesus that he was proclaiming.   <br>   <br> My attention was drawn to a mystery; when the man of God who was ministering on the altar began looking above him to the heavens, a light from heaven illuminated his face and it began to shine like he was being transfigured and the light from his face began to shine upon the people who were listening and their faces too began shining.   <br>   <br> Then a strange thing happen, as the young man continued ministering, at one point he began looking down to where the people he was ministering to were, immediately he began looking at them, his face became darkened and suddenly, a dark veil covered the people's faces. When he realized that, he lifted his head and looked above again, then he was transfigured again by the light from heaven and the hall was illuminated again. While he continued ministering, some people in the crowd began praising him and as he turned again and began looking down at the people, his face became dark again, and then he quickly lifted his head to look up again and his face was transfigured again, and the hall was illuminated.   <br>   <br> Then while he was still ministering, some people in the crowd began to criticize him, and then as he turned to look down at them again his face became dark, and the dark veil covered the hall again. At this point the Man of God realized what was happening and he just purposed in his heart to keep his head lifted looking to the heavens while preaching, and no matter what the people he was ministering to say or do, he constrained himself not to give to them his attention, whether they praised him or criticized him, he kept his face looking above and as long as he kept looking above, his face was transfigured and shone like that of the Holy angels of YAHWEH Elohim.   <br>   <br> Also I realized that when the man of God lifted his head to look above, the elders who sat on the thrones in the courts of Zion nodded their heads in approval, but when he looked down to the people they shook their heads in disapproval.   <br>   <br> At this point, I was taken out of the vision, and as I pondered and meditated on this great mystery revealed, and the Holy Spirit brought this scripture to my remembrance:   <br> They looked up to him and were lightened and their faces were not ashamed [Psalm 34:5]   <br>   <br> May the God of all Grace who dwells in the midst of the Cherubim shine forth and enlighten the faces of His servants in Cameroon.   <br>   <br> The Priest of God.   <br>   <br> Prophet Kevin OnLine",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 13,
          "title": "The Vsion About Pornography",
          "headerText": "The Vsion About Pornography",
          "content": "(The Prophetic Cry Against the spirit of Jezebel)   <br>   <br> While in the place of prayer the Lord spoke to me thus ;   <br>   <br> /My Prophet arise and cry out against the Spirit of Jezebel, behold the Evil one has purposed to seduce my People and turn their hearts away from the Father, the Spirit of Lust has been assigned to carry out this great task against the People of God !   <br>   <br> Then I was caught up in the visions of God and the Angel of the Lord said to me;  /PORNOGRAPHY shall be the major weapon of the Spirit of Jezebel against the People of God, Pornography is the key that has been handed to the Spirit of Jezebel to open their heart to the spirit of Lust and make them slaves of uncontrollable and insatiable sexual desires/ !   <br>   <br> Then the Angel of the Lord Said to Me;    <br>   <br> /So many are already enslaved by this Spirit and are helpless, for they no longer have  control over their sexual desires but are slaves to this Evil spirit which will make them often satisfy the Lust of the flesh in fornication, adultery , And masturbation. Therefore arise and weep for their souls, weep for their Souls for their hearts are full of thoughts of sexual perversion...!   <br>   <br> At this Point, like a veil was shifted and I could see some people in their rooms, and I looked and those who were watching pornography and a great mystery was revealed to me;   <br>   <br> I saw that as they were watching some dark cloud came out of the TV screen and filled their rooms and suddenly naked evil spirits looking like beasts started holding unto the people and kissing them and using their private parts and rubbing it to their faces ( for Women watching  it will be an evil spirit with a very large Manhood with the head of a serpent that will be rubbing on her mouth, if it was a Man then it will be evil spirits with vaginas but with the head of a Dog in it rubbing their private part on the mouth of the person) ....   <br>   <br> At this point I was greatly disturbed by this vision and the angel of the Lord showed me again how a liquid came out from the demons private part and they spilled it on the people watching and this gave the People a very bad spiritual scent and everywhere they went these evil spirits followed them and this odour was upon them and this odour attracted other demonic spirits to follow the people I saw demons on affliction, poverty and disappointment come upon these people and oppressed them and whenever they prayed angels could not help them because of the spiritual odour, which prevented angels from coming close!   <br>   <br> And I began crying oh Lord Have Mercy , And  I said, Oh Lord what can we do ?   <br>   <br> The Angel of the Lord replied , /this kind of evil Spirit goes out only by Prayers, Fasting and meditation on the Word of God,  for the roots of these evil spirits have gone deep into their hearts and they have been enslaved by them to fulfill the evil desires of their flesh/!  <br>   <br> Behold at this point I was disturbed  because I could recognize some Christians and even some pastors and I wept bitterly crying for mercy, more so I noticed the Face of the Angel of the Lord was not looking Happy and he turned and said to me , /This is evil strategy through which the heart of the people of God have been turned against the ways of righteousness and their hearts hardened against the voice of the Holy Spirit, and this is what has caused them to withdraw themselves from the secret place of fellowship wherein the Lord Dwells /  <br>   <br> And the Angel of the Lord told me that by watching pornography people enter unconsciously into covenants with Evil  spirits from the kingdom of the waters !   <br>   <br> And I enquired again what should be done;   <br>   <br> And then the Angel of the Lord Answered me thus;  /all those caught up with this must Repent, seek for Mercy and  confess this sin to a  servant of God for the strength of this evil spirit  is secrecy , those who have been entangled must not forget about shame, and they must quickly save their souls by confession and the servants of God shall Pray for them calling upon the power in the Blood of Lamb  so that they may be redeemed from the hand of the wicked one !   <br>   <br> After this, they must continually meditate upon the scriptures and must give their heart to the Gospel which is the revelation of the righteousness of God  that they may discipline their feet to walk  in the High way of Holiness and the Grace of the Lord Jesus shall strengthen them to overcome the desires of the sinful Nature and they shall reign through Godliness/ !   <br>   <br> May the Lord Jesus in His Love wash us from our sins in his own blood and May He grant us grace to walk in the Spirit so that we will not fulfill the Lusts of the flesh !   <br>   <br> Great Grace   <br> The Priest of God<br>cc: Prophet Kevin OnLine",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 14,
          "title": "The vision of the sheep, the Evil Birds, the Wild cows and The Lion hidden in the Lamb!",
          "headerText": "The vision of the sheep, the Evil Birds, the Wild cows and The Lion hidden in the Lamb!",
          "content": "Vision: My spirit was caught up into the visions of God and I saw a great and terrible oracle from the Most High pertaining to the affairs of Men! <br>  <br> I saw a Great field and there were many sheep that found pasture there and fed abundantly. <br>  <br> All of a sudden, I saw that there were wild beasts hiding in caves seeking to devour the sheep but each time they came for the sheep, the sheep will run away from them because  the sheep saw the wild beasts from afar. <br>  <br> Then I saw something else. The beasts of the field made an alliance with the birds of the air and implored them to join them saying that if they join them to defeat the sheep; the birds of the air will feed on the fruits of the garden while the beasts feed on the flesh and blood of the sheep. <br>  <br> After this,  I saw how the birds of the air gathered in thousands and came upon the sheep and began to pluck out their eyes. When they had plucked out their eyes, the sheep were all blind and started running all around the field. The beasts came out from their caves and attacked the sheep and overcame them and the sheep were scattered across the field and because the sheep had become blind they could no longer protect the garden. <br> So the birds of the air came down and fed on all the fruits of the field until it became a wilderness; extremely dry and harsh. <br> I saw Many of the sheep walking and looking for pastures but they could not find and the sheep were very bitter on account of their affliction and their thirst, for there was no pasture neither was there water. <br> The sheep wandered in the wilderness and behold I saw how wild beasts that looked like cows came from the mountains and began to attack, afflict and oppress the sheep. They trampled the sheep underfoot and began to pierce the sheep with their horns. Their horns drank the blood of the sheep. <br> The sheep wept and wept but there was no one to save them from the hands of the wild beasts who mercilessly destroyed them. <br>  <br> As the sheep began to cry, their voice reached to the heavens unto the Ears of the God of All Creation and it was decreed that in the fullness of time a Saviour will be given to them! <br> And I saw how in the Midst of the sheep, a Great White Lamb without spot or Blemish was born. <br> On its head there were seven horns, each of a different colour, texture and substance. <br> This Great Lamb moved with Meekness in the Midst of the sheep to gather them unto itself but the sheep did not heed to its voice. <br>  <br> All of a sudden,  The Wild beasts attacked the Great Lamb, and in the Midst of the Battle the Lamb was slain for it was wounded on its side. <br> Out of the wound, water and blood flowed exceedingly like a river. It gushed out of its wound on the side and I saw that the sight of its blood was like a bright fire. <br> It came to Pass that some of the Wild Beasts gathered to drink the blood of the Lamb but they were destroyed because the blood burnt hot like a consuming fire. <br> When the other wild beasts saw this, they fled at the sight of the blood of the Lamb which pursued them and carried them away like a river and flood of fire! <br> Then I saw that the earth opened its mouth and drank the blood of the Lamb that was slain and when this happened there was a great earthquake. <br> When this earthquake occurred, I saw the strongholds of the wild beasts collapsing for they had made for themselves refuges in the midst of rocks on high mountains from which they came forth to terrify, afflict and oppress the Sheep! <br> All their refuges crumbled and I saw the waters that came out from the side of the Lamb become a fountain of water and it flowed all over the Wilderness and it became a fruitful garden. <br>  <br> The sheep were led to the waters and their eyes were washed in the waters and they began to see and they greatly rejoiced in the garden and were made to lie in the green pastures. <br> I saw that a Great White Cloud came down from heaven from the throne of God and covered the Lamb and then all of a sudden there were thunderings and when the cloud was lifted up I did not see the Lamb again but in its place I saw a Great Lion. <br> The Lion was Made of Fire. It was beautiful and peaceful yet at the same time terrible and Powerful and its eyes were flashes of lightning! <br>  <br> And at this the vision ceased, and I gave thanks to the Almighty God who is the Creator of All things for in His purpose, he ordained the Lamb to redeem his people and in His wisdom he hid the Lion in the Lamb to be the Judge of His People! <br>  <br> Great Grace <br> The Priest of God <br> Prophet Kevin OnLine",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 15,
          "title": "The Vision of the Gathering of the Heavenly Army and the Command of the King of Kings!",
          "headerText": "The Vision of the Gathering of the Heavenly Army and the Command of the King of Kings!",
          "content": "I was caught up in the visions of God, and I saw a great gathering of beings, both earthly and heavenly. In the vision, a trumpet was blown, and its sound was like thunder. The spirits of those who heard the trumpet were caught up into the courts of Zion. I know this because my spirit was among those caught up into the realms of God. By the intelligence of the Spirit, I understood that the sound of the trumpet was the technology through which the spirits of the chosen ones are summoned into the courts of Zion for the assembling of the saints. <br>  <br> Though the summoning happened in the twinkling of an eye, I was privileged by the Holy Spirit to capture some details of the spiritual journey. I saw how the spirits of those summoned left the Earth as rays of light, moving beyond the sun, moon, and stars into the highest heavens, the abode of the great King, Jesus Christ the Righteous One. <br>  <br> At the assembling grounds, I saw countless people, each of them clothed in light. I wondered who these people were, and I heard a voice beside me saying, /These are the hidden ones, the ones who were prepared and kept for such a time as this. These are those who have been redeemed from all tribes, nations, and tongues of the Earth to serve the great King./ <br>  <br> When the voice spoke these words, my attention was drawn again to the heavenly council, as there were sounds of the trumpet signaling that the King was about to address the council. The Lord Jesus Himself, dressed in the majestic garments of a king and warrior, came forth, He wore a white robe, and there was a red sash on it upon his chest with an embroidery made of gold and precious stones, on His Head was a golden crown, His eyes were like flames of fire, and when He spoke, His voice sounded like the roar of a Lion and many rushing waters, gentle yet bold. <br>  <br> The Lord Jesus began addressing the assembly with so much authority and he said; <br> /I am the King of Kings and the Lord of Lords. Heaven and Earth are mine. Go into all the Earth and conquer territories in my name and for my kingdom./ <br> When He said this, He breathed upon the entire assembly, and it was like a dew, a bright cloud covering everyone. While the cloud covered each being, the breath of Christ transformed into a sword in their hands. The swords varied in shape, size, and color, but they were all aflame. <br>  <br> Then the Lord stretched out His hands, and lightning came forth from His fingers, entering directly into each person. Immediately, they were sent back to Earth, falling like rains of light onto every continent. <br>  <br> As these people returned to the Earth realm, the evil beings that had formed clouds of darkness and veils over nations gave way when they saw these lights descending from heaven. The evil clouds that tried to resist or deny entrance to them were burst open, for nothing could stop these lights. <br>  <br> Then I found myself back in the flesh, awakened from the vision, and I gave thanks to God for this wonderful insight into His will for His people ! <br>  <br> The Lord Jesus spoke of so many things concerning the church and the World, Many of these  things  I am not permitted to say them for the authority to say them has not been granted to me for the Lord through the Wisdom of the Spirit has committed that charge to other servants of God who were also brought in as watchers in that assembly ! <br>  <br> In this council the Lord Jesus also addressed the events that will happen in the world, and these occurrences will be for signs and wonders unto the Sons of Men but again I was commanded to seal up those words for they shall be known in their own time! But with the insight i have into the things that will happen, i urge us all to obey the instructions of the Lord Jesus to Watch and Pray! <br>  <br> Dear saints, there is a call in the Spirit. Many of you were present in that heavenly council in the Spirit, even if you may not have retained full awareness. If you have a strong burden in your heart for the Lord Jesus Christ to be known and glorified all over the Earth, then you are part of this army. <br>  <br> The time is now. The Lord Jesus is gathering unto Himself an army of men and women who will forsake the pleasures of the world and go into all the Earth to manifest the power and glory of the Kingdom of Christ. <br>  <br> If you believe you are part of this army of God, then you must consecrate yourself for 120 days unto the Lord, and the Lord Jesus will reveal Himself and His will to you. <br>  <br> Great Grace <br> The Priest of God <br> Prophet Kevin Nubidga <br> Prophet Kevin OnLine",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 16,
          "title": "The Vision of The Cloud of Witnesses!",
          "headerText": "The Vision of The Cloud of Witnesses!",
          "content": "The visions of God came upon me while I laid in my bed and thoughts about heavenly things flooded my mind. A great presence came upon me and I became weak and then I was carried into this Supernatural occurrence whether it was in the body or out of the body i cannot tell but as the Lord Liveth and My Soul Liveth the vision is true and was Extremely Vivid and Real. <br>  <br> I heard a voice from heaven that spoke saying /there are Giants in the Spirit/ the voice said this repeatedly, then suddenly it was like the roof of my room vanished because I could see the sky while laying in my bed, and  I saw a portal opening in the sky and I saw beings riding on heavenly horses of fire. The Horses were white and the men who rode on them were dressed in white with a red cloth on around their shoulders. After them I saw different kinds of heavenly beings, some had wings, some had no wings, the Cherubims too were amongst all of them and were riding on the clouds and coming towards my house.  <br>  <br> As they came and stood above my roof, behold were the saints of old coming in a multitude, surprisingly when I saw any one of them, immediately in my heart I knew the name of the person. They came and entered my room and stood, all around my bed, Moses, Elijah, Samuel, David, Abraham, Deborah, Peter, Paul, John and so on. The Saints whose accounts were recorded in the Old Testament stood on my left side, while those whose accounts were recorded in the New Testament were on my right side.  <br>  <br> Then again I heard a voice but this time it sounded like many waters and thundered saying /These are Giants in the Spirit, you are called to be amongst them why are You Sleeping?/  <br>  <br> When He said that, I was still on the bed paralysed by the sight of the heavenly beings, and all of them turned and looked at me and their eyes were like Rays of Lights piercing my soul, as I looked at them, through their eyes I started seeing all the great deeds they wrought for the Lord in a moment of time.  <br>  <br> It is unexplainable how I look at them and see years of their walk with God just in a moment of time, then tears began to flow down my eyes and suddenly I saw them no more, and I realized I was alone in my room.  <br>  <br> Today I announce the Cry of the Spirit unto You;  <br> /There are Giants in the Spirit and you are called to be amongst them, why are you sleeping/  <br>  <br> The kingdom of God needs you, your generation needs to see God through you , why are you sleeping?  <br> Awake o army of God Awake and the Light of Christ will shine upon you!  <br> Awake to your Prophetic Assignment, Forget about your past, deny yourself the pleasures of the flesh and become part of those who will advance the kingdom of God in this generation by bearing the burdens of God!  <br>  <br> Say this prayer with me;  <br> Oh Holy Spirit, awaken me and enlist me in the Rank of Witnesses unto Christ.",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 17,
          "title": "The Vision about Apostle Johnson Suleman!",
          "headerText": "The Vision about Apostle Johnson Suleman!",
          "content": "I was in the visions of the Lord, other Pastors and I were gathered in a field and we were praying, suddenly we heard thunderings and there was a shaking like an earthquake, and we were caught with fear and much trembling and while we began to ponder on what was happening, I looked and I saw a strange sight; I saw that it was APOSTLE SULEMAN who was coming, but in the vision he was so tall that his head was in the clouds and the earthquakes were caused by his footsteps and the thunder was the sound of his voice when he spoke. When we saw all these, we were caught up with awe and we were all looking at him and then we began to follow him, running behind him, and one of the Pastors said /My Prophet, Pray for me/ then an Angel of the Lord appeared with a flaming sword of fire and pointed at the man and said to him; /Johnson Suleman is not your Prophet, he is the Prophet of the Most High God, and The Lord God of the Holy Prophets has vested his jealousy upon him, call him not your Prophet for he is the Prophet of the Most High God sent to you./ <br>  <br> When that was said, a Cloud of whirlwind made up of lightning came from heaven in a swift speed, and carried Apostle Suleman and I saw as it were, he was being carried across the Nations of the World, and whenever he stepped his feet, there was an earthquake and a shaking that caused the foundations of the nations to be exposed and the foundations that had gone out of course where realigned and I notice something when he stepped his legs on mountains that they were leveled, when he stepped his legs on the crooked places, they were made straight, when he stepped his legs on the rough places, they were made smooth, and while he was speaking hundreds of thousands of people gathered around him, when he spoke there were thunderings, and at the sound of the thundering chains of sin were broken and I realized something - when the thunder sounded, lightening bolts will leave from his body and enter the bodies of the people and immediately, their bodies were /repaired./ I don't know how I can explain this, but somehow distorted, broken, damaged, bones, organs, flesh and blood was restored to health when the lightening entered the people and I saw how when the lightening entered people and demons left their bodies instantly. I saw evil spirits that looked like monkeys,  dogs, serpents forced out of the people's bodies by the lightning and there was great rejoicing among the people and they began giving praises to God and I heard them say /Glory be to God Most High, who has given such power to men./ <br>  <br> At this point, I began to say in my heart, what kind of man is this? <br>  <br> Then the Angel of the Lord turned and said unto me, / Johnson Suleman is a Prince in Zion/ <br> Then I pondered within myself - Prince? <br> Then the angels replied unto me <br>  <br> /who you sons of men call Generals of God, are known as PRINCES in the courts of Zion, in heaven they are not known as Generals but as Princes./ <br>  <br> Then when he said this I was given a strange privilege, I saw a mighty gate opened in the spirit and Apostle Suleman entered through it, I was not permitted to enter but I was granted the grace through the mercies of the Lord to watch what was happening and being said and I saw a council of 120 men sitting on thrones and their discussions were concerning the nations of the earth, and the affairs of men. Distinctively, I saw the man of God Prophet UEBERT ANGEL sitting among them, and all what was decreed in the Great and Holy Council was sealed in scrolls and given to the Holy men who were in charge of executing the written judgements over nations through their Prophecies and I heard it was said to them /You Must Prophesy Again about Many People, Nations, languages and Kings!/ <br>  <br> While I was still in amazement, my spirit was taken out of the vision and I woke up on my bed with much trembling and in Great awe of the Lord God of the Holy Prophets and a sentiment of high esteem and honor to his Servants the Prophets. <br>  <br> Great Grace! <br> The Priest of God",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 18,
          "title": "The Vision of The Violent Storm and the Tower built on the Rock!",
          "headerText": "The Vision of The Violent Storm and the Tower built on the Rock!",
          "content": "On the 5th day of the 7th Month of the Year 2021, I was Carried by the Spirit of God into the Visions of Yahweh Elohim ; <br>  <br> In this Vision I saw how the heavens were black with clouds and violent winds, and everyone who saw this was caught up with fear and trembling, and it came to pass that a Heavy violent Rain began to fall and so many people rushing for refuge, many were confused and were running left and right; then I saw a very Big Building standing on a Rock and the building looked like a tower, many people began to run into the building, while people were rushing into the building, I saw some women that began discouraging other people who were running into the building for refuge, telling them that there are too many people already in those buildings, that there is no more room in the building to accommodate them, and that any time from now, the building will collapse, while she was speaking some people believed her and turned back while others continued running into that building, then I saw that she also had her own building, but what I realised was her building was standing on sand, but some people went into her building, at this point the Rain increased and became very violent and when it beat upon the building that was on the rock, the shaking was strong but this Great House stood firm. <br> As the flood continued moving everything else on its way was destroyed, and I saw how some people had themselves under trees, yet the violent flood uprooted the trees, then the Flood reached to the level where the other house that was standing on the sand was, as it beat the house the house was totally destroyed at the twinkling of an eye, and all those who were in it, were carried along by the flood! <br>  <br> At this point, I saw that everything had been carried away, only those in the House that was on the rock survived and I saw them praising God, and the clouds became bright and there was a great light! <br>  <br> At this Level the vision ended, and I was disturbed with the vision so I began praying against the Storm, then the word of the Lord Came to Me thus; <br> /Prophet of the Most High, do not weary yourself in Praying against that storm, there is nothing You or the Sons of Men can do to avert that storm for it is by the decree of the Sovereign Lord! <br> O the Lion has roared who will not fear ?  the Lord Has Spoken who will not hear ? The storm is coming, so therefore Prepare Yourself less Your Faith Fail, and you faint in the Days of adversity/. <br>  <br> >>At this point it was revealed to me, that that house on the rock is the Church of the Living God. <br>  <br>  <br>  <br> >> The woman is the spirit of Jezebel and her house is a false religious system, Babylon! <br>  <br> >>The spirit of Jezebel will try to distract many from seeking refuge in the Church. <br>  <br> >>The storm is significant of judgments of wars, plagues, famines that will come upon the earth! <br>  <br> >>The Church of the Living God shall be the only city of refuge from these evil occurrences! <br>  <br> 1-The Holy Spirit is calling on Christians to depart from the path of unrighteousness, depart from unholiness, depart from worldliness, return to the Lord with heartfelt prayers of repentance, commit your heart to the Lord through fellowship with the Spirit and Meditation on the scriptures! <br>  <br> 2-The Holy Spirit is calling on Ministers of the Gospel, to focus on Soul winning, to Preach the Gospel of the Kingdom with boldness and He will confirm the words with signs, wonders, and Miracles for the Salvation of Souls! <br>  <br> 3-For those who are not yet in Christ, the Holy Spirit Says as You Hear the Voice of God, Harden not your hearts, its time to seek refuge in the Church of the Living God for nothing in this world can save you from the storm coming! <br>  <br> The Priest of God. <br> Great Grace!",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 19,
          "title": "The Vision of The Lord Jesus And His Message To The World!",
          "headerText": "The Vision of The Lord Jesus And His Message To The World!",
          "conten": "Today, at the airport in Lagos Nigeria, I felt the spirit of revelation come upon me heavily, so I looked for a quiet corner and yielded myself and fell into a deep sleep and my spirit was carried into the visions of God. <br>  <br>In this vision, I saw very huge chariot or train that was ascending up a hill on which was found a very beautiful city which is made of Gold and the gates of all precious jewels. In the chariot, there was a very beatiful woman, dressed in a long white gown made of golden embroidery. On her head was a crown, she was so gentle and quiet but very elegant and beautiful. Then I realized that there were some men around her whose assignment was to serve her and to provide what she needed for the journey. <br><br> As the chariot continued on its ascending journey, at a certain place there was a woman on the wayside but in the valley, she was also very beautiful, but she was dressed in a black transparent  gown through which her nakedness could be seen,  she was very seductive in appearance and had painted her face. Around her where many men who indulged in all manner pleasures of the flesh, in fornication and drunkenness and these men worshipped her body as an idol and when they did  she undressed herself and satisfied every one of their cravings of their flesh. <br><br> When the men in the chariot saw this happening, I saw how some began to complain and murmur and I clearly heard one say /see these men are out there enjoying with that woman, while we are here enduring with this woman./ <br><br>Then I saw how some of the men jumped out of the chariot and went and met the woman by the wayside and she willingly received them and satisfied all their lusts of the flesh, these men began fornication with her, and they became intoxicated with her wine and began worshipping her body, while those in the chariot continued the Journey with the woman. <br> <br> When they got to another place, some of those men who went to the woman at the wayside came back into the chariot, and when they came they began to influence the other men in the chariot saying that they don't have to only endure with this woman, they can also enjoy with her. <br> <br> Then something strange happened -  those men who hath known the woman at the wayside began trying to dress up the woman in the chariot to look like the woman on the wayside. They forcefully painted her face, and began teaching her the ways of the woman at the wayside so she may look, talk and act like the woman on the way side, and the more they did that, the more she was sorrowful.  They were asking her that why are they here enduring with her, while others are enjoying with the woman on the wayside. Then I saw some of those men bodily coming to the woman in the chariot to indulge in fornication with her but she refused and when they tried to force her, she screamed with a shout that pierced the heavens and resounded in all the heavens and the earth, and after she screamed, a voice like thunder spoke from the heavens with great authority, and this what I heard the voice say; <br> <br> /who are they that want to defile my bride? Know you not that the bride of Christ ought to be presented to her groom as a chaste virgin without stain or blemish? <br> You were ordained friends of the bride groom that you may wait upon the bride till the groom comes for the Great Marriage Supper of the Lamb, but you have allowed your heart to be seduced and corrupted by the woman Babylon, and now you want to defile the bride of the Glorious King. <br> Behold, because you have done this you have arisen the jealousy of the Great King, and you have awaken the wrath of the consuming fire, and all they that want to defile His bride shall be utterly consumed/<br> When this voice spoke, judgment began in the chariot. A fiery wind blew across the chariot and (oh Lord have mercy,) I saw how some were cast out of the chariot into the valley,  some were brought low, some were stripped of their rod of authority and yet others were exalted, others were brought in and others were given great authority. <br> At this point, I came out from the vision with trembling and fear saying; /Lord Jesus show us mercy and grant us grace to walk before you perfectly / <br> <br> The Priest of God.",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 111,
          "title": "The Vision Of The Palm Branches",
          "headerText": "The Vision Of The Palm Branches",
          "content": "I was caught up in the visions of God where we were gathered in the assembly of the saints and the Holy Spirit manifested Himself and prompted us to worship the Lord Jesus, and as the whole congregation were worshipping, the awe of the presence of God brought me to my knees in reverence to the LORD JESUS, and the spirit of Holiness granted me utterance and I began to glorify and magnify the Lord Jesus with the  confessions of my mouth, and I was filled with the awareness of the Majesty and Dominion of the Lord Jesus and I began to sing this song; <br><br> /When we all get to heaven / <br> what a Day of rejoicing that will be / <br> when we all see Jesus / <br> we will sing and shout Victory / <br><br> And while I was singing this, I saw a thick white Cloud come upon me and suddenly my spirit was caught up into the realms of God and I saw myself instantly kneeling before the Lord Jesus, the Only Potentate, the King of kings and Lord of lords - <br> His throne was made of Gold, and transparent glass and He sat exalted upon the throne, I mean highly exalted and His throne was surrounded with a cloud that had a rainbow, and therein were flashes of lightning and out of which proceeded voices that sounded like thunder saying, /Holy, Holy, Holy is the Lord God Almighty, Glory, Glory, Glory be unto He who sits on the throne, for His dominion endures forever more/. <br><br> Then I was filled with Holy Fear, and my head was bowed down, and as I lifted my head to behold He that dwells in inapproachable light, I could not see his face, for it was full of a burning and shining light, and then He spoke to me, His voice sounded like many waters but was so gentle and refreshing to the heart, the Lord Jesus said these words; <br><br> /Verily I say unto you, all of those who have confessed my name and have not been ashamed of my Gospel, will surely be carried to heaven when their days are fulfilled and they shall be where I am for I have prepared a place for them in the bosom of Abba Father,  but the issue is, what shall they bring when it is time to come and meet me? <br><br> Shall you come before your Master empty handed?/ <br><br> Then I turned and looked and I saw many beings in white garments and some had palm branches in their hands and some their hands were empty, some had many palm branches and some had just few. <br><br> And all these came before the throne of the Great King and cast their palm branches down before the Lord one after another, and the Lord received it from their hands and gave them crowns, each crown was different in size and beauty, some crowns had more stars on them than others and some had more precious stones than others but it appeared to be that it is your palm branches that will determine the kind of crown you will receive. <br><br> And while I was wondering what this could be in my heart, it is like a being heard my thoughts, and He walked up to me and said to me, this is the meaning of this mystery:  <br><br> /If you do good works and win souls into the Kingdom of God, when you come to meet the Lord, all your good works for the advancement of his glorious kingdom will be in your hands in the Heavenly realms as palm branches, and the crowns given to them is their reward which they will receive from the Lord their God for their sacrifices for his kingdom/ <br><br> And the Holy Spirit brought this scripture to my remembrance which I have been reading but never understood;  <br><br> Revelation 7:9 KJV <br> /After this I beheld, and, lo, a great multitude, which no man could number, of all nations, and kindreds, and people, and tongues, stood before the throne, and before the Lamb, clothed with white robes, and palms in their hands;/ <br><br> And I began saying to myself I must do good works and win souls for the advancement of the Kingdom of Jesus Christ, then suddenly my spirit was back in my body in church and I was in utter amazement because on earth it was not up to 30 minutes but while in the heavenly realm, it was like 7 hours because I saw and heard  so many things which I've not been permitted nor given the utterance to tell the sons of men. <br><br> But the Lord Jesus has Graciously sent me to bring this message to the church today; <br> /Shall you meet your maker empty handed? <br> What are your good works? <br> Where are the souls you have converted from the World to the Lord?/ <br> <br> If you are born again, then going to heaven is a sure truth because salvation is by faith in Christ and not by works but your reward in heaven will be by your works which are an expression of your faith in Christ. <br><br> What will you bring to the Lord Jesus, who gave Himself for you and washed you from your sins and through whose blood you are reconciled to the Righteous Father? <br><br> As a saint, do not just be excited about being carried to heaven when your days are fulfilled, even much more be excited at the palm branches you will present to your master Jesus Christ. <br><br> Oh Dear Saint, <br> Shall you meet your Master Empty Handed? <br> Have you not read this scripture: <br> Deuteronomy 16:16 KJV <br> Three times in a year shall all appear before the Lord thy God in the place which he shall choose; in the feast of unleavened bread, and in the feast of weeks, and in the feast of tabernacles: /and they shall not appear before the Lord empty/. <br><br> May the God of All Grace grant us grace and wisdom to be and do what is ordained for us that will advance the Glorious kingdom of Christ in the Name of Jesus <br><br> Great grace <br> The Priest of God <br>",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 112,
          "title": "The Vision of The Violent Storm and the Tower built on the Rock! ",
          "headerText": "The Vision of The Violent Storm and the Tower built on the Rock! ",
          "content": "On the 5th day of the 7th Month of the Year 2021, I was Carried by the Spirit of God into the Visions of Yahweh Elohim; <br> <br>In this Vision I saw how the heavens were black with clouds and violent winds, and everyone who saw this was caught up with fear and trembling, and it came to pass that a Heavy violent Rain began to fall and so many people rushing for refuge, many were confused and were running left and right; then I saw a very Big Building standing on a Rock and the building looked like a tower, many people began to run into the building, while people were rushing into the building, I saw some women that began discouraging other people who were running into the building for refuge, telling them that there are too many people already in those buildings, that there is no more room in the building to accommodate them, and that any time from now, the building will collapse, while she was speaking some people believed her and turned back while others continued running into that building, then I saw that she also had her own building, but what I realised was her building was standing on sand, but some people went into her building, at this point the Rain increased and became very violent and when it beat upon the building that was on the rock, the shaking was strong but this Great House stood firm. As the flood continued moving everything else on its way was destroyed, and I saw how some people had themselves under trees, yet the violent flood uprooted the trees, then the Flood reached to the level where the other house that was standing on the sand was, as it beat the house the house was totally destroyed at the twinkling of an eye, and all those who were in it, were carried along by the flood! <br> At this point, I saw that everything had been carried away, only those in the House that was on the rock survived and I saw them praising God, and the clouds became bright and there was a great light! <br> <br> At this Level the vision ended, and I was disturbed with the vision so I began praying against the Storm, then the word of the Lord Came to Me thus; <br>/Prophet of the Most High, do not weary yourself in Praying against that storm, there is nothing You or the Sons of Men can do to avert that storm for it is by the decree of the Sovereign Lord! <br>  <br> O the Lion has roared who will not fear ?  the Lord Has Spoken who will not hear ? The storm is coming, so therefore Prepare Yourself less Your Faith Fail, and you faint in the Days of adversity/. <br>  <br> >>At this point it was revealed to me, that that house on the rock is the Church of the Living God. <br> >> The woman is the spirit of Jezebel and her house is a false religious system, Babylon! <br> >>The spirit of Jezebel will try to distract many from seeking refuge in the Church. <br> >>The storm is significant of judgments of wars, plagues, famines that will come upon the earth! <br>>>The Church of the Living God shall be the only city of refuge from these evil occurrences! <br> <br>    1-The Holy Spirit is calling on Christians to depart from the path of unrighteousness, depart from unholiness, depart from worldliness, return to the Lord with heartfelt prayers of repentance, commit your heart to the Lord through fellowship with the Spirit and Meditation on the scriptures! <br>  2-The Holy Spirit is calling on Ministers of the Gospel, to focus on Soul winning, to Preach the Gospel of the Kingdom with boldness and He will confirm the words with signs, wonders, and Miracles for the Salvation of Souls! <br>  3-For those who are not yet in Christ, the Holy Spirit Says as You Hear the Voice of God, Harden not your hearts, it’s time to seek refuge in the Church of the Living God for nothing in this world can save you from the storm coming! <br> The Priest of God. <br>  Great Grace!",
          "picture": "image1.jpg",
          "date": "2021-07-05"
        },
        {
          "id": 113,
          "title": "The Vision of the Heavenly Market!",
          "headerText": "The Vision of the Heavenly Market!",
          "content": "After I saw the vision of the Lord Jesus coming as the Rewarder to the saints and was meditating upon it, the heavens were opened again unto me and I saw two more visions, <br>  <br>I saw a vision where, the Hand of God carried me into a glorious city and it was a very beautiful city with extremely awesome buildings, built with precious stones like gold and diamond, and the hand of the Lord set me in a place that looked like a market, and I saw fruits but the sizes were abnormally huge, an Apple was the size of a watermelon and the fruits were so fresh and sweet savour came from them. While I was admiring the fruits, I saw thousands of men and women also looking at the fruits in amazement of how huge and fresh they are, then I heard a voice that said; <br> <br>/stretch your hand, take and freely eat of the fruits you desire for they have all been paid for/  <br>  <br> Then at this, the vision ended, and while I was pondering on this vision to have understanding, the Holy Spirit said to me  <br> /Now is the time of Favor, all they that have obtained mercy from the Father through the Blood of the Lamb, shall be Highly Favored in all their ways, and they shall be satisfied with the goodness of the Father/ <br> Then Holy Spirit brought this scripture to my remembrance; <br>  <br> Isaiah 55:1-3 KJV  <br> Ho, every one that thirsteth, come ye to the waters, and he that hath no money; come ye, buy, and eat; yea, come, buy wine and milk without money and without price. <br>Wherefore do ye spend money for that which is not bread? and your labour for that which satisfieth not? hearken diligently unto me, and eat ye that which is good, and let your soul delight itself in fatness. <br>Incline your ear, and come unto me: hear, and your soul shall live; and I will make an everlasting covenant with you, even the sure mercies of David. <br> <br>Great Grace  <br>  The Priest of God  <br>  <br> I pray for You, May the Lord God satisfy you with Favor and may you be satisfied with the goodness of the rivers of His pleasures... Amen!",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 114,
          "title": "The Vision about the Demonic Agenda to corrupt the Worship Ministry!",
          "headerText": "The Vision about the Demonic Agenda to corrupt the Worship Ministry!",
          "content": "While I was waiting on the Lord, to know his mind for this time and season, His Word came to me thus; <br> <br> /This is the season where the Spirit of grace and supplication will be poured upon the saints to  summon men and women into the secret place, to minister unto the Lord and bear the burdens of God through their priesthood for the advancement of His Purpose on earth./ <br> <br>When the Lord spoke to me, He opened my eyes and I saw indescribable beings in the clouds and an angel of the Lord revealed to me that those beings were Cherubims and Seraphims, the Angel said to me that the Lord is releasing them as ministering spirits to the earth realm to usher the saints into a realm of fellowship with the Holy Father. <br> The Angel said that the Cherubims are assigned to communicate the Glory of God into the atmosphere while the Seraphim are assigned to communicate the Holiness of God into the atmosphere and this atmosphere will influence the saints to walk in the consciousness of the Holy Father. <br> <br>While he was talking to me, I was carried to an assembly of Christians in worship, while they were worshipping God, their words were transformed into a thick white smoke going up to heaven and afterwards it returned on them as rain, each drop containing light, which when it came back upon the people, it revived, renewed and refreshed them. <br> <br>Then as we watched, I was carried again to another assembly of people worshipping God but I saw something strange, theirs was a thick dark smoke, it did not ascend to God, rather it surrounded them and out of the smoke emanated a very bad odor like that of dead flies and the odor came upon the people and remained on them. <br> When I saw this, I asked the Angel what was wrong; <br> And the Angel said come and see, immediately I was in another vision of God, in this vision I saw demons and evil spirits that had very bad odour, speaking in a strange tongue and each time they spoke the tongues, they multiplied themselves after a while, wind carry them into the atmosphere, and their targets were Pastors and Gospel Ministers especially girls. <br> They specifically tagetted girls gifted in singing and choir members, when this was done, these girls began speaking in that same tongue, but unfortunately most of them where not aware.    Now whenever the girls began leading worship and spoke in those tongues the thick dark cloud will cover the assembly and out of the thick dark clouds will proceed that bad odor. <br> <br>And the Angel said to me; <br> The Evil One in his subtle wisdom and crafty ways has released an Evil Spirit to corrupt the Spiritual Atmosphere of the Saints by Influencing them to speak in tongues inspired by the flesh and familiar spirits, so instead of praying to God, they are enchanting demons, cursing themselves and committing their bodies to the hands of Evil Spirits. <br>  <br> Then the Angel showed me further, I saw a Woman very beautiful with very long hair, longer than her and with very bright eyes, and the Angel said that is the Spirit of Delilah and she has been granted an assignment by the Evil One against servants of God, to seduce them and cause them to transgress the commandments of the Most High God by sexual sins. <br> <br>The spirit was assigned to female Gospel musicians and I saw in the visions when they start singing and speaking in tongues, they were casting spells of lust on the People present and they will seduce and entice the servants of God into sexual immorality with them. <br> <br>I saw again that this demon had beings around her, worshipping her yet they were Gospel singers and these ones unlike the others were conscious that they are possessed with those evil spirits and where on assignment to pollute the sanctuary of God with sexual immorality. I saw these female so called Gospel artists leading other younger girls into having sexual intercourse with them, introducing them into homosexuality, all this in church. <br>  <br> At this Point I was very disturbed and the vision ended, I kept praying asking the Lord what should be done; <br> And the Holy Spirit said that all music ministers in church must consecrate themselves - spirit, soul and body to walk in righteousness and Holiness, because the responsibility to provoke and sustain the manifestation of God in this time and season is upon them, that's why the devil is coming after them, but the devil will not be able to operate through those who walk in the Light of Life. <br> <br> And the Holy Spirit brought these scriptures to My remembrance; <br> <br>John 4:23 KJV <br>But the hour cometh, and now is, when the true worshippers shall worship the Father in spirit and in truth: for the Father seeketh such to worship him. <br>  <br> Romans 12:1 KJV <br>I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable worship. <br> <br>I counsel the Female Gospel Musicians to AVOID serving God according to the standards of the World, they must serve and follow God by the standard of the Word, because they are called to give pleasure to the Lord God through their worship and praise but their worship is Only acceptable to the Righteous One when they offer their body as living sacrifice to God. <br> <br> Dear daughters of zion arise and lead the church to the place of intimacy with God through the Spirit of God, refuse to be Vessels in the hands of Satan to cause the downfall of His servants, for you are ordained to be Vessels of honor in the hands of God to draw men and women closer to God. <br>  <br> Great grace; <br>The Priest of God.",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 117,
          "title": "The Vision of The Lord Jesus And The Reward Of The Saints!",
          "headerText": "The Vision of The Lord Jesus And The Reward Of The Saints!",
          "content": "On the 23/04/ 2023 which was a Sunday Morning, I was in the place of prayer from 12 am to around 5 am, as My custom is to make intercession for the Church, the saints and Pastors that the Lord will Show Himself Mighty in our services by Many infallible proofs, and while I was praying, I saw 3 Visions, which are for the comfort, strengthening and encouragement of the Saints. <br> <br> This is the First vision I saw,  In this vision, I saw thousands of Saints upon a Great and High Mountain, which in the Spirit is called Mount Zion. This mountain had seven layers and I saw in one of the layers, thousands upon thousands of Saints working on the mountain, some were praying, some were teaching, while others were supplying the needs of those who were praying and teaching, and I saw that there were beings that moved in the midst of the saints with Scrolls and ink horns and were writing down in full details everything that were done by the saints. I saw that for those who prayed, all the hours to the minutes, they prayed were recorded and for those who taught, all what they taught was recorded. <br> <br>I saw these Angels acend to another layer still on Mount Zion and on that Layer I saw the Spirits of Just Men Made Perfect, they were in  councils and their discussions pertaining the Purpose of the Most High God in all the Worlds. <br> <br> An Angel went into another layer and this time, he entered into a place where there were books, millions of books and there he kept the records of what he had written down. <br> <br> While I was watching the vision, I heard a trumpet sound and all the beings both in the layer of the saints who were still on earth and those who are the layer of spirit of just men made perfect, everyone lay flat in worship and adoration to the Great King and Lord of Spirits - Jesus the Christ and I saw the Lord Jesus descended to the Layer of the saints who were still on earth but in service to him, and when He came before anyone of them, a scroll will appear in his hands, and He will read the things which were written in the scroll of the person and pronounce blessings upon the person, he did this for everyone one by one, and only the person who was being blessed could understand the words of his blessings but to others it sounded like tongues. <br> <br> At this point, the vision ended and when I got up, the time was 6:30 am and while I was meditating on the vision to seek understanding, the Holy Spirit said to me... <br>  <br> /The Lord Jesus takes account to the details of all what is done for the glory of His name and the advancement of His Kingdom, the services and sacrifices done for the sake of Christ are not in Vain for He Himself is the Great Reward and Rewarder of the labour of Love of the saints, thus Let he who teaches, Keep teaching, let he who prays keep praying, let he who gives keep giving, let he who serves, keep Serving for the time of Rewards is at hand, but in all you do in words and in works let it be done in the Name of the Lord Jesus and for His Glory / <br> <br>Then also I had an understanding by the inspiration of the Holy Spirit; <br> Only through ministering to the Lord in worship and praise can we receive the reward of our labour of Love in ministering unto the saints. <br> <br> And while I was writing this vision, the Holy Spirit brought this scripture to My Remembrance; <br> <br> Isaiah 62:11 KJV <br> Behold, the Lord hath proclaimed unto the end of the world, Say ye to the daughter of Zion, Behold, thy salvation cometh; behold, his reward is with him, and his work before him. <br>  <br> Dear Saints be not discouraged on because you have not yet see a reward for your service and sacrifice for the Kingdom of Christ, for Many Christians it has gotten to a point where you are doubting if truly You are serving the Most High God, it has come to the Point that your Life has become a mockery to people on account of your service but be encouraged Dear Servants of God, if what you are doing is by the revelation of the Spirit and agrees with the Scripture then you are Serving God. Be encouraged by this Oracle and keep on doing the work God has entrusted in your hands for this is good in the sight of the Lord and in due time, he shall Reward You! <br> <br> I pray for You, May the Grace of God strengthen your feet to walk with Jesus and empower your hands to work for Jesus, and  May the Father and God of Our Lord Jesus, who is the Faithful Covenant Keeping God, Remember your labour of Love and give you a blessing that will make you the praise of your family. <br> <br> Great grace  <br> The Priest of God",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 118,
          "title": "The Visions of God From 2024 (Part 1 - Visions concerning the Body of Christ)!",
          "headerText": "The Visions of God From 2024 (Part 1 - Visions concerning the Body of Christ)!",
          "content": "I was caught up in the Realm of the Spirit on a High Mountain wherein I saw what looked like Plasma Television screens but in the form of a Cloud, thousands of them and in each of them visions were shown! These visions were concerning People, Nations, Languages and Kings. <br> <br> These are some of the Visions I saw on the Cloud-Screen concerning the Body of Christ <br> <br> 1. The Lord has decreed this Year to the Body of Christ as the Year of Preparation and Quickening, The Saints are to be prepared through the Ministry of the Word and are to be quickened through the Ministry of Prayer to know and Do The Will of God and fulfill His Purpose, There must be a consecration of the flesh in order to be aligned to the desires of the Spirit. In the Visions of God, I saw a Great war in The Spirit and I saw a red dragon from whose mouth came forth water, and each time it opened its mouth the water came forth to carry away the saints of God, and the Spirit of the Lord revealed to me that the water from the Mouth of the dragon is the Spirit of Deception, and Many of those who have not been rooted in Christ through the knowledge of the doctrine of Christ shall give heed to seducing spirits and shall begin to obey the doctrine of the devil and this shall cause them to shipwreck their faith. <br>  <br> 2. In the Visions of God, the Lord appeared to me and his Angel gave me a message thus /You are degrading Jesus when You walk in unbelief, ingratitude, and unrighteousness/! The Father is calling the Church to Magnify the Lord Jesus by walking by faith, working righteousness, and continually giving thanks to Him for this Is His Perfect will for the Church of Christ. <br>  <br> 3. In the Visions of God, I heard this /Jesus is coming very soon but the number of women prepared for his coming are very very few/. The Lord is revealing that emphasis be placed on Ministering to women. It was also revealed to me that the attention of Spirits has been shifted to women because they will be instruments to cause the rising or downfall of Many People, nations, and Kings, in this regard the Lord commands that Prayers be made for all women, conferences be organized to teach women to know the Will of God and to do it. <br>  <br> 4. The enemy has released the Spirit of Corruption and perversion specifically to infiltrate the children's departments of churches. In the Visions of God, I saw strange children from the water who were assigned to children's departments in churches and they were filled with Satanic and sensual wisdom to lure children into despicable Immorality, stubbornness, lying and stealing. Thus every church must pay more attention to the children's department, henceforth, carry them along in all Spiritual activities even preaching, and let those who will pastor those departments be carefully chosen through the Wisdom of the Spirit. <br> <br> 5. The Lord said that this Year, He will make a difference between those who serve him and those who do not, they who serve God shall spend the days of this year in the pleasures of God and they shall prosper in all things this Year. <br>  <br> 6. In the Visions of God, I saw a thick dark cloud, and I heard thunder rumblings from within it then all of a sudden, I saw millions of lightning bolts break forth and were scattered in all directions. This year shall be the Year of the emergence of the hidden ones, the Men and Women who have been mentored by the Holy Spirit in the secret Place, their light shall break forth speedily, and all those who have been waiting upon the Lord for years, this year shall be their year of showing forth. <br>  <br> 7. In the Visions of God, I saw the Heavens opened and I saw a Mighty outpouring of Showers from on High, and The decree of the Lord unto the rain was thus; Refresh the Weary, Revive the Faint and Renew the face of My Church,/ this year, the Lord Will visit all those who have been waiting upon him and shall grant their requests according to His will, I can authoritatively say that this year many stubborn problems will be solved through the intervention of the Great God. <br>  <br> 8. The Lord Said to me /Herod has demanded the Head of John, James and Peter./ When I heard this, I saw in the visions of God that the Devil is stirring the hearts of men and women in government so that they may stretch their hands and afflict the sheep of God by cutting off the shepherds. Governments will sign decrees against the Church and some of the decrees will be aimed at controlling the wealth and activities of some major Pastors and I saw that many will receive this news with gladness and even some Christians but unknown to them this is all a strategy to cut off the heads of churches, they will seek to imprison or even kill many and I even saw how in a certain Church the government forcefully removed the General Overseer and founder of a Ministry and installed someone else. In this vision, I understood that the governments took advantage of the disputes in churches brought to Courts, so I strongly counsel by the grace of God given to me, let Christians refrain from taking the issues that concern the church of God to the courts of men, even as scriptures have instructed, let the matters of the Church be judged by the Elders of the Body of Christ in that region or nation (1 Corinthians 6:1-10). Nevertheless, the Lord Instructs His servants to be faithful to him even unto the death and also the Lord commands Christians to pray for the Pastors daily that they may be delivered from wicked and unreasonable Men. <br>  <br> 9. I saw a Great Light Shining Upon a House, that Light was so bright that it made everything transparent, for it pierced through everything as A sword. And Then I heard the Voice of the Holy One say / The Light will shine and even now is already shining, the intents and works of Many shall be exposed, and he that walks in truth shall not fear for when he comes into the Light his works shall be made manifest that they were wrought through the Spirit and it shall be known that he is a worker of righteousness, but he that is evil shall be ashamed for when he comes into the Light his works shall be made manifest that they are of the flesh and it shall be known that he is a worker of iniquity/. I saw Great lamenting in some Ministries on account of secret things being made public and I heard the decree / consider Your ways, examine Yourself whether you are in the Faith, for He that Judges himself shall not be judged/  <br>  <br> 10. This Year shall be a year of restoration for many who hath backslidden. In the Visions of God, I saw the hand of a Potter making vessels fit for His Use, and though some were marred, he broke them and made them again as it seemed good to use. Now something I realize even the vessels whom I thought had become useless after the Touch of the Potter became useful again. This year the Lord has stretched his hand to those who had fallen and He desires to restore them to profitable service for the kingdom but this will only be when they submit themselves to the Dealings of God through which they will be broken and re-designed in the image of Christ. <br>  <br> 11. The Devil will change the weapons employed to fight the Faith, the battle shall no longer be on terms of Magic but on terms of Logic, and due to great breakthroughs in technology and in Medical Science, the Devil will seek to turn Many away from the Faith with strong arguments based on Logic and Worldly philosophies. <br>  <br> 12. In the Visions of God I saw the release of the cherubim and the seraphim into the congregation of the righteous, the seraphim were charged to communicate the Holiness of God into the atmosphere, while cherubim were charged to communicate the glory of God into the atmosphere. How be it this is a Mystery for I’m speaking about Men, yes Even women, these are those whom the Lord had prepared for such a time as this, a sacred remnant who have not bowed down Babylon and whose mouths has not eaten her delicacies, they are being sent to preserve the heritage of God in this last days by upholding the standards of Holiness in the midst of corruption and reveal the Glory of God in the Midts of depravity. <br> <br> Great Grace  <br> The Priest of God",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 119,
          "title": "The Visions of God From 2024 (Part 2 - Visions About The World)!",
          "headerText": "The Visions of God From 2024 (Part 2 - Visions About The World)!",
          "content": "I was caught up in the Realm of the Spirit on High Mountain wherein I saw what looked like Plasma Television screens, thousands of them and in each of them visions were being shown ! These visions were concerning People, Nations, Languages and Kings. <br>  <br>  These are some of the visions I saw about the World <br>  <br> 1. The Lord Said to me that 2024 is the Year of the Beginning of Sorrows, for the great woman has entered into her travail and she shall weep and Lament because of her labor pains/ <br> <br> 2. In the visions of God I saw a beast go through Many nations and wherever it went the place was left in fire and blood ( I will give the Prophecies mentioning the nations in which I saw this happen for now I will give myself to intercession to see if it can be averted but if not, then I will say them as a testimony to the Nations that The sovereign Lord knows all the ways of Men and he rewards them according to their works) <br> <br> 3. In the Visions of God I saw a Flying Sword, and this Sword was released against the Kings, and Men of influence, those whom on account of Power and fame have become Proud. There will be strange plagues that will befall the Mighty and the rich which will torment them severely and this will cause Many of them to humble themselves and seek the Face of the Lord because they will be unable to find help through their Money and thus will turn to the Lord for Help and He in His Mercy will Help them and they shall become instruments of righteousness in the hands of the Lord. <br>  <br>  4. This year shall mark the beginning of the dethrone of one of the ‘gods’ of this World known as Mammon. I Saw in the Visions of God a highly exalted Being dressed in the most expensive clothes and laced with all kinds of jewelry, I saw an earthquake and his throne broke into Two and He fell Into the dunghill, This Year Money Shall begin to fail, and also nations will begin moving from physical money to virtual Money to exert more control on the wealth of People and the nations will take Money from the wealthy of nations to invest in Purchasing weapons of war. <br> <br> 5. In the Visions of God I saw people walking on the road and a wind came from the wilderness and began to slay them and the people began to suddenly fall and die. I saw that there will be 3 extremely deadly plagues that will hit the world this year, One will cause incurable boils on the flesh, one will be a virus that destroys internal organs the deadliest shall be one that will be like a fever (More details on where and when this will start will be given on later after intercessions). <br> <br> 6. In the visions of God, I saw Great shakings, especially in Europe and Asia and I saw the earth open her mouth and after that, I saw entire cities swallowed. There will be terrible earthquakes that are ordained to swallow humans and properties! I know that earthquakes a regular occurrences in these areas but in the visions of God I saw that these earthquakes were much more higher in magnitude and caused more damage than has ever happened before. <br> <br> 7. I saw a Mighty Angel Descend from heaven and took a Key that was hidden in the moon and he came and opened the gates of Muslim-inclined Nations, and I saw a great multitude of Muslims turning unto the Lord from the Nations of the World, I saw one whose is a very great and respected Muslim cleric turned to the Lord by an encounter with the Angel of the Lord and His conversion will shake the Muslim world and will cause them to adopt to stricter measures against conversation to Christianity but yet the more they shall afflict them, the More Christians shall Multiply. <br> <br> 8. In the visions of God, I saw the cryptocurrency business do extremely well but after a while, some Cryptocurrencies crashed terribly. So, for those in cryptocurrency spaces, pray and seek guidance from the Spirit of God on which one to invest in, and when you begin to make profits withdraw your profits and invest in Real Estate. This is because the Great Profits that will be made through Cryptocurrency are well-crafted strategies to lure men to invest their all and then when it crashes they shall become indebted and then made to enter into certain dark covenants through which they will be given access to make great wealth through cryptocurrency at the exchange of their souls. <br> <br> 9. Beginning this Year, There shall be confusion amongst Formerly friendly nations and there shall be betrayals amongst them. In the Visions of God I saw World leaders gathered in a meeting but a smoke infiltrated the meeting and they could not agree any more, that Smoke was the Spirit of Discord, they became incensed with one another and threatened one another and even cut diplomat ties and all these shall be the opening phase of the seasons of wars! <br> <br> 10. I Saw a great breakthrough in the Medical Science and Technological world, In the Visions of God I saw most incurable diseases like cancers and HIV become treatable easily like Malaria and Typhoid. In the Visions or God I saw / Beings from another world/ come into India and impart them with Celestial Wisdom, through that Wisdom Indians will pioneer strange discoveries and inventions in Medical Science, technology and Artificial intelligence. <br> <br> Great Grace   <br>The Priest of God",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        }
      ],
      "questions": [
        {
          "id": 21,
          "title": "Question: Good Day sir, please I want to enquire on the subject of Spiritual Fatherhood! Who is a Spiritual Father and is it compulsory to have one before you succeed as a Pastor?",
          "headerText": "Who is a Spiritual Father and is it compulsory to have one before you succeed as a Pastor?",
          "content": "Answer: I will answer this question with two separate posts so that it won't be too long, in this first post I will address who is a Spiritual Father and in the second post I will address if it's compulsory to have a Spiritual Father to succeed as a Pastor! <br><br> Now, to address the issue of Spiritual fatherhood, I want to first say that the term Spiritual Father is a term used to describe a Father in the Lord but by accurate scriptural disposition, God is the ONLY Spiritual Father, because the term Spiritual Father means Father of Spirit and the scripture clearly says this; <br><br> Hebrews 12:9 KJV<br>/Furthermore we have had fathers of our flesh which corrected us, and we gave them reverence: shall we not much rather be in subjection unto the Father of spirits, and live?/ <br><br> Now you see there are fathers of our flesh and father of our spirits. Take note of that Word there 'of' not 'in' meaning they are the source. <br><br> Our fathers of the flesh are the ones who impregnated our mothers, so we have our flesh from them while our Father in the Spirit is God Almighty Himself, Our Lord Jesus said this; <br><br> John 20:17 KJV<br>/Jesus saith unto her, Touch me not; for I am not yet ascended to my Father: but go to my brethren, and say unto them, I ascend unto my Father, and your Father; and to my God, and your God./ <br><br> Listen to what God Almighty Himself says; <br><br> 2 Corinthians 6:17-18 KJV<br>/Wherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing; and I will receive you, [18] And will be a Father unto you, and ye shall be my sons and daughters, saith the Lord Almighty./ <br><br> We see again our God Almighty declares that He Himself will be our Father and this was fulfilled through the sacrifice of Christ. <br><br> Let us have the another witness to this truth, let's listen to Apostle Paul; <br><br> Romans 1:7 KJV<br>/To all that be in Rome, beloved of God, called to be saints: Grace to you and peace from God our Father, and the Lord Jesus Christ./ <br><br> Here we see again, Apostle Paul Says that God is our Father. <br><br> Having clarified that appellation, let me emphasize again that when we say Spiritual Father, we are trying to refer to that person who a Father In the Lord, or Father in the Faith or Father in the Gospel! <br><br> Now let us advance; <br>Through the witness of the scriptures, we understand that having a Father in the Lord is pleasing in the sight of God, it is written; <br><br> Ephesians 6:1 KJV<br>/Children, obey your parents in the Lord: for this is right./ <br><br> We see that we can have parents in the Lord, but what does this mean according to scriptures? <br><br>1. A Father in the Lord is the one who begot you through the preaching of the Gospel [1 Corinthians 4:15]: no one can beget himself in the Lord, the scripture explains this in Romans 10:8-17, of importance is this portion; <br><br> Romans 10:13-14 KJV<br>/For whosoever shall call upon the name of the Lord shall be saved. [14] How then shall they call on him in whom they have not believed? and how shall they believe in him of whom they have not heard? and how shall they hear without a preacher?/ <br><br> The person who preached and you believe and got saved and born again is your Father or Mother in the Lord. <br><br> 2. Your Father in the Lord is the one who Labours in the Word and Prayer for Christ to be formed in you [Galatians 4:19]: sometimes the person who preached and you believed and was saved is not the same person who teaches you the doctrine of Christ through which your soul is conformed to the Image of Christ. That's why an Evangelist can preach to you and you believe and receive Christ and then you start attending a church and the Pastor who is teaching you the doctrine becomes your Father in the Lord, so though he did not beget you, he is the one forming the image of Christ in you. <br><br> 3. Your Father in the Lord is the one ordained by God to watch over your Soul [Hebrews 13:17]: now notice scripture says watching over your soul, not your Spirit [Only God Almighty can watch over your Spirit] but men are called to watch over your Souls, these can be shepherds or Pastors, so if you are attending a church, the Pastor of the Church automatically becomes your Father in the Lord because at that Season of Your Life that is the person who watches over your soul before God. <br><br> 4. Your Father in the Lord is the Person who births you into Ministry [Philippians 2:22]: Now some times when a Pastor calls someone his father in the Lord, it may be on account of the person birthing him into Ministry or having the oversight of his Ministry, so like Paul said concerning Timothy and Mark, he called them sons not because he begot them but because they served under him in ministry and were through his ministry birth into ministry and he Paul had oversight over them, so you see Paul will write letters to Timothy, Titus and Philemon, counseling them how to carry out the ministry they have received charge for. <br><br> Finally, let me counsel how you should relate with your Parents in the Lord; <br><br> 1. Submit yourself to them : [1 Peter 5:5] Submitting yourself is bringing yourself under their authority, now this is for your own advantage and to make their work for you easier for them, rebellion will only delay your formation and hinder your enthronement. Submission is not an emotional matter, we see this in the story of Sarah and Hagar, when Sarah maltreated Hagar, Hagar ran away but when she met the angel of the Lord she was sent back, see this; <br><br> Genesis 16:6-10 KJV<br>/But Abram said unto Sarai, Behold, thy maid is in thy hand; do to her as it pleaseth thee. And when Sarai dealt hardly with her, she fled from her face. [7] And the angel of the Lord found her by a fountain of water in the wilderness, by the fountain in the way to Shur. [8] And he said, Hagar, Sarai's maid, whence camest thou? and whither wilt thou go? And she said, I flee from the face of my mistress Sarai. [9] And the angel of the Lord said unto her, Return to thy mistress, and submit thyself under her hands. <br> [10] And the angel of the Lord said unto her, I will multiply thy seed exceedingly, that it shall not be numbered for multitude./ <br><br> Now you see, despite the fact that Hagar was maltreated, the Angel asked her to go back and submit herself to Sarah and the angel explained thus, that the child in her womb [her own ministry] can receive the necessary Impartation to become great. So you don't submit because the mentorship is pleasant and sweet but because it is the process by which you are prepared and equipped unto greatness. <br><br> Now it is worthy to take note that when Haggar ran away, when the Angel met her, he Called her /Sarah's Maid/, meaning in the sight of God she was still Sarah's maid though she had ran away [when you want to leave a mentorship system don't run away, it is better to approach your mentor so you can be released for your own good]. <br><br> 2. Follow them [1 Corinthians 11:1] <br>God expects us to follow our parents in the Lord as sheep follows it's shepherd, but we must follow them if and only if they themselves are following Christ which is known by the conformity of their lives to the scriptures. <br><br> 3. Obey them [Hebrews 13:17]: <br> Given the responsibility to shepherd your soul, your Parents in the Lord deserve your obedience, because often the instructions that make for your growth in Christ and alignment to the purpose of God will be released from their mouth and disobeying such is denying yourself the advantage of advancing in the ways of God. <br><br> 4. Honour them [Ephesians 6:1-3] <br>Your parents in the Lord deserve your unconditional honour for the role God ordained them to achieve in your life. Now there is a difference between obedience and Honour; you only obey them when their instructions agree with the standards of God as revealed in the scripture but if it does not agree you should not obey them but you must still honor them. Let me explain, if lady has a Father in the Lord whom approaches her for illicit sexual relationship, she should not agree no matter the pressure but also she should not take advantage of that to dishonour him and begin to insult him publicly. We must be careful not to fall into the trap of dishonoring whom we ought to honour. Nowadays, it is very common for people to leave a certain man whom was their Father in the Lord and begin speaking against the person because of the errors they saw, but let me say this to you, /Sons do not circumcise Fathers/ if you see your father's nakedness and realize he is not circumcised then take it upon yourself to circumcise him, God will judge you. It is arrogance and pride for a son to take upon himself the responsibility to circumcise a father. And strangely when fathers circumcise sons, they do it in the private but when sons want to circumcise fathers they do it publicly on social media, see the hypocrisy. A son makes errors, his father corrects him privately but when the father makes an error the sons takes it to social media. Sons who claim to expose their fathers are most often sons whom the fathers had covered. I repeat SONS DO NOT CIRCUMCISE FATHERS! Sadly, we are the generation of which the scripture prophesied thus; <br><br> Proverbs 30:11 KJV<br>/There is a generation that curseth their father, and doth not bless their mother./ <br><br> That warning is from the Spirit and this applies to our generation for according to the Speakings of the Spirit, one of the signs of end times is thus; <br><br> 2 Timothy 3:1-2 KJV<br>/This know also, that in the last days perilous times shall come. [2] For men shall be lovers of their own selves, covetous, boasters, proud, blasphemers, disobedient to parents, unthankful, unholy,/ <br><br> Notice that one of the signs is DISOBEDIENCE TO PARENTS.<br>But for those who chose to walk on that path, let me show what the judgment of such is; <br><br> Proverbs 20:20 KJV<br>/Whoso curseth his father or his mother, his lamp shall be put out in obscure darkness./ <br><br> You see that? It is wisdom to refrain yourself from speaking against Fathers in the Lord, because of their errors. Remember that Jesus is called the Son of David, the same David who took a man's wife, impregnated her and conspired for him to be killed to cover his sins. Yet Jesus is not ashamed to be called the Son of David. God has reserved for himself the right to judge Fathers. <br><br> God demands that there be peace amongst fathers and sons, scripture says; <br> Malachi 4:5-6 KJV<br>/Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the Lord : [6] And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers, lest I come and smite the earth with a curse./ <br><br> Whenever you see an issue in ministry at the root of it is a problem with fatherhood or sonship. So I recommend that we take these truths seriously.",
          "picture": "image2.jpg",
          "date": "2024-01-28"
        },
        {
          "id": 22,
          "title": "Question: Must I have a Spiritual Father to Succeed as a Pastor?",
          "headerText": "Must I have a Spiritual Father to Succeed as a Pastor?",
          "content": "Answer: Now in the former post I addressed the subject of who is a Spiritual Father   <br>   <br> Now let me address the part of the question, where you asked if it is compulsory to have a Spiritual Father to Succeed in Ministry.   <br>   <br> First of all, this is a very important question because its response will help to address the concerns of Many on this subject  <br> . Let me begin by saying that, the major requirement for fulfilling the purpose of God as a Minister is Fellowship with the Holy Spirit, it is written;   <br>   <br> Acts 13:2 KJV;   <br> /As they ministered to the Lord, and fasted, the Holy Ghost said, Separate me Barnabas and Saul for the work whereunto I have called them./   <br>   <br> The Holy Spirit is the custodian of the Will of God for Men, therefore only Him can reveal the deep things of God to them. We see how the Holy Spirit said  /Separate to me Barnabas and Saul for the work which he has called them, / so the Holy Spirit is the one that calls men into that which they were predestined to do in God before the foundations of the World. God does not call men, he ordains them while they are still in him unto a purpose and a good work, but when they come on earth, it's the responsibility of the Holy Spirit to call them into good work for no one knows the deep things of God except the Holy Spirit.    <br>   <br> Today many people are frustrated in ministry because they were introduced to men before they were introduced to the Holy Spirit, they are more conscious of their relationship with men, than their fellowship with the Holy Spirit, they are more careful not to offend men than they are to grieve the Holy Spirit, this is because many do not understand that without the agreement of the Holy Spirit, no man can give or impart to you any spiritual substance, gifts or graces, it is written;   <br>   <br>  1 Corinthians 12:4,11 KJV  <br> /There are different kinds of gifts, but the same Spirit distributes them./   <br> All these (gifts of healing, prophecy, miracles etc) are the works of one and the same Spirit, and he distributes them to each one, just as He wills.   <br>   <br> Now, we see here that it is the Holy Spirit who distributes gifts not men, yes it is true that He often give the gifts through the Laying on of hands but he is the One that gives as He Wills, not as you or your Spiritual Father Wills. If the Holy Spirit does not want you to receive a particular gift you will never have it no matter who lays his hands on you, that is why it is important to pay attention to your fellowship with the Holy Spirit.   <br>   <br> Now we can see this as one of the concerns of Apostle Paul, when he met a group of disciples, see what he asked them;   <br>   <br> Acts 19:2 KJV  <br> /He said unto them, Have ye received the Holy Ghost since ye believed? And they said unto him, we have not so much as heard whether there be any Holy Ghost./   <br>   <br> You see the focus, He is concerned if they have received the Holy Spirit and not if they have a Spiritual Father.   <br>   <br> But now without the Ministry of Sent Men and women it will be hard to fulfill the purpose of God on earth, every sheep needs a shepherd and work of A Father or Mentor is to act as a shepherd to you and guide you through the grace and wisdom of God into all that which us ordained for you by the Holy Spirit.   <br> It's true the Holy Spirit is the One Who calls Men, but to avoid you making alot of errors on account of immaturity the Holy Spirit will lead to a Man or woman unto whom he has given charge to watch over your soul!   <br> If you read across scriptures you will realize that the Ministry of the Holy Spirit is introduced on the earth realm by the ministry of sent Men.   <br> Let's analyze scriptures on this subject;   <br>   <br> From the scriptures we Clearly understand the concept of Spiritual Parenting, and let me emphasize that it is very necessary. Taking for example Apostle Paul, he had a face to face encounter with the Lord Jesus himself, but when he asked the Lord what will be done, the Lord sent him to the city to wait for a man, and the Lord Jesus went and instructed Ananias to go and preach to Paul and pray for him to receive the Holy Spirit [Acts 9:1-17].   <br>   <br> Now we see here that the person who begot the great Apostle Paul in the Lord was a common disciple called Ananias.   <br>   <br> I've gone through the scripture severally I have not seen where the Holy Spirit was given to any man in the absence of someone Laying hands or preaching. You see that even when the Lord Jesus appeared, he did not give Paul the Holy Spirit, He had to go and send Ananias to go and do that, now if the Lord could do it by himself he will not go and ask Ananias to do it. Let me show you something concerning this truth;   <br>   <br> Acts 8:15-17 KJV  <br> /Who, when they were come down, prayed for them, that they might receive the Holy Ghost: [16] (For as yet he was fallen upon none of them: only they were baptized in the name of the Lord Jesus.) [17] Then laid they their hands on them, and they received the Holy Ghost./   <br>   <br> Notice the people believed and were baptized with water, yet the Holy Spirit had not come upon them. What was he waiting for? Ofcourse he was waiting for the Apostles of God. When the Apostles came and laid their hands on the disciples at Samaria the Holy Spirit came upon them. You see again how relevant the Ministry of sent men is.   <br>   <br> No matter your encounters, if they are genuine, the Lord will lead you to a man or woman to whom he will give charge over your soul and make them your shepherd.   <br>  Let us see the case of our Lord Jesus;   <br> Luke 1:31-32 KJV  <br> /And, behold, thou shalt conceive in thy womb, and bring forth a son, and shalt call his name JESUS. [32] He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David:/   <br>   <br> Angel Gabriel said to Mary that she will give birth to the son of the Highest, and we know that the highest is God Almighty, then he continues by saying God will give him the throne of his father David. Now, that seem confusing, is his father David or the highest? He is the Son of God but when it comes to obtaining an inheritance he must subscribe himself to a tribe, this is because in the Kingdom of God, inheritance is alloted according to tribes; for example Priesthood Is the inheritance of the Tribe of Levi, if you are not from that tribe You cannot obtain priesthood same as Royalty is from Judah, If you are not from Judah you cannot become a King. So God has hidden inheritances in lineages and tribes and you can only obtain them when you subscribe to those tribes.   <br>   <br> The graces and the gifts of the Spirit are hidden in men, and thus are rarely transferred without the ministry of men, see what Apostle Paul Said;   <br>   <br> Ephesians 3:1-2 KJV  <br> /For this cause I Paul, the prisoner of Jesus Christ for you Gentiles, [2] If ye have heard of the dispensation of the grace of God which is given me to you-ward:/   <br>   <br>  Now see that, God gave the Grace for us to Paul, meaning if you despise Paul you will never get that Grace no matter how you pray and fast. There are men and women in whom your inheritance is kept by God and until you submit yourself to them you will not have it. Let us see something;   <br>   <br> 2 Timothy 1:6 KJV  <br> /Wherefore I put thee in remembrance that thou stir up the gift of God, which is in thee by the putting on of my hands./   <br>   <br> Notice the gift of God came into Timothy through the Hands of Paul. Graces and gifts are transferred from generation to generation through the agency of men to men.   <br>   <br> So conclusively, you should submit yourself to mentorship of God through a Man for this will be unto an advantage in executing the purpose of God.",
          "picture": "image2.jpg",
          "date": "2024-01-28"
        },
        {
          "id": 23,
          "title": "Question: Shalom Man of God,  I'm a little concerned about the act of printing stickers and wristbands and selling them in churches, please can you enlighten me on this? Are stickers and wristbands scriptural or is it merely a business strategy to raise funds for the ministry?",
          "headerText": "Are stickers and wristbands scriptural or is it merely a business strategy to raise funds for the ministry?",
          "content": "Answer : The subject of stickers and other prophetic materials is a very divisive one in the Church of God, thus in answering this question, I will restrain myself to speak only within the confines of the scriptures, so that I will not bring in my personal opinion which is founded on the revelations and visions I have from the Lord on this subject.  <br>  <br> First of all, it is important that we understand that stickers and wristbands have their origin from the commandments that God gave to Moses, and when God introduced them he clearly stated the reason for its production.  <br>  <br> It is written in Deuteronomy 11:18-21;  <br> /Therefore you shall lay up these words of mine in your heart and in your soul. You shall bind them for a sign on your hand, and they shall be for frontlets between your eyes. <br>  19  You shall teach them to your children, talking of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. <br>  20  You shall write them on the door posts of your house and on your gates; <br>  21  that your days and your children’s days may be multiplied in the land which Yahweh swore to your fathers to give them, as the days of the heavens above the earth./  <br>  <br> Now this is exactly where the concept of stickers and wrists bands originated from among the Jews and the People of God.  <br>  <br> God in his wisdom introduced this concept to help his people meditate on the Word Day and Night. The Principle of meditation on the Word cannot be over emphasized for it is the pathway to the growth and maturity of the believer. Meditation on the word is the strategy the Holy Spirit uses to structure the minds of men to be conformed to the image of Christ and guide them to walk in the pathway of righteousness.  <br>  <br> So as the Lord was instructing his people to lay up his words by meditating on them, he introduced a concert to keep them focused on the Word.  <br>  <br> The Lord said this;  <br> /Therefore, you shall lay up these words of mine in your heart and in your soul. You shall bind them for a sign on your hand, and they shall be for frontlets between your eyes. <br>  19  You shall teach them to your children, talking of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. <br>  20  You shall write them on the door posts of your house and on your gates;/ <br> Here, the Lord said /write the scriptures and put them on your hand, and then write them on the door post of your house and on your gates/.  <br>  <br> Now why all this?  <br> The answer is in verse 19;  <br> /You shall teach them to your children, talking of them when you sit in your house, when you walk by the way, then you lie down, and when you rise up./  <br>  <br> So we see here that what God wanted was to create a system where they will constantly have remembrance on His Word.  <br>  <br> So God said /write the scriptures on your door posts and on your gates, so that whenever you are going out or coming into your house you see those scriptures and lay them up in your heart through confession/ but it did not end there, the Lord further instructed them to make bracelets where they have written scriptures upon and so when they go to their work, as they are working, they will be seeing the scriptures on their hands and thus remember the Word of the Lord and lay it up in their hearts through Confessions.  <br>  <br> Now, a sticker is specifically for this purpose, on a sticker a portion of scripture is written and put at the door post and gates of the houses of they who believe in the Lord, and whenever the saints are coming in or going out, as they read that scripture and confess it, they lay it up in their heart through meditation and they experience the benefits of the Lord.  <br>  <br> Same a wristband is a bracelet with a scriptures, that is upon the hands of the believer, so whenever he looks at his hands, he reads the scriptures and confesses it and through meditation lays it up in his heart.  <br>  <br> Now even on a wrist band and sticker for example, it is written /I am The Redeemed of the Lord/ from Isaiah 62:12, when you are leaving or entering your house, you read the sticker and you confess I am the redeemed of the Lord, same thing while you are walking or working and you see the wristband on your hand and you confess I am the redeemed of the Lord. Now all these confession builds you in your Most Holy Faith and by that speaking, you are establishing that reality, remember the Lord Jesus said, YOU SHALL HAVE WHAT YOU SAY! [Mark 11:23].  <br>  <br> I remember a testimony we had in church, we had made wristbands and wrote on them /I am the Redeemed of the Lord,/ and one of the disciples of Christ who worship with us was in a bus traveling and suddenly the driver began screaming while they were descending a hill that brakes had failed, and while everyone was panicking, the Christian too was panicking and while panicking he lifted his hands and saw the wristband he read it, i am the redeemed of the Lord, then suddenly he began confessing and declaring /I am the Redeemed of the Lord, untimely death is not my portion,/ then the car tumbled and fell in a ditch, some people died on the spot, while others were wounded but he came out unhurt.  <br>  <br> Now it must be understood that it is not the wristband that saved him, it is the declaration of the Word that brought about his salvation for scripture says, /if you believe with your heart and confess with your mouth you will be saved./ God does not choose to save some people in accidents and allow others to die, no, God has given us his word and we are to use the word to make our way prosperous and have good success.  <br>  <br> So the true intention of God in introducing wristband and stickers was to keep his people focused on his word to them so they can see the word and speak it forth at all times.  <br>  <br> Wristbands and stickers are not charms that just work on their own, yes ofcourse there is a possibility that after these materials have been prayed upon, the anointing of God can be imparted on them so much that they can become instruments for signs, wonders and miracles to occur. This can be better understood in this account of scripture;  <br>  <br> Acts 19:11-12 KJV <br> /And God wrought special miracles by the hands of Paul: [12] So that from his body were brought unto the sick handkerchiefs or aprons, and the diseases departed from them, and the evil spirits went out of them./  <br>  <br> Paul the Apostle was anointed of the Lord, and thus sometimes when some materials came in contact with him, the anointing was imparted to them and wherever those materials were carried the same miracles that would have happened if Paul was there, happened through those materials. This is a very common thing among the anointed, remember our Lord Jesus;  <br>  <br> Mark 6:56 KJV <br> /And whithersoever he entered, into villages, or cities, or country, they laid the sick in the streets, and besought him that they might touch if it were but the border of his garment: and as many as touched him were made whole./  <br>  <br> So do not consider it a strange phenomenon if signs, wonders and miracles happen through stickers and wristbands, because if the anointed of the Lord has prayed upon them, then Lord God can Graciously permit a measure of the anointing to be imparted on this instruments, and they can still work miracles even many many years after, remember this story ;  <br>  <br> 2 Kings 13:21 KJV <br> /And it came to pass, as they were burying a man, that, behold, they spied a band of men ; and they cast the man into the sepulchre of Elisha: and when the man was let down, and touched the bones of Elisha, he revived, and stood up on his feet./  <br>  <br> You see here that Elisha died and many years later, a dead man's body touched his bones and the dead man came back to life. Definitely, it is not the bones of Elisha that raised the dead man, it was the anointing that was still resident there. Now just as the anointing can abide in bones of a dead Prophet and still work miracles, so can the anointing be imparted in stickers and wristbands and they work miracles also but nevertheless, the true purpose of this materials is to keep people meditating on the word of God.  <br>  <br> If the Lord gives you a vision, prophecy, revelation or if you love a particular scripture, photocopy it and put it all over your house and room, write on your properties that you use the most so that you will see it all the time and when you see it confess it.  <br>  <br> Now while it is true that many have merchandised this spiritual concept, it does not negate nor alter its efficacy. The Bible being the word of God is one of the greatest businesses, many companies [some even pagans] engage themselves in producing the Bible, because they want to sell it and make gains not because they want to spread the word of God, but the fact that you bought the Bible does not hinder you from reading it and growing in your knowledge of God.  <br>  <br> Some churches sell stickers and wrists bands to make money, others sell them because they paid for its production and have to atleast recover the cost of production, whatever be the case, judgement belongs to God, we must not deny the saints the advantage and benefits of this materials because some covetous people are enriching themselves through them. Let us teach the saints and pray that they are guided by the Holy Spirit and take advantage of every system made available by God for their profiting.",
          "picture":"image1.jpg",
          "date": "2024-01-26"
        },
        {
          "id": 24,
          "title": "Question: Good day Prophet, I want to enquire about the issue of people falling under the anointing during prayers, manifesting strange behaviors and sometimes claim a demon is speaking through them. Honestly, I'm not really comfortable with this and sometimes I think it is just drama but I am open to what you have to say on this given that I've watched it happen in your ministrations.",
          "headerText": "Question on Manifestation of Demonic Spirits during Prayer/Deliverance Sessions.",
          "content": "Answer : Shalom Dear Saint, your question is a good one and to do justice to it, we must put aside our feelings and cultures and base our understanding on scripture, for only the scripture is profitable for doctrine. <br>  <br> Now the act of people falling under the anointing during prayers is a common thing among the pentecostal and charismatic systems but it is a strange phenomenon to many main stream churches, like Catholic, Presbyterian and Baptist and thus the reaction of people to it is most often conditioned by the spiritual system they have subscribed themselves to.  <br> In addressing this matter, we will base ourselves on the opinion of God as revealed in scripture and not on revelations and Angelic Encounters.  <br>  <br> Now to address any occurrence in the Church, we must always seek reference from the ministry of our Lord Jesus, for he is the Author and Finisher of our Faith, thus whatever he did in his ministry is precedence set and pattern established for his servants to follow. We find out that in scriptures, people falling under the anointing of God was quite common, let's see some examples;  <br>  <br> John 18:3-6 KJV <br> /Judas then, having received a band of men and officers from the chief priests and Pharisees, cometh thither with lanterns and torches and weapons. <br>  [4] Jesus therefore, knowing all things that should come upon him, went forth, and said unto them, Whom seek ye?  <br> [5] They answered him, Jesus of Nazareth. Jesus saith unto them, I am he. And Judas also, which betrayed him, stood with them.  <br> [6] As soon then as he had said unto them, I am he, they went backward, and fell to the ground./  <br>  <br> Now we see in this account, that the people who came to arrest Jesus, went backward and fell as soon as He said He was Jesus. Now what could have made this men to fall? Definitely not epilepsy. Were they pretending? Certainly not. Were they paid to fall? obviously Impossible! These men came on a mission to arrest Jesus but when he spoke, they were hit by a spiritual force. Now I will like to clearly state that this is The Anointing of the Holy Spirit, and if you are born of God through receiving the Holy Spirit then this same anointing is in you, intact scripture testifies thus;  <br>  <br> 1 John 2:27 KJV <br> /But the anointing which ye have received of him abideth in you, and ye need not that any man teach you: but as the same anointing teacheth you of all things, and is truth, and is no lie, and even as it hath taught you, ye shall abide in him./  <br>  <br> The Lord Jesus in this account was demonstrating the power available for every Son of God to preserve themselves from all evil. If you are born of God, you have this same anointing in you, scripture says /as He is, so are we./ When evil men come against you in one way, there is an anointing in you that cause them to go back and seven ways. The Anointing of the Holy Spirit is the Spiritual force that takes men into the possibilities of God. What did Jesus do for the anointing to move? He simply confessed who he is. Confession is saying what God has said, when they came to arrest Jesus he was quiet and they advanced, but when he said /I am He,/ I am Jesus they all fell.  <br> Nothing activates the anointing of God to move like the confession of who we are in Christ, scripture says;  <br>  <br> Hebrews 13:5-6 KJV <br> /Let your conversation be without covetousness; and be content with such things as ye have: for he hath said, I will never leave thee, nor forsake thee. [6] So that we may boldly say, The Lord is my helper, and I will not fear what man shall do unto me./  <br>  <br> You see, he said that we may bold say. And what happens when we say what God has said?  <br>  <br> Acts 10:44 KJV <br> /While Peter yet spake these words, the Holy Ghost fell on all them which heard the word./  <br>  <br> Notice that when we speak the word of God, we activate the moving of the Spirit. So whenever the minister of God is preaching or praying the Anointing of the Holy Spirit Falls on they that believe and sometimes it hits them so hard that they fall, either for importation or for their deliverance from a demonic spirit.  <br>  <br> We see this happened in the ministry of our Lord Jesus thus;  <br>  <br> Luke 9:42 KJV <br> /And as he was yet a coming, the devil threw him down, and convulsed him. And Jesus rebuked the unclean spirit, and healed the child, and delivered him again to his father./  <br>  <br> Now notice this instant, as Jesus asked for the man whose child was possessed to be brought to him, immediately the child approached Jesus, scripture testifies that /The Devil threw him down/ now this is disturbing, a devil can obviously not be seen, but the writer through the Spirit perceived that it is the devil that threw him down. Now we see that sometimes when prayers are made in church, devil can start throwing people down, and can cause them to manifest strange behaviors, sometimes you see the person begin to act like an animal, this is because the spirit that has possessed him is associated to that animal.  <br>  <br> We need to be spiritual, we clearly see that a devil can throw people down, and notice that this only happened when Jesus asked that the child be brought to him. There are people who come to church and sit down, praise God, worship Him and are normal, until the minister of God by the anointing  begins to confront the evil spirit in them, and then the spirit will begin to express itself though the bodies they have possessed. One thing you must Know is that demons will never leave on their own accord, ignoring demons in the hope that they will go is spiritually unwise, demons will not go unless they are cast out by believers, that is why Jesus said this;  <br>  <br> Mark 16:17 KJV <br> /And these signs shall follow them that believe; In my name shall they cast out devils; they shall speak with new tongues;/  <br>  <br> Notice that the the first sign of being a believer is the ability to cast out demons. Jesus did not say You should wait for the demon to go, or you should ask God to cast the demon out NO, he said, if You believe you will cast out the demons. How are demons casted out? Jesus teaches us how;  <br>  <br> Matthew 8:16 KJV <br> /When the even was come, they brought unto him many that were possessed with devils: and he cast out the spirits with his word, and healed all that were sick:/  <br>  <br> Notice he casted out demons with his word, so it is what every believer has been empowered to do. When you perceive demonic activities, Cast out the Demons by commanding them in the name of Jesus, don't manage demons, Damage them, don't tolerate demons, obliterate them, Don't complain, come plain and Cast them out in the name of the Lord Jesus and you will testify like the apostles did;  <br>  <br> Luke 10:17 KJV <br> /And the seventy returned again with joy, saying, Lord, even the devils are subject unto us through thy name./  <br>  <br> Now this is what happens when a minister begins to confront satanic activity by the anointing of God, most often there will be a reaction from the devils, and they will often throw the people down, especially when they are resisting, devils only have some rest when they possess men so definitely they won't want to leave the person without a fight, that is why you hear the demons speaking through the person they have possessed, to beg, argue or even curse, it is not strange, it happened to our Lord Jesus, see this;  <br>  <br> Mark 5:8-13 KJV <br> /For he said unto him, Come out of the man, thou unclean spirit. [9] And he asked him, What is thy name? And he answered, saying, My name is Legion: for we are many. [10] And he besought him much that he would not send them away out of the country. [11] Now there was there nigh unto the mountains a great herd of swine feeding. [12] And all the devils besought him, saying, send us into the swine, that we may enter into them. [13] And forthwith Jesus gave them leave. And the unclean spirits went out, and entered into the swine: and the herd ran violently down a steep place into the sea, (they were about two thousand;) and were choked in the sea./  <br>  <br> Now we see clearly how the mad man said, /we are many/ meaning something else was speaking through him. This is why you sometimes hear demons arguing with the Pastor, this is because they are trying to resist the deliverance for fear of losing their home.  <br> Now sometimes in prayer, some people fall and become immobile on the floor, as though they are dead, now this also happened to the Ministry of our Lord Jesus;  <br>  Mark 9 <br> /When Jesus saw that a crowd had come running, He rebuked the unclean spirit. /You deaf and mute spirit,/ He said, /I command you to come out and never enter him again./  <br>  26  After crying out, the spirit made the boy fall several times and convulsing him violently, the spirit came out. The boy lay on the ground like a corpse, so that many said, /He is dead./  <br>  27  But Jesus took him by the hand and helped him to his feet, and he stood up. / <br> Now You see after the Spirit made the child to fall severally, when it left him the boy was on the floor motionless, now for any Minister of God with experience they will immediately understand that the Spirit is gone.  <br>  <br> Finally I will like to emphasize that falling under the power is not the requirement of receiving healing and deliverance, we must be careful not to miss the miraculous because we are looking for the spectacular. See this account;  <br>  <br> Mark 5:27-30 KJV <br> /When she had heard of Jesus, came in the press behind, and touched his garment. [28] For she said, If I may touch but his clothes, I shall be whole. [29] And straightway the fountain of her blood was dried up; and she felt in her body that she was healed of that plague. [30] And Jesus, immediately knowing in himself that Power had gone out of him, turned him about in the press, and said, Who touched my clothes?/  <br>  <br> Now notice that power went out of Jesus, yet the woman did not fall, she did not fall, she did not shake but she was healed.  <br> The Miraculous is not in the Spectacular, it is in the Supernatural. The devil has robbed many of their healing and deliverance by making them think that because they did not fall or shake or manifest, they have not received from God.  <br>  <br> Let's see this final example in Luke 13:11-13 KJV <br> /And, behold, there was a woman which had a spirit of infirmity eighteen years, and was bowed together, and could in no wise lift up herself. [12] And when Jesus saw her, he called her to him, and said unto her, Woman, thou art loosed from thine infirmity. [13] And he laid his hands on her: and immediately she was made straight, and glorified God./  <br>  <br> We see a woman was been held bound by a satanic spirit for 18 years and was bent physically yet when Jesus rebuked the demon, the woman did not manifest or fall but she was delivered. Once more you see that falling is not a necessary requirement for receiving healing or deliverance but it is one of the effects of encounter with the anointing.  <br>  <br> But let me end with an observation from that account, we see a woman who was possessed for 18 years and went to the temple often but was not delivered, this is because the Pastors [The Pharisees] did not make prayers that confronted and challenged that devil. Sometimes the reason why people do not fall in a church is not because they are too mature, it is simply because the pastors there do not challenge and confront the demons oppressing or possessing men. So I give you this counsel, when you perceive that things are not going well in your life as scriptures promises, confront and challenge demonic beings and cast them out, whether you fall or you don't fall, one thing is sure if you have faith in the Lord Jesus, then the Demon will obey you in His Name.",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 25,
          "title": "Question: Good Day sir, I hear a lot of Pastors praying saying, /The God of My Father/! I will love to have more insight on that from the scriptures, thanks ",
          "headerText": "Throw more light on /The God Of My Father/",
          "content": "Answer: Let's get to scriptures to understand where this pattern comes from: The GOD OF YOUR FATHER <br> Genesis 49:25-26 KJV <br>/ Even by the God of thy father, who shall help thee; and by the Almighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of the womb: <br>[26] The blessings of thy father have prevailed above the blessings of my progenitors unto the utmost bounds of the everlasting hills: they shall be on the head of Joseph, and on the crown of the head of him that was separate from his brethren./  <br> <br>  We understand from this scripture that /the God of Your Father/ is a dimension of God invoked by Covenant with certain men.  <br> <br>  There is nothing wrong to pray and say /the God of My Father help me/ because You are simply aligning yourself under a Covenant God has with a man (the man who fathers you), even as much as you cannot bless Yourself  and God has committed the authority to bless the children in the mouths of the Fathers, in the same light, you can pray to the God of Your Father the person who has Spiritual authority to bless You and watches over Your Soul...  <br> <br> In Philippians 4:19,  Paul said My God shall supply All Your Needs...  <br> <br> He could have said Our God or Your God , but if He said /My God/ it is not because his God is different,  He is simply invoking the dimension of God he operates in through the Gift of Grace upon him...  <br> <br> It's the dimension of Grace operating in You that we Call /YOUR GOD.../  <br> <br> Galatians 1:24 KJV <br>/And they glorified God in me./  <br>Who is God in Me ? <br>Is he different from the God in Heaven? <br>No, the God in Him is the Grace at Work on him....  <br> <br> Galatians 2:9 KJV <br>/And when James, Cephas, and John, who seemed to be pillars, perceived the grace that was given unto me, they gave to me and Barnabas the right hands of fellowship; that we should go unto the heathen, and they unto the circumcision./  <br> <br> When we pray and say in the name of the God of My father or Pastor, we are not praying in the Name of our father or Pastor neither are we praying through them, we are Simply invoking the dimension of the Anointing of God operating through them, because no matter how we pray, the manifestation of God we experience is a function of the measure of Grace operating upon us, that's why as the Body of Christ, we need one another, because we all have different Graces and these gift of Grace is what determines the dimension of God we can introduce to this Earth realm to intervene in the affairs of Men...  <br> <br> Before God manifests himself through you, he first reveals himself to You,  <br> <br>  Exodus 6:3 KJV <br> /And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name Jehovah was I not known to them. /  <br> <br>  Now God is saying to Moses that although I'm the God of ABRAHAM, Isaac and Jacob they did not know the dimension of Me Called JEHOVAH... <br>  <br>  Jehovah means the self-existing One   <br> <br>  Matter of Fact, the first time God appeared to ABRAHAM, he appeared as Elohim, after when Abraham Met Melchizedek, Melchizedek introduced Abraham to the dimension of God call EL ELYON, (and this was where the revelation of Tithes  was introduced as a Principle to Honor God as the Possessor of Heaven on Earth and also the mystery of COMMUNION was introduced as a means to partake of the Divinity of God).  <br> <br>  Genesis 14:18-20 KJV <br>/ And Melchizedek king of Salem brought forth bread and wine : and he was the priest of the most high God.<br> [19] And he blessed him, and said, Blessed be Abram of the most high God, ( EL ELYON) possessor of heaven and earth: <br> [20] And blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all./  <br> <br> We see that Melchizedek was the Priest of EL ELYON a dimension of God that ABRAHAM did not know , and he taught ABRAHAM that dimension of God...  <br> <br> After that in Genesis Chapter 15, God revealed himself to ABRAHAM as ADONAI...  <br> <br> Now it's the revelation of God to you that becomes your Altar. An Altar is not merely a platform, it's a revelation of God that provokes a specific  manifestation of God on the earth realm, (we saw people build altars and named theme by their revelation of God, for example  <br> <br> >  Abraham   <br>Genesis 22:14 KJV <br>/And Abraham called the name of that place ( Altar)  Jehovah-jireh : as it is said to this day, In the mount of the Lord it shall be seen./ >   Moses   <br>Exodus 17:15 KJV <br>/And Moses built an altar, and called the name of it Jehovah-nissi :/> Gideon <br> Judges 6:24 KJV <br>/Then Gideon built an altar there unto the Lord, and called it Jehovah-shalom : unto this day it is yet in Ophrah of the Abi-ezrites./ >  Samuel <br>1 Samuel 7:12 KJV <br>/ Then Samuel took a stone, and set it between Mizpeh and Shen, and called the name of it Eben-ezer, saying, Hitherto hath the Lord helped us. /  <br> <br>  When the Lord Jesus Came he brought the final revelation of Jehovah  <br> Which is ABBA FATHER...  <br> <br> John 20:17 KJV <br>/Jesus saith unto her, Touch me not; for I am not yet ascended to my Father: but go to my brethren, and say unto them, I ascend unto my Father, and your Father; and to my God, and your God./  <br> <br> And this revelation is what introduced the dispensation of Sonship that we are all Part of, and this is the dimension of God that the Earth has been waiting even as it is written ..  <br> <br> Romans 8:19 KJV <br> /For the earnest expectation of the creature waiteth for the manifestation of the sons of God./ <br>  <br>  The Lord Jesus set the stage for the final manifestation of God on the Earth realm by introducing Jehovah as Our Father ...  <br> <br> The revelation of God that only Jesus could bring is that of his fatherhood, The Lord Jesus did not bring the revelation of God as a healer or saviour or deliverer the Prophets of Old did that, he brought in the revelation of God as our Father...  <br> <br> If You Check well The Lord Jesus never called Jehovah as God he always called him Father, the Only time he called him God is on the cross when he said in  <br> <br> Matthew 27:46 KJV <br>/And about the ninth hour Jesus cried with a loud voice, saying, Eli, Eli, lama sabachthani? that is to say, My God, my God, why hast thou forsaken me? / <br> But after he ended up again by identifying Jehovah as his Father  <br> <br> Luke 23:46 KJV <br> /And when Jesus had cried with a loud voice, he said, Father, into thy hands I commend my spirit: and having said thus, he gave up the ghost./ Now Christianity is built on the revelation that Jesus is the Christ and that JEHOVAH IS OUR GOD AND FATHER   <br> <br> John 20:17 KJV <br> /Jesus saith unto her, Touch me not; for I am not yet ascended to my Father: but go to my brethren, and say unto them, I ascend unto my Father, and your Father; and to my God, and your God. /  <br> <br> Now we see two things, here GOD AND FATHER.... <br> And this is how we relate to Jehovah in this dispensation...  <br> <br>  Sometimes Apostle  Paul will Pray to the God and Father of your Lord Jesus, sometimes he will Pray to the Father in Heaven, sometimes He will say My God, but this don't change that The God is still JEHOVAH and he is Praying in the Name of Jesus, this is to Lay emphasis on the dimension of God he wants to experience...  <br> <br>  God is Covenant Keeping God, and therefore he manifests himself to Men according to COVENANTS, the Covenant God had with Abraham was so relevant that Christ died so that we can enjoy the blessing of the Abraham  <br> <br> Galatians 3:13-14 KJV <br> /Christ hath redeemed us from the curse of the law, being made a curse for us: for it is written, Cursed is every one that hangeth on a tree: <br>  [14] That the blessing of Abraham might come on the Gentiles through Jesus Christ; that we might receive the promise of the Spirit through faith./  <br> <br> We see here that the blessing of Abraham is coming upon us through Christ and not through Abraham, so when we Pray to the God of our Pastor, the Grace of God imparted on him by Covenant begins to Operate upon us through Christ !  <br> <br> Nevertheless, the Grace of God that will operate in our lives did not just depend on the Covenant God has with our Pastor or father, it depends on our FAITH IN CHRIST.... <br> So I encourage you to build yourself in your most Holy Faith by prayers and meditation on scripture so that you can grow in Your knowledge of God and Grace be multiplied to You ...  <br> <br> If You don't Live according to the standard of the word of God which is Holiness you cannot experience the Grace of God.  <br> <br> Saying the God of My Father is not a means to bribe God to do something for You when You are disobedient to him...  <br> <br> Remember this scripture always ..  <br> <br> Acts 10:34-35 KJV <br> /Then Peter opened his mouth, and said, Of a truth I perceive that God is no respecter of persons:  <br> [35] *But in every nation he that feareth him, and worketh righteousness, is accepted with him ./ <br> God is not unfair, God is not biased, God does not show favoritism but by reason of what Some People have done for God and the way they have walked with him, God as chosen to show himself to them in dimension he has not showed to others.  <br> <br> For example  <br> God called ABRAHAM my friend ( Isaiah 41:8) <br> He called David a Man after my Heart ( Acts 13:22) <br> He called Job a blameless Man ( Job 1:8)  <br> <br>  How did these Men get to the kind of relationship with God ? <br> It was simply by their Sacrifice for him .... <br>That's why  Apostle Peter instructs us all thus, <br> 2 Peter 1:10 KJV <br> Wherefore the rather, brethren, give diligence to make your calling and election sure: for if ye do these things, ye shall never fall:  <br> <br>  Give diligence to Make your Calling and Election sure and You will experience God…  <br> <br> There is no room for lazy people in the kingdom of God... <br>People who don't commit themselves in their fellowship with God because they are thinking on the Grace of their Pastor, in case You don't know, the Grace of God upon your Pastor does not work For You if You are not working out your salvation.  <br> <br> Philippians 2:12 KJV <br> /Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling./  <br> <br> It's clearly written   /work out your OWN salvation,/ No one can work out your salvation for you, it’s Your responsibility.",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 26,
          "title": "Question: Good day sir, please I'm confused concerning the subject of tithing, because I've heard messages for and against that practice, please help with this understanding, thank You Sir.",
          "headerText": "Is Tithing Scriptural?",
          "content": "Answer:  First of all we need to understand that the kingdom of God operates by mysteries and these mysteries cannot be discovered they can only be revealed (Matthew 13:11) <br> These mysteries are sacred truths of the kingdom that can only be accessed by revelation, Tithing is a kingdom Mystery!  <br>  <br> Let us see from Scripture where tithing was introduced;  <br>  <br> Genesis 14:18-20 KJV <br> /And Melchizedek king of Salem brought forth bread and wine: and he was the priest of the most high God. [19] And he blessed him, and said, Blessed be Abram of the most high God, possessor of heaven and earth: [20] And blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all./  <br>  <br> Now we see here that the High Priest of God Melchizedek who is symbolic of our Lord is the one who introduced the Mysteries of Tithing and communion  <br> Now its important to note that the Mystery of communion ( bread and wine ) was introduced at the same time with the mystery of tithes , now if you reject the validity of tithing today you  may also go ahead and reject the validity of communion !  <br>  <br> From the encounter of Abraham and Melchizedek we can see the relevance and The Purpose of Tithing!  <br> We must understand that tithe does not originate from the Law of Moses, no! It was emphasized in the Law of Moses; Tithing was already practiced by the Patriarchs hundreds of years before Moses came!  <br>  <br>  Now if Tithing was relevant before Moses then it is still relevant today! Tithing is not of the Law nor of the Prophets , it is of the Patriarchs, its of The Priest hood and not in the order of Levi for Levi himself paid tithes , its the  priest hood in the order of Melchizedek of which we are called today , Scripture says;  <br>  <br> Hebrews 7:1-10 KJV <br> /For this Melchisedec, king of Salem, priest of the most high God, who met Abraham returning from the slaughter of the kings, and blessed him;  <br>  [2] To whom also Abraham gave a tenth part of all; first being by interpretation King of righteousness, and after that also King of Salem, which is, King of peace;  <br>  [3] Without father, without mother, without descent, having neither beginning of days, nor end of life; but made like unto the Son of God; abideth a priest continually.  <br> [4] Now consider how great this man was , unto whom even the patriarch Abraham gave the tenth of the spoils.  <br>  [5] And verily they that are of the sons of Levi, who receive the office of the priesthood, have a commandment to take tithes of the people according to the law, that is, of their brethren, though they come out of the loins of Abraham: [6] But he whose descent is not counted from them received tithes of Abraham, and blessed him that had the promises.  <br>  [7] And without all contradiction the less is blessed of the better.  <br> [8] And here men that die receive tithes; but there he receives  them , of whom it is witnessed that he liveth.  <br>  [9] And as I may so say, Levi also, who receiveth tithes, payed tithes in Abraham.  <br>  [10] For he was yet in the loins of his father, when Melchizedek met him./ br> <br> Notice verse 8 specifies that the Lord receives tithes Today by the Priest hood in the order of Melchizedek and not of Levi, which means the commandment of receiving of tithes today is given to the Priest not in the order of Levi who are subject to the Law of Moses but to the Priest in the order of Melchizedek who are Subject to the principles of the kingdom of God  <br>  <br>  There is nowhere the Lord condemned the act of tithing instead he recommended it ;  <br>  <br> Luke 11:42 KJV <br> /But woe unto you, Pharisees! for ye tithe mint and rue and all manner of herbs, and pass over judgment and the love of God: these ought ye to have done, and not to leave the other undone./  <br>  <br> Notice what the Lord said? These /ought/ ye to have done, in other words you should tithe but you must not think you are justified by your tithe , now you are justified by faith expressed in Love!  <br> Now let's go back to the origin of tithes in the scripture;  <br>  <br> Genesis 14:18-20 KJV <br> /And Melchizedek king of Salem brought forth bread and wine: and he was the priest of the most high God. [19] And he blessed him, and said, Blessed be Abram of the most high God, possessor of heaven and earth: [20] And blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all./  <br>  <br> Now we also understand from the account of Abraham and Melchizedek that we don't give tithes to be blessed ! No! We give tithes because you have been blessed !  <br>  <br> Tithing is  acknowledging God as the source of  your achievement, Abraham went to war and came our victorious recovering a lot of material wealth , he gave his tithes to acknowledge God as the author of that victory  <br>  <br> Let us see the account of Jacob  <br>  <br> Genesis 28:20-22 KJV <br> /And Jacob vowed a vow, saying, If God will be with me, and will keep me in this way that I go, and will give me bread to eat, and raiment to put on, [21] So that I come again to my father's house in peace; then shall the Lord be my God: [22] And this stone, which I have set for a pillar, shall be God's house: and of all that thou shalt give me I will surely give the tenth ( tithe) unto thee./  <br>  <br> Here again we see someone practicing the Doctrine of Tithing before the Law of Moses came , question who taught Jacob ?  <br> Notice here that Jacob promises to give God a tithe of everything God gives him , this means tithing is a recognition that God is the source of your Provision ! When u don't give tithes you are saying that you made the wealth by your strength, and the scripture says ;  <br> Deuteronomy 8:18 KJV <br> But thou shalt remember the Lord thy God: for it is he that giveth thee power to get wealth, that he may establish his covenant which he sware unto thy fathers, as it is this day.  <br>  <br> How do you remember the Lord ?  <br> By giving him your tithes ! Your tithe is a Thanksgiving to God for Provision, your tithe is an acknowledgement that your prosperity is enhanced by the blessing of God, hence WE DO NOT GIVE TITHES TO BE BLESSED, WE GIVE TITHES BECAUSE WE ARE BLESSED! If you we are not blessed then how do we even have what we want to give tithes from?  <br>  <br> Ad scripture says in 1 Corinthians 4:7 <br> /For who makes you superior? What do you have that you did not receive? And if you did receive it, why do you boast as though you did not receive it?/  <br>  <br> We must be careful of Spiritual Pride, that makes appropriate the things God has given to be ours, we hear people say / no one can tell me how to use my money/...that Word /my/ is a dangerous word ! True humility flows from the understanding that all we have is a gift of God ! The scripture testifies thus;  <br>  <br> Ecclesiastes 5:19 KJV <br> /Every man also to whom God hath given riches and wealth, and hath given him power to eat thereof, and to take his portion, and to rejoice in his labour; this is the gift of God./  <br>  <br> When you understand that all you have is a gift of God, you will be submissive to his instructions on how and when he want to use what He has given to you !  <br>  <br> Now what is tithe? It’s a tenth of all provision that is 10%!  <br> Let's also be clear , You cannot say you are giving  your tithe 20% or 50 % , if you give 50% of your income your tithe is 10% and these rest 40% is free will  offering !  <br>  <br> Tithes also is an expression of your submission to the authority of God , gentile nations gave their tithe to their king ! That's what Samuel the Prophet explained to the Israelites when they demanded a king!  <br>  <br>  1 Samuel 8:15,17 KJV <br> /And he will take the tenth of your seed, and of your vineyards, and give to his officers, and to his servants. [17] He will take the tenth of your sheep: and ye shall be his servants./  <br>  <br> Now whom you give your tithes to, is whom you serve!  <br> Refusal to give your tenth to the king is symbolic of rebellion!  <br>  You cannot say because the king is very rich you will not give you tithes to him, no its wrong! Like some of us say, I cannot give my tithes to a rich Pastor; I prefer to give it to the poor! Now giving to the Poor is very good, but what you give to them is not a tithe it's a free will offering!  <br>  <br> Citizens in every country pay taxes to the government through the government representatives, and they don't Pay taxes to be blessed, no its their responsibility towards their government, the government is a billion richer than those who pay tax but yet they must pay because that is the expression of their submission to governmental authority, now the government is responsible for distributing the taxes throughout the whole economy for the social amenities like roads, hospitals, security etc .  <br> The issue is we should not tell People not to tithe because Pastors are rich , we should instead teach pastors what to do with tithes !  <br> This is because your tithe is an expression of your submission to the authority of Jesus as your king!  <br>  <br> According to scriptures  before the Law of Moses tithe was given in the House of God ( Genesis 28:12) or to the priest of God ( Genesis 14: 20) but in the law, God instructed Moses how the distribution of tithes should be done !  <br>  <br> Deuteronomy 14:22-29 KJV <br> /Thou shalt truly tithe all the increase of thy seed, that the field bringeth forth year by year. [23] And thou shalt eat before the Lord thy God, in the place which he shall choose to place his name there, the tithe of thy corn, of thy wine, and of thine oil, and the firstlings of thy herds and of thy flocks; that thou mayest learn to fear the Lord thy God always.  <br>  [24] And if the way be too long for thee, so that thou art not able to carry it; or if the place be too far from thee, which the Lord thy God shall choose to set his name there, when the Lord thy God hath blessed thee:  <br>  [25] Then shalt thou turn it into money, and bind up the money in thine hand, and shalt go unto the place which the Lord thy God shall choose:  <br> [26] And thou shalt bestow that money for whatsoever thy soul lusteth after, for oxen, or for sheep, or for wine, or for strong drink, or for whatsoever thy soul desireth: and thou shalt eat there before the Lord thy God, and thou shalt rejoice, thou, and thine household,  <br> [27] And the Levite that is within thy gates; thou shalt not forsake him; for he hath no part nor inheritance with thee.  <br> [28] At the end of three years thou shalt bring forth all the tithe of thine increase the same year, and shalt lay it up within thy gates:  <br> [29] And the Levite, (because he hath no part nor inheritance with thee,) and the stranger, and the fatherless, and the widow, which are within thy gates, shall come, and shall eat and be satisfied; that the Lord thy God may bless thee in all the work of thine hand which thou doest./  <br>  <br> We see here that God was emphasizing on tithing and not Introducing tithing for it was practiced before Moses came , here God showing Moses how to command the Priest to distribute the tithes less they take advantage an enrich themselves at the detriment of the needy !  <br> But it is important to note that God is the one who choose where we should give our tithes , it is arrogance to choose where to give your tithes ! In this particular scripture God ordained his House as the place where the tithe should be brought whether for celebration or for distribution it had to be brought to the house and the Priest is the one who has ordained to receive the tithes and ensure distribution!  <br>  <br> Now Christianity is a relationship with God and if by Fellowship you were Instructed by the Holy  Spirit to give your tithes to a certain orphanage and you do not obey and you bring and give it to your Priest you may be wrong! And also if you just decide on your own to start giving your tithes to an orphanage when God has not commanded you so then you may be wrong also! This may be spiritual arrogance, spiritual arrogance is choosing how to obey the instructions of God !  <br>  <br> Unless by instruction of the Holy Spirit , you should bring your tithes to the house of God and give it to the Priest of God who should now ensure distribution of the tithe to the Welfare of the Pastors , needy , the widow and the Maintenance of the House of God ! And also the spreading of the kingdom of God! So I believe that rather than teaching Christians not to give their tithes we should teach Pastors what to do with tithes so they do not take advantage of the meekness of the sheep! There is so much to say on this issue but Its better you pray and ask God and The Holy Spirit will teach you through the scriptures and Instruct you on what to do!  <br> Great Grace",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 27,
          "title": "Question: Good day Sir, I love football but sometimes I have this fear in me that football can take me away from the Lord Jesus because of the kind of Passion I have for it, please I want to ask sir, is Football godly or worldly?",
          "headerText": "Is Football godly or worldly?",
          "content": "Answer: This question raises an important point regarding the subtle strategies through which the devil appeals to the world and how the Babylonian system has enslaved humanity. Let me begin by addressing the scriptural perspective on sports. <br>  <br> According to 1 Timothy 4:8 (KJV), bodily exercise is beneficial to some extent, but godliness is profitable for all things, in this life and the hereafter. The Holy Spirit approves of bodily exercise as it contributes to physical health and can even be financially rewarding for those pursuing a career in sports.  <br>  <br> Having established that God is not against sports, including football, it is important to recognize that football, like any other natural activity, can be subject to spiritual influences. The main issue with football today lies in the spirit that influences it. The character of an activity reveals the spirit behind it. If an activity does not promote or enhance righteousness, it is not under the influence of the Holy Spirit.  <br>  <br> Jesus spoke about the ministry of the Holy Spirit in John 16:8, 14 (KJV) when He said that the Spirit would convict the world of sin, righteousness, and judgment. We can discern the presence of the Holy Spirit in an activity by assessing whether it promotes the righteousness of God. Furthermore, an activity that glorifies the Lord Jesus is under the influence of the Holy Spirit. Therefore, we must examine whether football activities truly glorify the Lord Jesus or instead exalt and idolize human beings, thus magnifying the flesh.  <br>  <br> Football, which initially started as a neutral activity for exercise and pleasure, has been exploited by Satan, the god of this world, to deceive and corrupt many, leading them away from the Lord Jesus. Satan has established a worldly system that turns people's hearts away from loving the Lord and towards loving the world. Scripture emphasizes that the whole world lies under the power of the Evil One (1 John 5:19, KJV), and Satan blinds the minds of unbelievers so that they do not perceive the light of the glorious gospel of Christ (2 Corinthians 4:4, KJV).  <br>  <br> It is crucial to remember the admonition in 1 John 2:15-16 (KJV) not to love the world or the things in it. Loving the world and its pursuits, characterized by the lust of the flesh, the lust of the eyes, and the pride of life, does not originate from the Father but from the world.  <br>  <br> Now, let's consider what exists in the world and compare it to football:  <br>  <br> 1. The Lust of the Flesh: It is noticeable today that betting companies have increased, and even Christians are engaging in betting on football matches. Even if they lose money, they are tempted to continue betting. Their flesh desires the potential gains.  <br>  <br> 2. The Lust of the Eyes: This is evident, especially when a football match is taking place, particularly if it involves the national team. People become engrossed in watching the match, and some are willing to pay significant sums for tickets to enter stadiums. Football becomes a visual temptation, with people staying up all night to watch matches, traveling from one nation to another to witness games. Some individuals even check scores during church services.  <br>  <br> 3. The Pride of Life: This is the pinnacle of football today. Conversations about football often revolve around who is the greatest or the best. Footballers are being exalted and glorified, even by Christians. It is shameful for a Christian to acknowledge someone other than Jesus Christ as a /god./ While Scripture mentions believers being called /gods,/ it refers to those who are born of Almighty God, not in terms of personal achievements. We are not gods because of what we have done; we are gods because we are born of God through the ministry of Jesus Christ. When a player is called the /god of football,/ it implies that Jesus Christ is not the God of football. Football is saturated with the Pride of Life, to the extent that humans have become idols to other humans. However, God explicitly warned against having idols, as John the Apostle stated: /Little children, keep yourselves from idols/ (1 John 5:21, KJV).  <br>  <br> Scripture instructs us to stay away from idols, and yet football is a system that creates idols. People claim that certain players are their idols, which is a manifestation of the Pride of Life. Additionally, there is a term called /GOAT,/ which stands for /Greatest Of All Time./ This is a great deception. Let's turn to scripture to understand what goats represent. In Scripture, goats represent rebels and the disobedient. In Matthew 25:32-33, it is written: /And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: And he shall set the sheep on his right hand, but the goats on the left./ Furthermore, all the goats were sent to the lake of fire, as stated in Matthew 25:41: /Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels./  <br>  <br> Notice that goats are referred to as the cursed ones and as messengers of the devil. As Christians, we should not use terms as the world does. We must seek the mind of God, which is revealed in Scripture. If Scripture refers to /goats/ as rebels, we should not reinterpret it to mean /Greatest Of All Time./ This is a worldly deception. Moreover, to truly understand the symbolism of goats, we must recognize its occult origin. In occultism, the goat is a symbol of Satan, the great rebel and disobedient one. In many movies and music, you will see the goat head symbol, which represents the devil. So, this labeling of /goat/ is demonic. When you call someone the /god of football/ or the /goat of football,/ you are essentially saying that they are messengers of the devil in football. How many of these individuals whom you call goats or gods of football have openly glorified or recommended the Lord Jesus? Instead, we see them supporting demonic agendas. Today, youths no longer consider Elijah, Moses, Joseph, or Daniel as role models; instead, they choose individuals who are not born again and do not acknowledge Jesus as their models. People now fight, insult, and become enemies because they have differing opinions on who they believe is the best player.  <br>  <br> Now, let's conclude by discussing the Pride of Life in football and the significance of the trophies awarded in competitions such as the World Cup, African Nations Cup, European Nations Cup, and Champions League. Have you ever considered the nature of the reward given to the winners? It is a trophy, often made of gold, and the winners are known to kiss it. But where does this practice of kissing gold objects come from?  <br>  <br> In Hosea 13:1-2 (KJV), it is written: /When Ephraim spake trembling, he exalted himself in Israel; but when he offended in Baal, he died. And now they sin more and more, and have made them molten images of their silver, and idols according to their own understanding, all of it the work of the craftsmen: they say of them, Let the men that sacrifice kiss the calves./  <br>  <br> Do not be deceived, the trophy given to the winners is an idol. How do you know it's an idol? Because it is worshipped. Remember the golden image in the Book of Daniel? In Daniel 3:4-5 (KJV), it is commanded: /That at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, dulcimer, and all kinds of music, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up./  <br>  <br> The golden image in Daniel was meant to be worshipped by all nations. When a nation wins the trophy, public holidays are declared, and the trophy is paraded from town to town, attracting millions of people who come to see, touch, and kiss it. Have you ever wondered why players always kiss their trophies? In the past, kissing an idol was a way of pledging allegiance to it.  <br>  <br> Therefore, football promotes the Pride of Life. Think about it: when you hear that a player has been bought for 100 million euros, is all that money simply for kicking a ball? No, it goes much deeper than that. These men are messengers of the Babylonian system. Some of them have contracts that forbid them from openly praising the Lord Jesus. Moreover, some of the gestures and signs made by footballers when they score are actually demonic symbols. Innocent youths imitate these signs, unknowingly becoming initiated into demonic worship.  <br>  <br> Now, with this understanding, the question arises: Can a Christian be a professional footballer? Yes, it is possible, but such a person must submit themselves to be properly discipled in the doctrine of Christ and the ways of God. Otherwise, they may be led astray by the money and glory that football offers, forgetting that their primary assignment is to be a light in the football system and turn footballers to the Lord Jesus. All Christians have one assignment, regardless of their profession or location, and that is to reveal the Lord Jesus and lead many to Him. The skills and talents given by God are meant to be instruments of His glory.  <br>  <br> For those who love football, I advise you to be cautious. Anything you love can become a snare to your soul if it is not centered on the Lord Jesus. You can watch and discuss football, but make sure you don't give yourself completely to that passion, or it will take control of your time, strength, and money. Remember what Apostle Paul said in 1 Corinthians 6:12: /Everything is permissible for me, but not everything is beneficial. Everything is permissible for me, but I will not be mastered by anything./  <br>  <br> As a Christian, make the Lord Jesus famous. Let your Facebook page and WhatsApp status be dedicated to making Jesus famous. If you do post about footballers, only share the ones who publicly praise the Lord Jesus. Do not boast about those who are ashamed of Him before men.  <br>  <br> Brethren, these are the last days, and the great war between light and darkness has begun. Unless we are spiritually discerning and sensitive, we will be deceived. As Scripture warns, Satan, the prince of darkness, disguises himself as an angel of light. Some may argue that terms like /goat/ mean /Greatest Of All Time/ or that calling someone the /god of football/ is not meant literally but as an honorific. However, we are instructed to abstain from all forms of evil (1 Thessalonians 5:22).  <br>  <br> We should be sensitive and not deceive ourselves by using names or supporting teams that carry demonic connotations. Terms like /Red Devils/ or teams with dragon symbols are associated with darkness and satanic imagery. Let us not call evil good and good evil, darkness light and light darkness, as warned in Isaiah 5:20.  <br>  <br> In these last days, seek the truth by committing yourself to fellowship with the Lord through prayer in the Spirit and meditation on the Scriptures. Remember to prioritize making Jesus famous and sharing the message of salvation with others.",
          "picture": "image4.jpg",
          "date": "2024-01-26"
        },
        {
          "id": 28,
          "title": "Question: Good Morning Sir, please whats Your Opinion concerning Miracle Money, is it real or fake? ",
          "headerText": "What's Your Opinion concerning Miracle Money, is it real or fake?",
          "content": "Answer : First of all, I want to emphasize that my opinion is of no spiritual weight if it does not agree with the opinion of God as revealed in the scripture, and therefore as a Prophet of the Lord, I have no opinion apart of that which is revealed through the scriptures and the Spirit. The opinion of God is what stands because he is the author of all things and He is Sovereign. <br> <br> Now, the opinion of God is found nowhere else but in the scriptures. You don't need to ascend into heaven to know the opinion of God, all you have to do is to search the scriptures, for the Major relevance of the scriptures is that it captures the opinion of God concerning all creation in all dimensions. <br>  <br> So with this understanding it is clear we should examine and judge every manifestation in the light of the scriptures and not our understanding. <br>  <br> The ways of God are past finding to the Carnal Man, it is written in 1 Corinthians 2:14, /the Natural Man cannot receive the things of God for they are spiritually discerned. The scripture goes ahead to emphasize that unto the natural man spiritual things are foolishness. This means that when you try to describe or understand a supernatural occurrence by your intelligence, it will appear as foolishness, the things are of the Spirit are so deep, so deep that it cannot be understood by the intellectual faculties. <br>  <br> Now having explained this, let me talk about the issue of Miracle Money. It all depends on what we mean by Miracle Money; <br> Firstly a Miracle can be defined as an extraordinary or supernatural occurrence that confounds intellectual understanding and defies physical laws. So A Miracle is the occurrence provoked by the intervention of God through the Faith of Man, that's why Ishmael was not a Miracle but Isaac was a miracle this is because Abraham did not Believe God to have Ishmael but he believed God to have Isaac. <br>  <br> And secondly money is defined as a commodity accepted by general consent as a medium of economic exchange. <br> <br> So this means Miracle Money is the supernatural supply of Money, and this supply is beyond intellectual understanding and physical laws. Miracle Money is money received through Faith in the Power of God. <br>  <br> The Reason why many people doubt if Miracle Money is real is because it does not make sense to their intellectual faculties. Now, the scriptures declare that /unto the Natural Man, spiritual things are foolishness,/ this is because he cannot explain them by natural laws and physical procedures. Once you can explain a miracle by any other law but Faith, then it was not a miracle. The Only Law or means by which we can understand the Supernatural and comprehend Miracles is through Faith, for it is written in Hebrews 11:3, <br> Through faith we understand that the worlds were framed by the word of God, so that things which are seen were not made of things which do appear. <br> <br> Now this is very clear now, there is no physical way to explain or understand how the world was framed apart from Faith, scientists who attempted to explain creation by physical laws, introduced a foolish theory called Big Bang Theory, where they claimed that there is no God Creator instead the earth and all life came into being by an explosion... What foolishness!!! Man denying the existence of God, not knowing that if the creation doubts the existence of its Creator, then the Creation is also doubting it’s own very existence. <br>  <br> This is what happens to people who try to explain Miracle Money by physical Laws, you hear questions like; <br> Where does the money come from? <br> What a spiritually foolish question! <br> Is the Hand of the Lord Short? <br> Do we no longer Believe that with God All things are Possible? <br> What is the meaning of ALL THINGS? All as in /ALL/.  <br> Now, let's search the scriptures, we start with this... <br>  <br> 1 Kings 19:5-8 KJV <br> And as he lay and slept FCC under a juniper tree, behold, then an angel touched him, and said unto him, Arise and eat. <br> [6] And he looked, and behold, there was a cake baken on the coals, and a cruse of water at his head. And he did eat and drink, and laid him down again. <br>  [7] And the angel of the Lord came again the second time, and touched him, and said, Arise and eat; because the journey is too great for thee. <br>  [8] And he arose, and did eat and drink, and went in the strength of that meat forty days and forty nights unto Horeb the mount of God. <br> <br> Now the question is this where did the Angel take that cake from ? Can that be explained? <br> Take note it was not a dream, Elijah ate that Cake physically... <br> Let's see another account, <br>  <br> John 6:9-13 KJV <br> There is a lad here, which hath five barley loaves, and two small fishes: but what are they among so many? [10] And Jesus said, Make the men sit down. Now there was much grass in the place. So the men sat down, in number about five thousand. <br>[11] And Jesus took the loaves; and when he had given thanks, he distributed to the disciples, and the disciples to them that were set down; and likewise of the fishes as much as they would. <br>  [12] When they were filled, he said unto his disciples, Gather up the fragments that remain, that nothing be lost. <br> [13] Therefore they gathered them together, and filled twelve baskets with the fragments of the five barley loaves, which remained over and above unto them that had eaten. <br> <br> Now these stories are Intellectually senseless, how can five loaves or bread be used to feed 5000 Men, how come in the basket they were only 5 loaves and yet 5000 people ate until after all have eaten, they were 12 basket full ? <br> Where did the bread come from ? <br> <br> For those who Say, Miracle Money is fake because God does not Print Money, God is not a bank, my question is this, id God a baker ? How did he bake bread to feed 5000 Men? If God can bake bread to help you meet needs can't he print Money to help you meet your needs? <br>  <br> Let's see another account again; <br> <br> John 21:5-10 KJV <br> Then Jesus saith unto them, Children, have ye any meat? They answered him, No. <br>  [6] And he said unto them, Cast the net on the right side of the ship, and ye shall find. They cast therefore, and now they were not able to draw it for the multitude of fishes. <br> [7] Therefore that disciple whom Jesus loved saith unto Peter, It is the Lord. Now when Simon Peter heard that it was the Lord, he girt his fisher's coat unto him, (for he was naked,) and did cast himself into the sea. <br> [8] And the other disciples came in a little ship; (for they were not far from land, but as it were two hundred cubits,) dragging the net with fishes. <br> [9] As soon then as they were come to land, they saw a fire of coals there, and fish laid thereon, and bread. <br> [10] Jesus saith unto them, Bring of the fish which ye have now caught. <br>  <br> We see two miracle systems of provisions here, Firstly provisions that is released by an obedience to a Divine instruction, this is the Major way God intends to supply the needs of his people but also we see something, before they could even arrive the shores, they met fire coals with fish being roasted and already baked bread. My God! Now my question is this, where did Jesus take the fish and bread from? Is it physical or spiritual bread? Remember, this is Jesus when he arose from the Dead meaning he is in the fullness of His immortality. <br> Then Jesus said something to them; Come and Dine! Now this is it, He wanted to show them He is able to prepare all things for them by his power, yes! God can prosper you through an instruction which when obeyed will bring money and that is also miracle money, because Miracle Money may not be instant, Miracle Money may involve you to labour, offer services or selling of goods as along what you doing to get the Money is buy divine instruction then your salary or profit is Miracle Money, for example see this; <br>  <br> Matthew 17:27 KJV; <br> Notwithstanding, lest we should offend them, go thou to the sea, and cast an hook, and take up the fish that first cometh up; and when thou hast opened his mouth, thou shalt find a piece of money: that take, and give unto them for me and thee. <br>  <br> Now, you see that for this miraculous provisions, the Lord gave an instruction that employs Peter's skill which is fishing to make money, the question is what is a coin doing in the mouth of the fish? <br> We may say maybe a sailor lost money in the sea and  the fish swallowed the coin but now next question amongst all the millions of fishes in the sea, how come that is the fish that Peter caught? <br> Next question how did Jesus know that the first fish would have coin in its mouth? <br> Who put that coin in the mouth of the fish? Was it an angel? JESUS was so sure that he instructed Peter to use a hook and not a net because if he used a net he would catch many fishes and will not know which one was the first, so Jesus told Peter get a hook because the first fish you catch will make you wealthy. Now, this is Miracle Money. By a divine instruction God can cause you to prosper and make wealth in businesses and places where it was otherwise impossible to make wealth, God may show you a business by revelation and it may not make sense to your mind but if you obey the instructions, you will prosper. If Peter where to reason what Jesus said intellectually, he would argue, Sir how can a fish have a coin in its mouth or Sir how do you know the first fish will have a coin, but Peter knew with God all things are Possible and also unto he who believes nothing shall be impossible! This too is Miracle Money! <br> <br> But now there is another system of Miracle money which involves nothing on the part of man but his faith, where God commands his angels to come and put money in your account, or in your pocket or cause money to multiply, yes it happened with bread so it can happen with money, this one is unexplained but this is a sign of the willingness and the ability of God to prosper his people. <br>  <br> To conclude, let me explain two other systems through which Miracle Money can be gotten ! <br>  <br> From scriptures we understand that favor is another system through which Miracle Money can be received, see this; <br> <br> Exodus 3:21-22 KJV <br> And I will give this people favour in the sight of the Egyptians: and it shall come to pass, that, when ye go, ye shall not go empty: <br>  [22] But every woman shall ask of her neighbour, and of her that sojourneth in her house, jewels of silver, and jewels of gold, and raiment: and ye shall put them upon your sons, and upon your daughters; and ye shall spoil the Egyptians. <br>  Now we see here that God made his people rich by granting them favor. Favor is what makes the hearts of men favorably disposed towards you, meaning when you are favored, people give to you, even your enemies. This means a Minister of God can pray for favor and God employs the system of favor to supply Miracle Money, and thus he touches the hearts of Men to send Money to the people who he has favored, and that’s when you see people having mobile money alerts in their phones sent by Men, those men would not have sent that Money if not of the intervention of God through the his gift of Favor. <br>  <br> Also there is another way which God uses to supply Miracle Money to his people and truth is this, it is the most common way that God uses but it is the most despised because it is not as spectacular as the other systems, let's see it in scriptures; <br> <br> Genesis 26:12-13 KJV <br> Then Isaac sowed in that land, and received in the same year an hundredfold: and the Lord blessed him. <br> [13] And the man Prospered, and continued to Prosper , and grew until he became very Prosperous. <br> Now this system is called the Blessing. The scriptures testify thus; <br> <br> Proverbs 10:22 KJV <br>The blessing of the Lord, it maketh rich, and he addeth no sorrow with it. <br> Now Isaac sowed, but he reaped a hundred fold, this now is impossible to men. In this system of Miracle Money, God sends his blessings to amplify that fruits of your labour and increase your harvest abundantly. Meaning a business which should yield 10,000, yields 1,000,000, most often people do not recognize this miracle money because they think it's their labour, make no mistake, it's not your labour. If acrording to economic laws you invest 10,000 units you should be making profits of around 1000 units but now if you invest 10,000 units and you are making profits of 100,000 units then 1000 normal profits while 99,000 is Miracle Money. <br> The mistake we make often as Christians is that when we receive prayer for Miracle Money, we think only on the system where God puts the money or multiplies it in our pocket supernaturally or the system where God by the gift of favor makes someone send you money, so after prayers of Miracle Money, if we check our pockets and our phones and do not see any money or mobile money alerts we think that God has not answered us not knowing that there are two other ways, either God has filled your mind with the Spirit of wisdom and Revelation that will give you ideas of business through which you will prosper or he has send his blessings upon the work of your hands to amplify and increase your harvest abundantly. <br> <br> All in all, we must never doubt the willingness and ability of God to supply the needs of His people, God is a good Father and as a good Father, he gives good gifts, he cares about his children and he desires to meet their needs by any means fitting to him. We should avoid putting God in a box that fits well into our intellectual ideology. <br>  <br> There was Famine in the Land caused by Elijah and he was hungry, God did not ask him to go and look for a Job, God commanded a raven to bring him food daily, now does that make sense? Where did the raven take the bread from? <br>  <br> With God, all things are Possible, God being a good and compassionate Father wants to supply the needs of his people, this Jesus proved after preaching for 3 days and people where hungry he did not say go and look for a Job and then work and buy food to eat, he showed the compassion of God by miraculously supplying them bread to eat. <br> <br>/There is more to say on this subject but I end here, whatever you need to know more about this, the Holy Spirit himself will give you understanding but above all, trust and depend on God to meet your needs and prosper you for He is your Father. <br> Great Grace  <br> The Priest of God",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 29,
          "title": "Question: sir, what do you think about the subject of Honorarium? ",
          "headerText": "What do you think about the subject of Honorarium?",
          "content": "Answer: I have received a lot of questions on our counseling number in regards to the subject of Honorarium and by the grace and wisdom given to me by God, this is my take on the subject. <br>  <br> Firstly, we must understand that Honorarium is a system to communicate honor; scriptures recommends us to communicate our honor, it is written; <br>  <br> Luke 10:5-8 KJV <br> And into whatsoever house ye enter, first say, Peace be to this house. <br>[6] And if the son of peace be there, your peace shall rest upon it: if not, it shall turn to you again. <br> [7] And in the same house remain, eating and drinking such things as they give: for the labourer is worthy of his hire. Go not from house to house. <br> [8] And into whatsoever city ye enter, and they receive you, eat such things as are set before you: <br> <br> Notice you receive Ministers of God by giving to them and not just in words, true honor is communicated in substance as scriptures says: <br> <br> Proverbs 3:9 KJV <br> Honour the Lord with thy substance, and with the firstfruits of all thine increase: <br> <br> If the Lord Himself should be honored by substance how much more is it right to honor His servants with your substance! <br> <br> It's true it's not about money, it's true we receive freely and are called to give freely but it's also true that there is cost to give, so when someone comes to minister to you and give you Spiritual substance, it has costed him time, strength, resources! <br> More so Apostle Paul establishes this principle in this scripture; <br> <br> 1 Corinthians 9:11 KJV <br> If we have sown unto you spiritual things, is it a great thing if we shall reap your carnal things? <br> <br> You see it is recommended of scriptures that you reciprocate the release of Spiritual substance by the release of physical substances! <br> <br>  When you invite a Minister of God, prepare the substance you will use to communicate you honor to him for the Grace of God bestowed upon him; this is a proof of your reverence and honor for the God in him! <br> We Must never trivialize results, when a Man is excelling in a certain Grace in Christ, it's true it's the gift of the spirit but without his sacrifice of alignment he will not excel in that gift, we Must never despise, undermine nor overlook the exploits that men do through Faith in God, if it was that easy we all will be doing same ! <br> The greatest responsibility of a host is to communicate honor to his guest. And what you use and how you do is a true proof of the honor you have for your guest. <br> Many at times some people run behind a Minister for him to come and Minister for them, they call him and text him for months, and then he finally accepts to come and then when he comes and  Minister for them, after ministrations, they don't bother to even call or text again even to appreciate him for coming. <br> As he leaves the program, he does not hear from you again, others will not even give any honorarium and they will tell the guest I will call you after or I will come and see you later, some will bring some honorarium that does not even cover the transportation cost of your guest, and will give and say, this is just for fuel, or for credit! That's very dishonorable. <br> Now it’s not about Money, freely we received, freely we are called to give. But when someone ministers for you, what you give him is not to pay him for the gift of God in his life, it's in recognition of his sacrifice for you, imagine a Minister travelled to come and minister, risking his life ( in case of accidents), he comes and ministers for you, sometimes your sound is not very good so he stresses his vocal chords and throat in ministration, more so what about the activities he had to forgo to come Minister for you, so your honorarium is a proof that you recognize his sacrifice for you! <br>   <br> When you invite someone you must avoid being selfish and self-centered, don't only think how the program will profit you, think about what he will lose because of the program! <br> Most times we invite a guest and overwork them, refusing them even the luxury of rest, we want them to minister morning and evening, we want them to minister in Church until they are drained, this is selfishness, its true you need the grace God has given to him, but truth is, no matter how he ministers in the absence of honor the grace will not find expression into your ministry! <br> <br> When you invite a Minister, his welfare should be your priority! Prepare what you will give him to eat and drink, (even if your church is fasting for the program don't impose fasting on your guest). <br> Have good cooks to prepare food, fruits and fruit juice for him and make it available on time. <br> After his ministrations, he should not go and wait for food, don't call him and tell him my daughter is bringing the food, No, if you are married, your wife should personally oversee his feeding, before he finishes preaching the food should be waiting for him! <br> After every session of his ministrations, send a message to appreciate him for that session and also to ensure if he is comfortable and if there is anything you can do to make his stay more comfortable! <br> <br>And when he is done ministering, communicate your honor for him immediately both in words and substance, and to avoid finding yourself in a situation where you will not be able to communicate your honor accordingly in substance, it is advisable to prepare what you will give before the program, don't depend on offerings of the program, it may fail you woefully, don't also invite your guest and put him under pressure to raise money for the program. <br> Conferences and crusades are to raise men not to raise money, prepare yourself spiritually, financially and physically before organizing a program and inviting a guest, Remember don't only think about what you will gain because of the conference think about what your guest minister will lose to meet up with your program! <br> <br> Finally, above all, build relationships with men so you will avoid saying they are proud or too demanding, there are Men that God has lifted to dimensions of glory, even if he chooses to minister for you, don't take it for granted! <br> Refuse to become familiar with a grace you admired after they have ministered for you, the same way you sent them messages night and day to plead with them to come so should you send them messages night and day to thank them for coming. <br> <br> While it is true that some have abused this principle and turned the work of God into a business transaction where they argue and impose certain amounts before they move, this should not discourage us of practicing it because it is good and right in the sight of the Lord to honor his servants with our substance. <br>",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 211,
          "title": "Question: Good day, Prophet. My heart is heavy because of the many failures I have experienced in life. My seeking of God seems to be in vain because I'm yet to see the manifestation of God, although I have received many prophecies and even visions. Due to the delay in fulfillment, I am now discouraged to even continue with spiritual activities. Please, how can I handle this? Thank you, Sir.",
          "headerText": "How can I Habdle Discouragement?",
          "content": "Answer: This question is very important because the answer will address one of the most fundamental challenges that all men face. Let me begin by stating that Christianity is not a means to escape the troubles of this world, as the Lord Himself said: <br> <br> John 16:33 (KJV) <br>/These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world./ <br> <br>Many Christians have a misconception on this subject, which is why they are easily deceived by Satan into thinking that their trials mean that God hates them. However, scripture reveals that even the one whom Jesus loved was sick (John 11:3-4). When the devil manipulates you to perceive your trials and temptations as proof of divine hatred, he will turn your heart away from God and fill your heart with ingratitude and your mouth with complaints. Complaints in the mouth are a symptom that the heart is full of discouragement, as it is written: <br> <br> Numbers 21:4-5 (KJV) <br> /And they journeyed from mount Hor by the way of the Red sea, to compass the land of Edom: and the soul of the people was much discouraged because of the way. [5] And the people complained against God, and against Moses, 'Wherefore have ye brought us up out of Egypt to die in the wilderness? for there is no bread, neither is there any water; and our soul loatheth this light bread./ <br> <br> Now it is clear that discouragement is the evil spirit Satan assigns to make men deny God through their words or their works. We must be conscious that every trial and temptation is a strategy by Satan to discourage the faith of men in God and even prompt doubt in the love of God. This is what happened to the Israelites. For instance: <br> <br> Deuteronomy 1:27: /You complained in your tents and said, 'The LORD must hate us. That's why he has brought us here from Egypt—to hand us over to the Amorites to be slaughtered./ <br> <br> You can see that, due to their trials, they were deceived by Satan into thinking that God hated them. This is exactly how Satan operates—through his evil schemes and operations, he causes trials in your life and then fills your heart with thoughts as though God hates you. Always remember that the purpose of Satan in every trial, temptation, trouble, and tribulation is to give men a reason to deny God. You can hear it from his own mouth: <br> <br>Job 1:9-11 (KJV) <br>/Then Satan answered the Lord, and said, 'Doth Job fear God for nought? [11] But put forth thine hand now, and touch all that he hath, and he will deny you to thy face./ <br> <br> Now I want you to understand that discouragement is not just a feeling; it is a spirit. It is one of the high-ranking evil spirits and one of the most deceptive and wicked demons of Hell. Whenever you feel discouraged, be aware that you are in a great spiritual warfare, and the devil is contending for your soul. <br> <br> You must treat discouragement as you treat the devil because it is his servant. Discouragement, together with fear, are the most effective demons that Satan employs in his battle against the saints because they are subtle and operate silently, manipulating your hearts into sorrow and bitterness through evil voices that lodge in your heart as ideas. When you sense discouragement, know that Satan has come for you. Resist and rebuke it in the name of the Lord. <br> <br> You must understand that what threatens Satan when he looks at men is not what they have done, but what they will do. Satan is threatened by the purpose of God attached to men, and the greatest spirit that hinders men from fulfilling the purpose of God is discouragement. See what is written: <br> <br> Isaiah 42:1,4 (KJV) <br> /Behold my servant, whom I uphold; mine elect, in whom my soul delighteth; I have put my spirit upon him: he shall bring forth judgment to the Gentiles. [4] He shall not fail nor be discouraged, till he have set judgment in the earth: and the isles shall wait for his law./ <br> <br> You can see that the Lord, speaking of His servant, said he shall not be discouraged until he has fulfilled his purpose. This is exactly what God instructed Joshua when He called him to lead the people into the Promised Land: <br> <br> Joshua 1:6-7,9 KJV <br> /Be strong and of good courage, for unto this people shalt thou divide for an inheritance the land, which I sware unto their fathers to give them. Only be thou strong and very courageous, that thou mayest observe to do according to all the law, which Moses my servant commanded thee: turn not from it to the right hand or to the left, that thou mayest prosper whithersoever thou goest. Have not I commanded thee? Be strong and of good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest./ <br> <br> Notice that the Lord said thrice, /Be courageous!/ You see how the Lord was preparing Joshua to fulfill his purpose by warning him against giving in to discouragement. Joshua had a great task ahead of him, and the devil would try to hinder him from fulfilling it. The greatest strategy of Satan would be to use the challenges Joshua would go through to try to discourage him. <br> <br> Now, what God told Joshua is what He tells us all today: /Be strong and be courageous!/ How can we be courageous? The answer is in the scriptures. <br> 1 Samuel 30:6 KJV <br> /And David was greatly distressed; for the people spake of stoning him, because the soul of all the people was grieved, every man for his sons and for his daughters: but David encouraged himself in the Lord his God./ <br> <br> When David's wife and daughters were kidnapped, David encouraged himself in the Lord. This was done by meditating on scriptures. Often, when we are discouraged, we begin to seek signs from God through dream or other means. But this is wrong and may lead to more deception. The only encouragement that God gives us is through His Word. <br> <br> For example, when John the Baptist was locked up in prison and became discouraged, he sent his disciples to Jesus. Let's see what happened: <br> <br> Matthew 11:1-6 KJV <br> /And it came to pass, when Jesus had made an end of commanding his twelve disciples, he departed thence to teach and to preach in their cities. Now when John had heard in the prison the works of Christ, he sent two of his disciples and said unto him, Art thou he that should come, or do we look for another? Jesus answered and said unto them, Go and shew John again those things which ye do hear and see: The blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the gospel preached to them. And blessed is he, whosoever shall not be offended in me./ <br> <br> After John's disciples left, Jesus said something significant: <br> <br> Matthew 11:11 KJV <br> /Verily I say unto you, Among them that are born of women there hath not risen a greater than John the Baptist: notwithstanding he that is least in the kingdom of heaven is greater than he./ <br> <br> Jesus did not send a message to John saying, /You are the greatest and most powerful prophet./ Many Christians expect God to encourage them in that way, asking questions like, /Am I still Your child? Do You still love me, Lord? Show me a sign!/ They are expecting a voice to speak from heaven or an angel to appear with a thunderous voice saying, /You are My very own child./ But that may or may not happen. Instead, when God wants to encourage us, He leads us to scriptures. <br> <br> The answer that the Lord sent to John was from the Book of Isaiah, where it is written; <br> <br> Isaiah 35:4-6 KJV <br> Say to them that are of a fearful heart, Be strong, fear not: behold, your God will come with vengeance, even God with a recompence; he will come and save you. [5] Then the eyes of the blind shall be opened, and the ears of the deaf shall be unstopped. [6] Then shall the lame man leap as an hart, and the tongue of the dumb sing: for in the wilderness shall waters break out, and streams in the desert. <br> <br> The Lord referred John to this scripture speaking of what will happen when the Messiah comes, for whom John himself was sent to prepare the way, John was familiar with the writings of Isaiah so much that when the Pharisees asked who he was he answered them by quoting From Isaiah saying ; <br> <br> Isaiah 40:3 KJV <br> The voice of him that crieth in the wilderness, Prepare ye the way of the Lord, make straight in the desert a highway for our God. <br> <br> You see thus the Lord Sent John to scriptures to encourage him so that his faith might stand on the Word and not on signs. The only way to handle discouragement is to go back and meditate on scriptures. Don't ask for a sign or ask God to prove anything to you, for that would be unbelief. If you search the scriptures, you will realize that discouragement is a demon that often comes after great men and women of faith. It came after Moses (Numbers 11:15), Elijah (1 Kings 19:4), and even Jesus (Matthew 26:38-39). <br> <br> However, they did not give in to discouragement. When the demon of discouragement came against Jesus, He prayed even more and encouraged Himself with the Word of God, saying, /Let the will of God be done!/ <br> <br> God does not always give us miracles to encourage us because if He did, we might become more focused on miracles  than the His word and be easily deceived. Instead, God gives us His Word as a source of encouragement. Nehemiah 8:10 says, /Then he said unto them, 'This day is holy unto our Lord: neither be ye sorry; for the joy of the Lord is your strength./ <br> <br> When you become discouraged, search for scriptures and not rely solely on your feelings. Resist the feeling of discouragement with scriptures, because most often the ideas that lead men into discouragement are lies from Satan, he uses our circumstances to project ideas that makes us doubt the Love of God, the willingness of God and even the Faithfulness of God! And as Jesus taught us through his own temptation, the most effective weapon against Satan is what is written! <br> <br> If You are discouraged, and there is an idea in your Mind implying that God does want to forgive your sins, or God does not went to show you mercy remember it is written; Psalm 86:5  <br> For thou, Lord, art good, and ready to forgive; and plenteous in mercy unto all them that call upon thee. <br>  <br> If an idea comes up in your mind implying that God is not hearing you, or he does not want to deliver you, remember it is written; <br> Psalm 34:17 KJV <br> The righteous cry, and the Lord heareth, and delivereth them out of all their troubles! <br> <br> If an idea comes up in your mind implying that God is unwilling to heal you then remember it is written; <br> Acts 10:38 KJV <br> How God anointed Jesus of Nazareth with the Holy Ghost and with power: who went about doing good, and healing all that were oppressed of the devil; for God was with him. <br> <br> We can go on and on, the Scriptures are full of wonderful truths from God that have power to destroy the lies of the devil! <br> So search the scriptures, speak the scriptures, and You will overcome!  Don't surrender to discouragement, encourage yourself in the Lord!",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 212,
          "title": "Question: Man of God, I came across this scripture in the Book of Revelation where the Lord Jesus said these words: /I know your works, that you are neither cold nor hot. I wish you were either cold or hot. Since you are lukewarm and neither hot nor cold, I am going to spit you out of my mouth./ [Revelation 3:15-16] Sir, I would like to know what it means to be lukewarm and why Jesus preferred them to be cold which I think Is bad rather than lukewarm?",
          "headerText": "What does mean to be lukewarm?",
          "content": "Answer: This is a significant question as it addresses one of the greatest issues currently plaguing the Church. The portion of scripture you refer to comes from the account of the messages that Lord Jesus sent to the Seven Churches. As the head of the Church, Jesus is deeply concerned about the state of His body, the Church. In His letters to each church, He commends them for their good works, rebukes them for their wrong works, and provides correction to help them conform to the image of Christ. <br>  <br> In our walk with God and our service for Him, it is essential to cultivate the habit of setting ourselves apart for the Lord in retreat. During these times, the Holy Spirit can reveal the counsel of the Lord to align us with His will. In these retreats, we come before the Lord to allow Him to search our hearts, ministries, and examine ourselves through the light of the Scriptures, so that we may walk before Him in perfection. It is easy to stray even while walking with God or working for Him, so we must frequently seek His counsel. <br> Now, let's examine the entire portion of Scripture: <br>  <br>  Revelation 3:14-22 (KJV): <br> 14 /And unto the angel of the church of the Laodiceans write; These things saith the Amen, the faithful and true witness, the beginning of the creation of God; <br> 15 I know thy works, that thou art neither cold nor hot: I would thou wert cold or hot. <br> 16 So then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth. <br> 17 Because thou sayest, I am rich, and increased with goods, and have need of nothing; and knowest not that thou art wretched, and miserable, and poor, and blind, and naked: <br> 18 I counsel thee to buy of me gold tried in the fire, that thou mayest be rich; and white raiment, that thou mayest be clothed, and that the shame of thy nakedness do not appear; and anoint thine eyes with eyesalve, that thou mayest see. <br> 19 As many as I love, I rebuke and chasten: be zealous therefore, and repent. <br> 20 Behold, I stand at the door, and knock: if any man hears my voice, and opens the door, I will come in to him, and will sup with him, and he with me. <br> 21 To him that overcometh will I grant to sit with me in my throne, even as I also overcame, and am set down with my Father in his throne. <br> 22 He that hath an ear, let him hear what the Spirit saith unto the churches./ <br>  <br> In this scripture, the Lord rebukes and corrects the Church of Laodicea. It is important to note that this rebuke applies to the present Church age, as we are in the era where what Jesus described has become a reality. <br>  <br> In verses 15-16, the Lord expresses His displeasure with the lukewarm spiritual state of the Church of Laodicea. It is important to interpret the various spiritual states mentioned in the light of Scripture. Some people mistakenly assume that being hot is a good spiritual state and being cold is a bad spiritual state. However, if being cold were truly a bad spiritual state, Jesus would not have stated that He preferred the church to be either hot or cold. The Lord's dissatisfaction lies with lukewarmness, not with being hot or cold. <br>  <br> Let's analyze the spiritual states mentioned: <br>  <br> 1. Hot: According to Scripture, being hot refers to a spiritual state where one is burning with zeal for the Lord. It is a state of being consumed by the fire of the Lord. In this spiritual state, one can be used by God to purify and revive others. <br>  <br> It is written; <br> Ezekiel 24:10-11 KJV <br> Heap on wood, kindle the fire, consume the flesh, and spice it well, and let the bones be burned. [11] Then set it empty upon the coals thereof, that the brass of it may be hot, and may burn, and that the filthiness of it may be molten in it, that the scum of it may be consumed. <br>  <br> An example of someone in this state is Jesus Himself when He cleansed the temple (John 2:13-17). And the Jews' passover was at hand, and Jesus went up to Jerusalem, [14] And found in the temple those that sold oxen and sheep and doves, and the changers of money sitting: [15] And when he had made a scourge of small cords, he drove them all out of the temple, and the sheep, and the oxen; and poured out the changers' money, and overthrew the tables; [16] And said unto them that sold doves, Take these things hence; make not my Father's house an house of merchandise. [17] And his disciples remembered that it was written, The zeal of thine house hath consumed me up. <br>  <br> Another example was John the Baptist, the Lord testified thus ; <br> John 5:33-35 KJV <br> Ye sent unto John, and he bare witness unto the truth. [34] But I receive not testimony from man: but these things I say, that ye might be saved. [35] He was a burning and a shining light: and ye were willing for a season to rejoice in his light. <br>  <br> Notice John was not just a shining light he was also a burning one, zealous for the Works of the Lord. <br>  <br> 2. Cold: In this context, being cold does not imply a negative spiritual state. The Lord desires the church to be in a state where they can refresh others. Just as cold water is refreshing to a thirsty soul, being cold refers to a spiritual state where one can bring refreshing to others. Scripture illustrates this concept with examples of cold water bringing refreshment; <br>  <br> Let's see from Scripture  <br> Proverbs 25:13 KJV <br> As the cold of snow in the time of harvest, so is a faithful messenger to them that send him: for he refresheth the soul of his masters. <br>  <br> We see here that cold here is used to illustrate how refreshing a faithful messenger is, let's see another scripture <br>  <br> Proverbs 25:25 KJV <br> As cold waters to a thirsty soul, so is good news from a far country. <br> Here we see again, cold water refreshes ! So when the the Lord said he wished if they were cold, he meant if they could be in a state where they can refresh others! <br>  Remember what the Lord said we should do to his servants; <br>  <br> Matthew 10:42 KJV <br> And whosoever shall give to drink unto one of these little ones a cup of cold water only in the name of a disciple, verily I say unto you, he shall in no wise lose his reward. <br>  <br> Notice the Lord said, we should give a cup of cold water not cup of water, now imagine how refreshing cold water is to man who is thirsty or has journeyed under the sun. <br> The Lord's wish for the church to be cold means He desires them to be in a state where they can provide refreshment to others. <br>  <br> 3. Lukewarm: This is the spiritual state where believers neither revive nor refresh others. It is a state of spiritual laziness and complacency, where one becomes unprofitable for the Lord's work. Scripture warns against slothfulness and encourages believers to be diligent (Hebrews 6:12). The lukewarm state described by the Lord in Revelation 3:16-17 is characterized by a focus on worldly wealth and a rejection of spiritual riches. The church in Laodicea was deceived into thinking they were self-sufficient, while in reality, they were spiritually impoverished, blind, and naked. <br>  <br> Luke warmness is indeed enhanced by carnality. The church in Laodicea had reached a state where they were focused on their physical well-being, particularly their wealth. They had been deceived into thinking that material possessions were all they needed, unconsciously rejecting the grace of God. The Lord provided them with a spiritual diagnosis, revealing that in the spiritual realm, they were miserable, poor, blind, and naked. Sadly, this pattern is evident in our present age, where the value of individuals is often measured by their material wealth. Many people forsake the Lord to chase after worldly pursuits, compromising their adherence to righteous standards for the sake of material gain. <br>  <br> The issue the Lord had with the church was not actually their wealth, but rather the fact that they had acquired wealth by their own efforts, without acknowledging God's grace. Notice that they said, /I am rich, I have become wealthy,/ without any reference to the Lord. They had indeed gained wealth, but not through faith and reliance on God's grace. Today, there are numerous Christians who are excessively focused on money, to the extent that they engage in unscrupulous practices in the name of financial prosperity. <br>  <br> Furthermore, spiritual Luke warmness fosters self-sufficiency. The church in Laodicea declared, /I have need of nothing!/ This self-sufficiency and self-righteousness lead us to believe that we do not require the grace of the Lord. Unfortunately, this mindset separates us from the Lord. Consider what the Lord said to the church: /Look! I am standing at the door and knocking. If anyone listens to my voice and opens the door, I will come in to him and eat with him, and he will eat with me/ (Revelation 3:20). How did the Lord end up outside? It occurs when we become overly preoccupied with worldly matters, when we adopt a carnal mindset, and when we forfeit our fellowship with the Lord. In doing so, we push the Lord away from our lives. <br>  <br> When one is hot, they have the ability to revive others, just like hot tea can warm you up in cold weather. When one is cold, they can bring refreshment, similar to cold water quenching your thirst on a hot day. However, when one is lukewarm, they become ineffective and unfit for any purpose. <br>  <br> But there is a solution. The Lord provided guidance in Revelation 3:19 (KJV): <br> /As many as I love, I rebuke and chasten: be zealous therefore, and repent./ <br> In our present age, it is important to recognize the danger of becoming lukewarm and compromising righteous standards for the sake of worldly gain. We should strive to be zealous for the Lord, burning with His fire, and ready to refresh and revive others through our spiritual walk and service. <br>  <br> If you realize that you have forsaken the ministry of the Word, prayer, worship, and service to God, it is important to repent before the Lord and seek His grace. He will graciously lift you up from where you have fallen and make you useful for His work, just as He said: <br> /Therefore, I advise you to buy from me gold refined in the fire, so you may be rich; and white clothes to wear, so that you may cover your shameful nakedness; and salve to put on your eyes, so that you may see/ (Revelation 3:20).",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 213,
          "title": "Question: Shalom Man of God. Please the Bible says in the book of Genesis that after God drove Cain away, Cain married his wife has children. Sir, who was the wife of Cain?",
          "headerText": "Who was the wife of Cain?",
          "content": "Answer: This is a very interesting question because it demands insight into the scriptures and this insight can only be through the operation of the Spirit of Prophecy, it is written;  <br>  <br> 1 Corinthians 13:2 KJV;  <br> And though I have the gift of prophecy, and understand all mysteries, and all knowledge;  <br>  <br> Notice here that the purpose of the gift of prophecy is not to enable a Man to know the names or problems of people but to enable a Man to know the know and understand the Mysteries of God.  <br> Now let's first see the passage in scriptures;  <br>  <br> Genesis 4:1-2 KJV <br> And Adam knew Eve his wife; and she conceived, and bare Cain, and said, I have gotten a man from the Lord.  <br> [2] And she again bare his brother Abel. And Abel was a keeper of sheep, but Cain was a tiller of the ground.  <br>  <br> So we see that Cain and Abel are the only children of Adam introduced in the story and Cain killed Abel and after this he was sent away and the scriptures says this;  <br>  <br> Genesis 4:16-17 KJV <br> And Cain went out from the presence of the Lord, and dwelt in the land of Nod, on the east of Eden.  <br> [17] And Cain knew his wife; and she conceived, and bare Enoch: and he builded a city, and called the name of the city, after the name of his son, Enoch.  <br>  <br> Now this is where the question comes from. Let us first establish some truths we can discern in this story.  <br>  <br> The First answer for this question is that Cain married his sister, now in those days before the Law was given to Moses, it was normal to get married to your sister, and obviously if Adam and Eve are the parents of all humans, then it means in the beginning the first generation of humans got married in the same family till they expanded, we see that Abraham married his step sister, he himself said this to Abimilech,  <br>  <br> Genesis 20:12 KJV <br> And yet indeed she (Sarah) is my sister; she is the daughter of my father, but not the daughter of my mother; and she became my wife.  <br>  <br> So it is possible that Cain married his sister, because those where the only women on earth, even Seth the brother of Cain (who was later born to Adam as a replacement for Abel) obviously married one of his sisters.  <br> Now we understand from scriptures that Adam had many sons and daughters, it is written;  <br>  <br> Genesis 5:4 KJV <br>  sons and daughters:  <br> So we see here that Adam had many sons and daughters, Remember God blessed him to be fruitful, multiply and fill the earth, so therefore Adam and Eve definitely brought forth many children but the scriptures highlights only Cain, Abel and Seth because there are those though whom the purpose of God is being introduced in the earth realm.  <br>  <br> Now the next thing we need to establish when Cain killed Abel is their ages, this also can be known through the scriptures, it is written;  <br>  <br> Genesis 5:3 KJV <br> And Adam lived an hundred and thirty years, and begat a son in his own likeness, after his image; and called his name Seth:  <br>  <br> Now we know that Adam brought forth Seth after Abel was killed for scripture said this;  <br>  <br> Genesis 4:25 KJV <br> And Adam knew his wife again; and she bare a son, and called his name Seth: For God, said she, hath appointed me another seed instead of Abel, whom Cain slew.  <br>  <br> So if Adam hath Seth at 130 years then probably Cain and Abel were around 100 to 120 years of Age when that event happened.  <br> So meaning they by this time would have already had sisters, and one of them probably became the wife of Cain.  <br>  <br> Now it is possible that Cain was already married even before he killed Abel but this also is a bit uncertain because according to scriptures he only knew his wife ( sexual relationship) and had his first son after he was driven away by God,  so if he was married why did he not have children yet ? Unless he got married after he was driven away, now it is possible that he left with sister but this also is controversial because Adam and Eve may not have given their daughter to follow a Man whom the Lord has cursed and driven out of his presence.;  <br>  <br> So this opens us up to another probability concerning the identity of the wife of Cain.  <br> Now, the second probability is that Cain got married to a Fallen Angel, this i will explain in the next post.  <br> Great grace <br> The Priest of God",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        },
        {
          "id": 214,
          "title": "Question:  Shalom Man of God, please the Bible says that after God drove Cain away, Cain married his wife and had children, sir who was the wife of Cain? ",
          "headerText": "Who was the wife of Cain (Part 2)?",
          "content": "Answer: Now in answering this Question the first probability i gave about the identity of the wife of Cain, is that she May have been his sister (this is explained in the previous post) <br>  <br> But now I will give another probability! <br> Now the second probability concerning the identity of the wife of Cain is that she May have been A Fallen Angel! <br> This means that Cain probably married a Fallen Angel, <br> Now this may sound strange but let's get back to scriptures and explore this probability; <br>  <br> Genesis 4:16-17 KJV <br> And Cain went out from the presence of the Lord, and dwelt in the land of Nod, on the east of Eden. [17] And Cain knew his wife; and she conceived, and bare Enoch: and he builded a city, and called the name of the city, after the name of his son, Enoch. <br>  <br> We see here that when God drove Cain, he left from the presence of God and dwelled in the Land of Nod. Now this is strange, how come there was a place on earth that was away from the presence of the Lord? What kind of Land was that, that was separated from the presence of God? <br>  <br> Now we need to go back and ask ourselves who founded that Land? And why is it called the Land of Nod? <br> Now to understand this we must go to the Hebrew text of scriptures because the Word /Nod/ is a Hebrew word and from the Hebrew dictionary the Hebrew word /Nod/ means /WANDERERS/ (Strong's Definitions : H5113) <br> So meaning Cain went to the Land of WANDERERS, who are these WANDERERS? Why was there a land on earth called the Land of WANDERERS? <br>  <br> Now who is a WANDERER? <br> According to Cambridge Dictionary a wanderer is defined as thus, /A wanderer is a person who travels around rather than settling in one place/ <br> Now let's go to scriptures and see who description fits; <br>  <br> Job 1:7 KJV <br> And the Lord said unto Satan, Whence comest thou? Then Satan answered the Lord, and said, From going to and fro in the earth, and from walking up and down in it. <br>  <br> Now we see from here that Satan is a WANDERER, He goes to and forth the earth, the Lord Jesus Himself revealed again the truth that all evil spirits are wanderers; <br>  <br> Matthew 12:43 KJV <br> When the unclean spirit is gone out of a man, he walketh through dry places, seeking rest, and findeth none. <br>  <br> Now the word translated as 'walketh' is the Greek word: Dierchomai which means to wander (Strong's Definition: G1330) <br>  <br> So we see here that when Cain left the presence of God, he went to the land inhabited by Satan and his Fallen Angels who were accursed to be wanderers on the earth. <br>  <br> Now to further explain this, we need to go back to the temptation of Adam and Eve; <br>  <br> Genesis 3:1 KJV <br> Now the serpent was more subtle than any beast of the field which the Lord God had made. And he said unto the woman, Yea, hath God said, Ye shall not eat of every tree of the garden? <br>  <br> Now this serpent who came and spoke to eve, who is he? Scriptures answers this thus? <br>  <br> Revelation 20:2 KJV <br> And he laid hold on the dragon, that old serpent, which is the Devil, and Satan, and bound him a thousand years, <br>  <br> So we see here that the serpent is none other but satan; so Satan was on earth in those days and he had access to the Garden of Eden, thus is probable that Satan was on earth and lived in the Land of Nod (WANDERERS) and had access to the Garden of Eden because at that moment, there was no angelic being guarding the entrance to the garden. <br>  <br> Now there is something interesting to notice here, when Adam and Eve sinned and God drove them out of the garden, He put an angel to guard the garden, now see this: <br>  <br> Genesis 3:24 KJV <br> So he drove out the man; and he placed at the east of the garden of Eden Cherubims, and a flaming sword which turned every way, to keep the way of the tree of life. <br>  <br> Notice that Lord blocked the entrance at the east side of the garden, now see where the Land of Nod was situated; <br>  <br> Genesis 4:16 KJV <br> And Cain went out from the presence of the Lord, and dwelt in the land of Nod, on the east of Eden. <br>  <br> Notice it was the east side? <br> Now let's move to some other scriptures that infers there might have been other beings on earth; when God drove Cain after he killed Abel, see what he said; <br>  <br> Genesis 4:14 KJV; <br> Behold, thou hast driven me out this day from the face of the earth; and from thy face shall I be hid; and I shall be a fugitive and a vagabond in the earth; and it shall come to pass, that every one that findeth me shall slay me. <br>  <br> Cain told God, that since he has been driven away from his family and from God, anyone that finds him will kill him, now this is strange, who are those on earth who will kill Cain? Given that at that Adam had two sons Cain and Abel and the rest were daughters who is Cain afraid of that will kill him? Also if Cain is the first to know what killing is then why was he afraid that someone else knows it too, unless before he killed Abel someone advised him, because God said this to Cain before he killed Abel; <br>  <br> Genesis 4:6-7 KJV <br> And the Lord said unto Cain, Why art thou wroth? and why is thy countenance fallen? <br> [7] If thou doest well, shalt thou not be accepted? and if thou doest not well, sin lieth at the door. And unto thee shall be his desire, and thou shalt rule over him. <br>  <br> Now it is probable that Cain was corrupted because he had surely come in contact with the inhabitants of the Land of Nod, who told him to kill Abel because Cain on his own will never know what killing his brother is, and more the Lord Jesus said this concerning Satan. <br>  <br> John 8:44 KJV; <br> Ye are of your father the devil, and the lusts of your father ye will do. He was a murderer from the beginning. <br>  <br> Notice that Jesus calls Satan a Murderer, and says he was a Murderer from the beginning but when we check the beginning it is Cain that murdered, when the Jews wanted to kill Jesus, he said they want to do the lusts of Satan, by this Jesus was saying that Cain carried out the lusts of Satan. <br>  <br> More scriptures define again who is a murderer; <br> 1 John 3:15 KJV; <br> Whosoever hateth his brother is a murderer: and ye know that no murderer hath eternal life abiding in him. <br>  <br> So when probably Satan filled the heart of Cain with hatred for Abel and that's when Cain became a murderer and carried out the lusts of Satan. <br> So when Cain killed Abel, and God drove him out of His presence, Cain was now afraid that those who taught him how to kill, would kill him as well. <br> Now at the probability that Cain married a fallen angel, let us see the scriptures again; <br>  <br> Genesis 4:16-17 KJV <br> And Cain went out from the presence of the Lord, and dwelt in the land of Nod, on the east of Eden. <br> [17] And Cain knew his wife; and she conceived, and bare Enoch: and he builded a city, and called the name of the city, after the name of his son, Enoch. <br>  <br> Notice that the wife of Cain is introduced into the story only after he went into the Land of Nod, so probably, he met her there. <br> Now we know from scriptures that there are instances where Angels got married to Humans, it is written; <br>  <br> Genesis 6:1-2,4 KJV <br> And it came to pass, when men began to multiply on the face of the earth, and daughters were born unto them, <br> [2] That the sons of God saw the daughters of men that they were fair; and they took them wives of all which they chose. <br> [4] There were giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bare children to them, the same became mighty men which were of old, men of renown. <br>  <br> We see here how Angels got married to Humans and gave birth to children. So such marriages are possible. Now you may say that scripture said /sons of God/ and not angels, but the scriptures reveal that in those days Angels were called sons of God. <br>  <br> Job 38:4-7 KJV; <br> Where wast thou when I laid the foundations of the earth? declare, if thou hast understanding <br> .[5] Who hath laid the measures thereof, if thou knowest? or who hath stretched the line upon it? <br> [6] Whereupon are the foundations thereof fastened? or who laid the corner stone thereof; <br> [7] When the morning stars sang together, and all the sons of God shouted for joy? <br> Notice God tells Job that when He was laying the foundation of the earth, the sons of God where there shouting for Joy, this cannot be humans because humans came only after the earth was created. <br>  <br> Second proof that those sons of God are angels is this; <br>  <br> Job 1:6 KJV <br> Now there was a day when the sons of God came to present themselves before the Lord, and Satan came also among them. <br>  <br> We see a meeting of beings called Sons of God and Job the most righteousness man on earth in those days was absent there so thus those sons were not men and more so Satan too came. <br> So we see that Angels through a hidden strategy can take upon themselves the form of men or women and get married to humans. <br> So it is probable that Cain came in contact with Fallen Angels and  got married to one of them, and this can also be deduced from another event; <br>  <br> Genesis 4:16-17 KJV; <br> And Cain went out from the presence of the Lord, and dwelt in the land of Nod, on the east of Eden. <br> [17] And Cain knew his wife; and she conceived, and bare Enoch: and he builded a city, and called the name of the city, after the name of his son, Enoch. <br> Now when God drove Cain, he was alone so how did he build a city? One Man cannot build a house talk less of building a city, but there is something deeper there, he built a city in scriptures the word city stands for economy or civilization and when cain built a city he named it Enoch, now the word Enoch is a Hebrew word that means INITIATED (Strong's Dictionary H2596) <br> Now Cain call his city the city of the INITIATED, but why INITIATED? INITIATED into what? <br> To prove that this men were initiated into economy of fallen Angels we see this from scriptures; <br> Genesis 4:21-22 KJV; <br> And his brother's name was Jubal: he was the father of all such as handle the harp and organ. <br> [22] And Zillah, she also bare Tubal-cain, an instructer of every artificer in brass and iron: and the sister of Tubal-cain was Naamah. <br>  <br> We see that the Grand sons of Enoch are the ones who brought instruments of music and war on earth but we know from this instant that music had only been used in heaven (Job 38:7) and instruments for war were only used in heaven (Revelation 12:7-8) now how did the children of Enoch the child of Cain know mysteries that were known only of angels except they were initiated into the knowledge of those mysteries by Fallen angels. <br>  <br> Now I'm not saying that this is the truth of the Matter, it’s just a probability,  scriptures itself is silent on this matter, for it is not written in the Bible who was the wife of Cain, but through the Wisdom of God we May interpret the silence of scriptures without necessarily drawing reason from extrabiblical sources. <br>  <br>  So I do not impose this probabilities as truth, I advice you to study this for yourself and then also share your findings with me. <br>  <br> Great grace <br> The Priest of God <br> ",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        }
      ],
      "counsels": [
        {
          "id": 31,
          "title": "Counsel for Marital Relationships (01) ",
          "headerText": "Counsel for Marital Relationships (01) ",
          "content": "The greatest cause for marital frustration is BROKEN EXPECTATIONS <br><br>Be careful of what you expect from your partner, you May be putting them under pressure to give to you what they do not have. <br><br> Most often, people enter marriage with EXPECTATIONS but they make the mistake of not telling their partner what they expect from them, unfortunately the partner out of ignorance of what the other person expects maybe doing the contrary things. <br><br> If you have expectations then tell your partner of them, so that they will tell you if they are able to give it to you or not, and if it is something they are not able to do when you tell them they will learn how to do it.  <br><br> NEVER EVER expect your partner to know what your expectations are by assumptions or presumptions. For how shall they know if you don't tell them? <br> <br> Other times, our experiences in our former relationships shape our expectations in our present relationships, meaning you either expect your partner to behave like your /Ex/, you will be constantly comparing them in your heart and sometimes you will say it to them; this is bad because you are hindering them from offering what they have. You are frustrating them from expressing their Love for you and to you by their own uniqueness because you want them to be like your Ex. <br><br> On the other hand, some other people because of the wrong things their ex did to them, they start interpreting their present partner's actions by their past experiences. When something happens they will either be thinking or saying; / this is how it began with that other person/ and they become very JUDGMENTAL, and this in turn suffocates the Love of the present partner who is confused because of the condemnation they receive even for matters that they did not intentionally do wrong or may not even be wrong. <br><br> It's more important to Focus on what You are bringing into Your marriage than on what Your Partner is bringing, this will help You to focus on enjoying the strengths and uniqueness of Your partner, while also proofing your Love by bearing their weaknesses and not complaining about them nor being offended because you did not expect that from them, for Your responsibility is not to complain about their weaknesses but to help them overcome them! <br><br> How do You think we Can handle the issue BROKEN EXPECTATIONS...? <br><br>Share your understanding with us in the comment section, and the Man of God will personally Respond to your questions or counsel ...",
          "picture": "image3.jpg",
          "date": "2024-01-27"
        }
        
      ],
      "prophetic_revelations": [
        {
          "id": 41,
          "title": "Urgent Prophetic Revelation: A Call For Intercession To Avert The Agenda Of The Evil Ones Against Nigeria And Cameroon.",
          "headerText": "A Call For Intercession To Avert The Agenda Of The Evil Ones Against Nigeria And Cameroon.",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit.",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        },
        {
          "id": 42,
          "title": "Urgent Prophetic Revelation",
          "headerText": "Urgent Prophetic Revelation",
          "content": "I Kevin, the Priest of God, while in prayers was carried into the visions of God.  <br>  <br> The plans of the wicked against the sons of Men were revealed unto me for the Lord God is a GREAT LIGHT. He sees and hears what is said and done in the habitations of darkness.  <br>  <br> The Lord carried my spirit into a strange gathering in the habitations of darkness and I saw a conclave of demons. The demons were in a meeting and were planning how to attack families, marriages and homes.  <br> I heard how instructions were given to all of them by the chief demon who presided over the meeting, he said :  <br> /Enter their homes, set discord amongst them, and turn them against one another, quench the light of the house and crush the Pillars of the house so that it may crumble and the family become subject to unbearable sufferings that will cause them to go astray./  <br>  <br> At this point the vision ceased. When I asked the Lord the meaning of this, this what the Holy Spirit brought to my remembrance:  <br>  <br> Job 1:18-19 KJV <br> /While he was yet speaking, there came also another, and said, Thy sons and thy daughters were eating and drinking wine in their eldest brother's house: And, behold, there came a great wind from the wilderness, and smote the four corners of the house, and it fell upon the young men, and they are dead; and I only am escaped alone to tell thee. / <br>  <br> /And the Lord said to me that the Pillar of the Family is the one who is bearing the burden for the growth of the Family./  <br>  <br> And then the Holy Spirit brought this scripture to my remembrance:  <br>  <br> /Neither do men light a candle, and put it under a bushel, but on a candlestick; and it giveth light unto all that are in the house./  <br> Matthew 5:15 KJV <br> And the Lord said: /the Light of the house is the person in the Family who was showing the family the way to Christ through their words and their works /And the Spirit said to me :  <br> /I have shown you what the enemy has planned against the sons of Men. Engage the blood of the Lamb in prayer so that their counsel will be frustrated and their hands will not perform their devices/  <br> Please I counsel everyone to take this vision very seriously and engage the blood of the Lamb for the preservation of your family!  <br>  <br> I pray for you: /By the blood of the Lamb, the Light and the Pillar of your Family are preserved from the eyes and from the hands of the wicked in the Name of Jesus.../ <br>Prophet Kevin OnLine",
          "picture": "image1.jpg",
          "date": "2024-01-29"
        }      
      ]
    }
  },
  "testimonies": {
    "Home": [
        {
          "id": 1,
          "name": "John Doe",
          "date": "2023-12-15",
          "country": "United States",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/john_doe.jpg"
        },
        {
          "id": 2,
          "name": "Jane Smith",
          "date": "2023-11-28",
          "country": "Canada",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/jane_smith.jpg"
        },
        {
          "id": 3,
          "name": "David Williams",
          "date": "2023-10-05",
          "country": "United Kingdom",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/david_williams.jpg"
        }
    ],
    "testimony": [
        {
          "id": 1,
          "name": "John Doe",
          "date": "2023-12-15",
          "country": "United States",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/john_doe.jpg"
        },
        {
          "id": 2,
          "name": "Jane Smith",
          "date": "2023-11-28",
          "country": "Canada",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/jane_smith.jpg"
        },
        {
          "id": 3,
          "name": "David Williams",
          "date": "2023-10-05",
          "country": "United Kingdom",
          "content": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed et semper dui. Nulla facilisi. Sed blandit, eros quis ullamcorper consequat, velit mi fringilla augue, vitae dapibus urna mauris sed tellus.",
          "image": "https://example.com/images/david_williams.jpg"
        }
    ]
  },
  "videos": {
    "Home": [
        {
          "id": 1,
          "title": "John Doe",
          "url": "https://example.com/images/john_doe.jpg",
          "facebookShareUrl": "https://www.facebook.com/sharer"
        },
        {
          "id": 2,
          "title": "Jane Smith",
          "url": "https://example.com/images/jane_smith.jpg",
          "facebookShareUrl": "https://www.facebook.com/sharer"
        },
        {
          "id": 3,
          "title": "David Williams",
          "url": "https://example.com/images/david_williams.jpg",
          "facebookShareUrl": "https://www.facebook.com/sharer"
        }
    ],
    "ministry": {
      "teaching": [
          {
            "id": 1,
            "title": "John Doe",
            "url": "https://example.com/images/john_doe.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 2,
            "title": "Jane Smith",
            "url": "https://example.com/images/jane_smith.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 3,
            "title": "David Williams",
            "url": "https://example.com/images/david_williams.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          }
      ],
      "healing": [
          {
            "id": 1,
            "title": "John Doe",
            "url": "https://example.com/images/john_doe.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 2,
            "title": "Jane Smith",
            "url": "https://example.com/images/jane_smith.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 3,
            "title": "David Williams",
            "url": "https://example.com/images/david_williams.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          }
      ],
      "prophetic": [
          {
            "id": 1,
            "title": "John Doe",
            "url": "https://example.com/images/john_doe.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 2,
            "title": "Jane Smith",
            "url": "https://example.com/images/jane_smith.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          },
          {
            "id": 3,
            "title": "David Williams",
            "url": "https://example.com/images/david_williams.jpg",
            "facebookShareUrl": "https://www.facebook.com/sharer"
          }
      ]
    }
  }
}